Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: You can negate a sub-query inverting its operator:
it: È possibile negare una sottoquery invertendone l'operatore:

source: or by explicit negation with the “``~``” unary operator:
it: o per negazione esplicita con l'operatore unario "''~''"":

source: Due to Python restrictions in overloading “``and``” and “``or``” operators, these cannot be used in forming queries. The binary operators “``&``” and “``|``” must be used instead. Note that these operators (unlike “``and``” and “``or``”) have higher precedence than comparison operators, so the “extra” parentheses in the above examples are mandatory. Similarly, the unary operator “``~``” has higher precedence than comparison operators, so ``~``-negated comparisons must also be parenthesized.
it: A causa delle restrizioni di Python nell'overload degli operatori "''and''" e "''or''", questi non possono essere utilizzati nella formazione di query. Al loro posto devono essere utilizzati gli operatori binari "''&''" e "''|''". Si noti che questi operatori (a differenza di "''and''" e "''or''") hanno una precedenza maggiore rispetto agli operatori di confronto, quindi le parentesi "extra" negli esempi precedenti sono obbligatorie. Allo stesso modo, l'operatore unario "''~''" ha una precedenza maggiore rispetto agli operatori di confronto, quindi anche i confronti negati da ''~'' devono essere messi tra parentesi.

source: It is also possible to build queries using in-place logical operators:
it: È anche possibile creare query utilizzando operatori logici sul posto:

source: ``count``, ``isempty``, ``delete``, ``update``
it: ''Conta'', ''Èvuoto'', ''Elimina'', ''Aggiorna''

source: You can count records in a set:
it: È possibile contare i record in un set:

source: Notice that ``count`` takes an optional ``distinct`` argument which defaults to False, and it works very much like the same argument for ``select``. ``count`` has also a ``cache`` argument that works very much like the equivalent argument of the ``select`` method.
it: Si noti che ''count'' accetta un argomento opzionale ''distinct'' che di default è False, e funziona in modo molto simile allo stesso argomento per ''select''. ''count'' ha anche un argomento ''cache'' che funziona in modo molto simile all'argomento equivalente del metodo ''select''.

source: Sometimes you may need to check if a table is empty. A more efficient way than counting is using the ``isempty`` method:
it: A volte potrebbe essere necessario controllare se una tabella è vuota. Un modo più efficiente del conteggio è usare il metodo ''isempty'':

source: You can delete records in a set:
it: È possibile eliminare i record in un set:

source: The ``delete`` method returns the number of records that were deleted.
it: Il metodo ''delete'' restituisce il numero di record che sono stati eliminati.

source: And you can update all records in a set by passing named arguments corresponding to the fields that need to be updated:
it: Ed è possibile aggiornare tutti i record in un set passando argomenti denominati corrispondenti ai campi che devono essere aggiornati:

source: The ``update`` method returns the number of records that were updated.
it: Il metodo ''update'' restituisce il numero di record che sono stati aggiornati.

source: Expressions
it: Espressioni

source: The value assigned an update statement can be an expression. For example consider this model
it: Il valore assegnato a un'istruzione update può essere un'espressione. Si consideri, ad esempio, questo modello

source: The values used in queries can also be expressions
it: I valori utilizzati nelle query possono anche essere espressioni

source: ``case``
it: ''Caso''

source: An expression can contain a case clause for example:
it: Un'espressione può contenere una clausola case, ad esempio:

source: py4web also allows updating a single record that is already in memory using ``update_record``
it: py4web permette anche di aggiornare un singolo record già in memoria usando ''update_record''

source: ``update_record`` should not be confused with
it: ''update_record'' non deve essere confuso con

source: because for a single row, the method ``update`` updates the row object but not the database record, as in the case of ``update_record``.
it: Perché per una singola riga, il metodo ''update'' aggiorna l'oggetto riga ma non il record del database, come nel caso di ''update_record''.

source: It is also possible to change the attributes of a row (one at a time) and then call ``update_record()`` without arguments to save the changes:
it: E' anche possibile cambiare gli attributi di una riga (uno alla volta) e poi chiamare ''update_record()'' senza argomenti per salvare le modifiche:

source: Note, you should avoid using ``row.update_record()`` with no arguments when the ``row`` object contains fields that have an ``update`` attribute (e.g., ``Field('modified_on', update=datetime.datetime.utcnow)``). Calling ``row.update_record()`` will retain *all* of the existing values in the ``row`` object, so any fields with ``update`` attributes will have no effect in this case. Be particularly mindful of this with tables that include ``auth.signature``.
it: Nota, si dovrebbe evitare di usare ''row.update_record()'' senza argomenti quando l'oggetto ''row'' contiene campi che hanno un attributo ''update'' (ad esempio, ''Field('modified_on', update=datetime.datetime.utcnow)''). Chiamare ''row.update_record()'' manterrà *tutti* i valori esistenti nell'oggetto ''row'', quindi tutti i campi con attributi ''update'' non avranno alcun effetto in questo caso. Prestare particolare attenzione a questo aspetto con le tabelle che includono ''auth.signature''.

source: The ``update_record`` method is available only if the table’s ``id`` field is included in the select, and ``cacheable`` is not set to ``True``.
it: Il metodo ''update_record'' è disponibile solo se il campo ''id'' della tabella è incluso nella selezione, e ''cacheable'' non è impostato a ''True''.

source: Inserting and updating from a dictionary
it: Inserimento e aggiornamento da un dizionario

source: A common issue consists of needing to insert or update records in a table where the name of the table, the field to be updated, and the value for the field are all stored in variables. For example: ``tablename``, ``fieldname``, and ``value``.
it: Un problema comune consiste nella necessità di inserire o aggiornare i record in una tabella in cui il nome della tabella, il campo da aggiornare e il valore del campo sono tutti memorizzati in variabili. Ad esempio: ''tablename'', ''fieldname'' e ''value''.

source: The insert can be done using the following syntax:
it: L'inserimento può essere eseguito utilizzando la seguente sintassi:

source: The update of record with given id can be done with:
it: L'aggiornamento del record con l'id specificato può essere effettuato con:

source: Notice we used ``table._id`` instead of ``table.id``. In this way the query works even for tables with a primary key field with type other than “id”.
it: Notate che abbiamo usato ''table._id'' invece di ''table.id''. In questo modo la query funziona anche per le tabelle con un campo di chiave primaria con tipo diverso da "id".

source: ``first`` and ``last``
it: ''primo'' e ''ultimo''

source: Given a Rows object containing records:
it: Dato un oggetto Rows contenente record:

source: are equivalent to
it: sono equivalenti a

source: Notice, ``first()`` and ``last()`` allow you to obtain obviously the first and last record present in your query, but this won’t mean that these records are going to be the first or last inserted records. In case you want the first or last record inputted in a given table don’t forget to use ``orderby=db.table_name.id``. If you forget you will only get the first and last record returned by your query which are often in a random order determined by the backend query optimiser.
it: Si noti che ''first()'' e ''last()'' consentono di ottenere ovviamente il primo e l'ultimo record presente nella query, ma questo non significa che questi record saranno il primo o l'ultimo record inserito. Nel caso in cui si desideri inserire il primo o l'ultimo record in una determinata tabella, non dimenticare di usare ''orderby=db.table_name.id''. Se ci si dimentica, si otterranno solo il primo e l'ultimo record restituiti dalla query, che sono spesso in un ordine casuale determinato dall'ottimizzatore di query back-end.

source: ``as_dict`` and ``as_list``
it: ''as_dict'' e ''as_list''

source: A Row object can be serialized into a regular dictionary using the ``as_dict()`` method and a Rows object can be serialized into a list of dictionaries using the ``as_list()`` method. Here are some examples:
it: Un oggetto Row può essere serializzato in un normale dizionario usando il metodo ''as_dict()'' e un oggetto Rows può essere serializzato in un elenco di dizionari usando il metodo ''as_list()''. Ecco alcuni esempi:

source: These methods are convenient for passing Rows to generic views and or to store Rows in sessions (Rows objects themselves cannot be serialized because they contain a reference to an open DB connection):
it: Questi metodi sono utili per passare le righe a viste generiche e/o per archiviare le righe nelle sessioni (gli oggetti Rows stessi non possono essere serializzati perché contengono un riferimento a una connessione DB aperta):

source: Combining rows
it: Combinazione di righe

source: Rows objects can be combined at the Python level. Here we assume:
it: Gli oggetti Rows possono essere combinati a livello di Python. Qui assumiamo:

source: You can do union of the records in two sets of rows:
it: È possibile eseguire l'unione dei record in due serie di righe:

source: You can do union of the records removing duplicates:
it: È possibile eseguire l'unione dei record rimuovendo i duplicati:

source: You can do intersection of the records in two sets of rows:
it: È possibile eseguire l'intersezione dei record in due serie di righe:

source: ``find``, ``exclude``, ``sort``
it: ''trovare'', ''escludere'', ''ordinare''

source: Some times you need to perform two selects and one contains a subset of a previous select. In this case it is pointless to access the database again. The ``find``, ``exclude`` and ``sort`` objects allow you to manipulate a Rows object and generate another one without accessing the database. More specifically: - ``find`` returns a new set of Rows filtered by a condition and leaves the original unchanged. - ``exclude`` returns a new set of Rows filtered by a condition and removes them from the original Rows. - ``sort`` returns a new set of Rows sorted by a condition and leaves the original unchanged.
it: A volte è necessario eseguire due selezioni e una contiene un sottoinsieme di una selezione precedente. In questo caso è inutile accedere nuovamente al database. Gli oggetti ''find'', ''exclude'' e ''sort'' consentono di manipolare un oggetto Rows e generarne un altro senza accedere al database. Più specificamente: - ''find'' restituisce un nuovo set di righe filtrate da una condizione e lascia invariato l'originale. - ''exclude'' restituisce un nuovo set di righe filtrate da una condizione e le rimuove dalle righe originali. - ''sort'' restituisce un nuovo set di righe ordinate in base a una condizione e lascia invariato l'originale.

source: All these methods take a single argument, a function that acts on each individual row.
it: Tutti questi metodi accettano un singolo argomento, una funzione che agisce su ogni singola riga.

source: Here is an example of usage:
it: Di seguito è riportato un esempio di utilizzo:

source: They can be combined:
it: Possono essere combinati:

source: Sort takes an optional argument ``reverse=True`` with the obvious meaning.
it: Sort accetta un argomento opzionale ''reverse=True'' con l'ovvio significato.

source: The ``find`` method has an optional ``limitby`` argument with the same syntax and functionality as the Set ``select`` method.
it: Il metodo ''find'' ha un argomento opzionale ''limitby'' con la stessa sintassi e funzionalità del metodo set ''select''.

source: Caching selects
it: Selezioni di memorizzazione nella cache

source: The select method also takes a ``cache`` argument, which defaults to None. For caching purposes, it should be set to a tuple where the first element is the cache model (``cache.ram``, ``cache.disk``, etc.), and the second element is the expiration time in seconds.
it: Il metodo select accetta anche un argomento ''cache'', che per impostazione predefinita è None. Ai fini della memorizzazione nella cache, dovrebbe essere impostato su una tupla in cui il primo elemento è il modello di cache (''cache.ram'', ''cache.disk'', ecc.), e il secondo elemento è il tempo di scadenza in secondi.

source: In the following example, you see a controller that caches a select on the previously defined db.log table. The actual select fetches data from the back-end database no more frequently than once every 60 seconds and stores the result in memory. If the next call to this controller occurs in less than 60 seconds since the last database IO, it simply fetches the previous data from memory.
it: Nell'esempio seguente viene visualizzato un controller che memorizza nella cache una selezione nella tabella db.log definita in precedenza. La selezione effettiva recupera i dati dal database back-end con una frequenza non superiore a una volta ogni 60 secondi e archivia il risultato in memoria. Se la chiamata successiva a questo controller si verifica in meno di 60 secondi dall'ultimo I/O del database, recupera semplicemente i dati precedenti dalla memoria.

source: The ``select`` method has an optional ``cacheable`` argument, normally set to False. When ``cacheable=True`` the resulting ``Rows`` is serializable but The ``Row``\ s lack ``update_record`` and ``delete_record`` methods.
it: Il metodo ''select'' ha un argomento opzionale ''cacheable'', normalmente impostato a False. Quando ''cacheable=True'' le ''Righe'' risultanti sono serializzabili, ma le ''Riga''\ mancano dei metodi ''update_record'' e ''delete_record''.

source: If you do not need these methods you can speed up selects a lot by setting the ``cacheable`` attribute:
it: Se non hai bisogno di questi metodi puoi velocizzare molto le selezioni impostando l'attributo ''cacheable'':

source: When the ``cache`` argument is set but ``cacheable=False`` (default) only the database results are cached, not the actual Rows object. When the ``cache`` argument is used in conjunction with ``cacheable=True`` the entire Rows object is cached and this results in much faster caching:
it: Quando l'argomento ''cache'' è impostato ma ''cacheable=False'' (default) vengono memorizzati nella cache solo i risultati del database, non l'oggetto Rows effettivo. Quando l'argomento ''cache'' viene usato in combinazione con ''cacheable=True'' l'intero oggetto Rows viene memorizzato nella cache e questo si traduce in una memorizzazione nella cache molto più veloce:

source: Computed and Virtual fields
it: Campi calcolati e virtuali

source: Computed fields
it: Campi calcolati

source: DAL fields may have a ``compute`` attribute. This must be a function (or lambda) that takes a Row object and returns a value for the field. When a new record is modified, including both insertions and updates, if a value for the field is not provided, py4web tries to compute from the other field values using the ``compute`` function. Here is an example:
it: I campi DAL possono avere un attributo ''compute''. Deve trattarsi di una funzione (o lambda) che accetta un oggetto Row e restituisce un valore per il campo. Quando un nuovo record viene modificato, inclusi sia gli inserimenti che gli aggiornamenti, se non viene fornito un valore per il campo, py4web tenta di calcolare dai valori degli altri campi usando la funzione ''compute''. Ecco un esempio:

source: Notice that the computed value is stored in the db and it is not computed on retrieval, as in the case of virtual fields, described next. Two typical applications of computed fields are:
it: Si noti che il valore calcolato è memorizzato nel db e non viene calcolato al momento del recupero, come nel caso dei campi virtuali, descritto di seguito. Due applicazioni tipiche dei campi calcolati sono:

source: in wiki applications, to store the processed input wiki text as HTML, to avoid re-processing on every request
it: nelle applicazioni wiki, per memorizzare il testo wiki di input elaborato come HTML, per evitare la rielaborazione ad ogni richiesta

source: for searching, to compute normalized values for a field, to be used for searching.
it: per la ricerca, per calcolare i valori normalizzati per un campo, da utilizzare per la ricerca.

source: Computed fields are evaluated in the order in which they are defined in the table definition. A computed field can refer to previously defined computed fields.
it: I campi calcolati vengono valutati nell'ordine in cui sono definiti nella definizione della tabella. Un campo calcolato può fare riferimento a campi calcolati definiti in precedenza.

source: Virtual fields
it: Campi virtuali

source: Virtual fields are also computed fields (as in the previous subsection) but they differ from those because they are *virtual* in the sense that they are not stored in the db and they are computed each time records are extracted from the database. They can be used to simplify the user’s code without using additional storage but they cannot be used for searching.
it: I campi virtuali sono anch'essi campi calcolati (come nella sottosezione precedente) ma si differenziano da questi perché sono *virtuali* nel senso che non sono memorizzati nel db e vengono calcolati ogni volta che i record vengono estratti dal database. Possono essere utilizzati per semplificare il codice dell'utente senza utilizzare spazio di archiviazione aggiuntivo, ma non possono essere utilizzati per la ricerca.

source: New style virtual fields (experimental)
it: Nuovi campi virtuali di stile (sperimentali)

source: py4web provides a new and easier way to define virtual fields and lazy virtual fields. This section is marked experimental because the APIs may still change a little from what is described here.
it: py4web fornisce un modo nuovo e più semplice per definire i campi virtuali e i campi virtuali pigri. Questa sezione è contrassegnata come sperimentale perché le API potrebbero ancora cambiare leggermente rispetto a quanto descritto qui.

source: Here we will consider the same example as in the previous subsection. In particular we consider the following model:
it: Qui prenderemo in considerazione lo stesso esempio della sottosezione precedente. In particolare consideriamo il seguente modello:

source: One can define a ``total_price`` virtual field as
it: Si può definire un campo virtuale ''total_price'' come

source: i.e. by simply defining a new field ``total_price`` to be a ``Field.Virtual``. The only argument of the constructor is a function that takes a row and returns the computed values.
it: cioè semplicemente definendo un nuovo campo ''total_price'' come un ''Field.Virtual''. L'unico argomento del costruttore è una funzione che accetta una riga e restituisce i valori calcolati.

source: A virtual field defined as the one above is automatically computed for all records when the records are selected:
it: Un campo virtuale definito come quello precedente viene calcolato automaticamente per tutti i record quando i record sono selezionati:

source: It is also possible to define method fields which are calculated on-demand, when called. For example:
it: È anche possibile definire i campi del metodo che vengono calcolati su richiesta, quando vengono chiamati. Per esempio:

source: In this case ``row.discounted_total`` is not a value but a function. The function takes the same arguments as the function passed to the ``Method`` constructor except for ``row`` which is implicit (think of it as ``self`` for objects).
it: In questo caso ''row.discounted_total'' non è un valore ma una funzione. La funzione accetta gli stessi argomenti della funzione passata al costruttore ''Method'' tranne che per ''row'' che è implicito (pensatelo come ''self'' per gli oggetti).

source: The lazy field in the example above allows one to compute the total price for each ``item``:
it: Il campo lazy nell'esempio precedente permette di calcolare il prezzo totale per ogni ''articolo'':

source: And it also allows to pass an optional ``discount`` percentage (say 15%):
it: E permette anche di far passare una percentuale di ''sconto'' opzionale (diciamo il 15%):

source: Virtual and Method fields can also be defined in place when a table is defined:
it: I campi Virtuale e Metodo possono anche essere definiti sul posto quando viene definita una tabella:

source: Mind that virtual fields do not have the same attributes as regular fields (length, default, required, etc). They do not appear in the list of ``db.table.fields``.
it: Tieni presente che i campi virtuali non hanno gli stessi attributi dei campi normali (lunghezza, predefinito, obbligatorio, ecc.). Non appaiono nell'elenco di ''db.table.fields''.

source: Old style virtual fields
it: Campi virtuali vecchio stile

source: In order to define one or more virtual fields, you can also define a container class, instantiate it and link it to a table or to a select. For example, consider the following table:
it: Per definire uno o più campi virtuali, è anche possibile definire una classe contenitore, crearne un'istanza e collegarla a una tabella o a una selezione. Si consideri, ad esempio, la tabella seguente:

source: Notice that each method of the class that takes a single argument (self) is a new virtual field. ``self`` refers to each one row of the select. Field values are referred by full path as in ``self.item.unit_price``. The table is linked to the virtual fields by appending an instance of the class to the table’s ``virtualfields`` attribute.
it: Si noti che ogni metodo della classe che accetta un singolo argomento (self) è un nuovo campo virtuale. ''self'' si riferisce a ciascuna riga della selezione. I valori dei campi sono indicati dal percorso completo come in ''self.item.unit_price''. La tabella è collegata ai campi virtuali aggiungendo un'istanza della classe all'attributo ''virtualfields'' della tabella.

source: Virtual fields can also access recursive fields as in
it: I campi virtuali possono anche accedere a campi ricorsivi come in

source: Notice the recursive field access ``self.order_item.item.unit_price`` where ``self`` is the looping record.
it: Si noti l'accesso al campo ricorsivo ''self.order_item.item.unit_price'' dove ''self'' è il record di looping.

source: They can also act on the result of a JOIN
it: Possono anche agire sul risultato di un JOIN

source: Notice how in this case the syntax is different. The virtual field accesses both ``self.item.unit_price`` and ``self.order_item.quantity`` which belong to the join select. The virtual field is attached to the rows of the table using the ``setvirtualfields`` method of the rows object. This method takes an arbitrary number of named arguments and can be used to set multiple virtual fields, defined in multiple classes, and attach them to multiple tables:
it: Si noti come in questo caso la sintassi sia diversa. Il campo virtuale accede sia a ''self.item.unit_price'' che a ''self.order_item.quantity'' che appartengono alla selezione di join. Il campo virtuale è collegato alle righe della tabella usando il metodo ''setvirtualfields'' dell'oggetto rows. Questo metodo accetta un numero arbitrario di argomenti denominati e può essere utilizzato per impostare più campi virtuali, definiti in più classi, e associarli a più tabelle:
