Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-12.po
Languages: it

source: The Form class provides a high-level API for quickly building CRUD (create, update and delete) forms, especially for working on an existing database table. It can generate and process a form from a list of desired fields and/or from an existing database table.
it: La classe Form fornisce un'API di alto livello per la creazione rapida di moduli CRUD (creazione, aggiornamento ed eliminazione), in particolare per l'utilizzo di una tabella di database esistente. Può generare ed elaborare un modulo da un elenco di campi desiderati e/o da una tabella di database esistente.

source: There are 3 typs of forms:
it: Esistono 3 tipi di moduli:

source: CRUD Create forms:
it: CRUD Crea moduli:

source: CRUD Update forms:
it: Moduli di aggiornamento CRUD:

source: Non-CRUD forms (not associated to a database):
it: Moduli non CRUD (non associati a un database):

source: The use of flash is optional. ``flash`` is defined in ``common.py`` in the scaffolding application. It simply stores a message in a cookie so it can be recovered and displayed after redirection. This is done in the default layout.
it: L'uso del flash è facoltativo. ''Flash'' è definito in ''common.py'' nell'applicazione di ponteggio. Memorizza semplicemente un messaggio in un cookie in modo che possa essere recuperato e visualizzato dopo il reindirizzamento. Questa operazione viene eseguita nel layout predefinito.

source: In this chapter from now on we will assume the following model and an app derived from the scaffolding app:
it: In questo capitolo d'ora in poi assumeremo il seguente modello e un'app derivata dall'app di scaffolding :

source: The Form constructor
it: Il costruttore Form

source: The ``Form`` constructor accepts the following arguments:
it: Il costruttore ''Form'' accetta i seguenti argomenti:

source: Where:
it: Dove:

source: ``table``: a DAL table or a list of fields
it: ''tabella'': una tabella DAL o un elenco di campi

source: ``record``: a DAL record or record id
it: ''record'': un record DAL o un ID record

source: ``readonly``: set to True to make a readonly form
it: ''readonly'': impostato su True per creare una forma di sola lettura

source: ``deletable``: set to False to disallow deletion of record
it: ''deletable'': impostato su False per impedire l'eliminazione del record

source: ``formstyle``: a function that renders the form using helpers. Can be FormStyleDefault (default), FormStyleBulma or FormStyleBootstrap4
it: ''formstyle'': una funzione che rende il form usando degli helper. Può essere FormStyleDefault (impostazione predefinita), FormStyleBulma o FormStyleBootstrap4

source: ``dbio``: set to False to prevent any DB writes
it: ''dbio'': impostato a False per impedire qualsiasi scrittura DB

source: ``keep_values``: if set to true, it remembers the values of the previously submitted form
it: ''keep_values'': se impostato a true, ricorda i valori del modulo inviato in precedenza

source: ``form_name``: the optional name of this form
it: ''form_name'': il nome facoltativo di questa forma

source: ``hidden``: a dictionary of hidden fields that is added to the form
it: ''hidden'': un dizionario di campi nascosti che viene aggiunto al modulo

source: ``validation``: an optional validator, see :ref:`Validation functions`
it: ''validation'': un validatore opzionale, vedi :ref:'Funzioni di validazione''

source: ``csrf_session``: if None, no csrf token is added. If a session, then a CSRF token is added and verified
it: ''csrf_session'': se None, non viene aggiunto alcun token csrf. Se si tratta di una sessione, viene aggiunto e verificato un token CSRF

source: ``lifespan``: lifespan of CSRF token in seconds, to limit form validity
it: ''lifespan'': durata della vita del token CSRF in secondi, per limitare la validità del modulo

source: ``signing_info``: information that should not change between when the CSRF token is signed and verified
it: ''signing_info'': informazioni che non devono cambiare tra il momento in cui il token CSRF viene firmato e verificato

source: A minimal form example without a database
it: Un esempio di modulo minimo senza un database

source: Let's start with a minimal working form example. Create a new minimal app called ``form_minimal`` :
it: Cominciamo con un esempio di forma di lavoro minimale. Crea una nuova app minimale chiamata ''form_minimal'' :

source: Also, you need to create a file inside the app called ``templates/form_minimal.html`` that just contains the line:
it: Inoltre, è necessario creare un file all'interno dell'app chiamato ''templates/form_minimal.html'' che contenga solo la riga:

source: Then reload py4web and visit http://127.0.0.1:8000/form_minimal - you'll get the Form page:
it: Quindi ricarica py4web e visita http://127.0.0.1:8000/form_minimal - otterrai la pagina del modulo:

source: Note that:
it: Si noti che:

source: ``Form`` is a class contained in the ``py4web.utils.form`` module
it: ''Form'' è una classe contenuta nel modulo ''py4web.utils.form''

source: it's possible to use **form validators** like ``IS_NOT_EMPTY``, see :ref:`Form validation` later. They are imported from the ``pydal.validators`` module
it: è possibile usare **validatori di moduli** come ''IS_NOT_EMPTY'', vedi :ref:'Convalida del modulo' più avanti. Vengono importati dal modulo ''pydal.validators''

source: it's normally important to use both the **GET** and the **POST** methods in the action where the form is contained
it: in genere è importante utilizzare entrambi i metodi **GET** e **POST** nell'azione in cui è contenuto il modulo

source: This example is intentionally not using a database, a template, nor the session management. The next example will.
it: In questo esempio non viene utilizzato intenzionalmente un database, un modello o la gestione delle sessioni. Il prossimo esempio lo farà.

source: Basic form example
it: Esempio di modulo di base

source: In this next basic example we generate a CRUD create form from a database. Create a new minimal app called ``form_basic`` :
it: In questo prossimo esempio di base viene generato un modulo di creazione CRUD da un database. Crea una nuova app minimale chiamata ''form_basic'' :

source: Note the import of two simple validators on top, in order to be used later with the ``requires`` parameter. We'll fully explain them on the :ref:`Form validation` paragraph.
it: Si noti l'importazione di due semplici validatori in cima, per essere utilizzati in seguito con il parametro ''requires''. Li spiegheremo dettagliatamente nel paragrafo :ref:'Convalida del modulo'.

source: You will also need a template file ``templates/form_basic.html`` that contains, for example, the following code:
it: Avrai anche bisogno di un file modello ''templates/form_basic.html'' che contiene, ad esempio, il seguente codice:

source: Reload py4web and visit http://127.0.0.1:8000/create_form : the result is an input form on the top of the page, and the list of all the previously added entries on the bottom:
it: Ricarica py4web e visita http://127.0.0.1:8000/create_form : il risultato è un modulo di input nella parte superiore della pagina e l'elenco di tutte le voci aggiunte in precedenza nella parte inferiore:

source: This is a simple example and you cannot change nor delete existing records. But if you'd like to experiment, the database content can be fully seen and changed with the Dashboard app.
it: Questo è un semplice esempio e non è possibile modificare o eliminare i record esistenti. Ma se vuoi sperimentare, il contenuto del database può essere completamente visto e modificato con l'app Dashboard.

source: You can turn a create form into a CRUD update form by passing a record or a record id it second argument:
it: È possibile trasformare un modulo di creazione in un modulo di aggiornamento CRUD passando un record o un ID record come secondo argomento:

source: File upload field
it: Campo di caricamento file

source: We can make a minor modificaiton to our reference model and an upload type file:
it: Possiamo apportare una piccola modifica al nostro modello di riferimento e un file di tipo di caricamento:

source: The file upload field is quite particular. The standard way to use it (as in the _scaffold app) is to have the UPLOAD_FOLDER defined in the common.py file. But if you don't specify it, then the default value of ``your_app/upload`` folder will be used (and the folder will also be created if needed). ``download_url`` is a callback that given the image name, generated the URL to download. The ``download`` url is predefined in ``common.py``.
it: Il campo di caricamento dei file è piuttosto particolare. Il modo standard per usarlo (come nell'app _scaffold) consiste nell'avere il UPLOAD_FOLDER definito nel file common.py. Ma se non lo specifichi, verrà utilizzato il valore predefinito della cartella ''your_app/upload'' (e la cartella verrà anche creata se necessario). ''download_url'' è un callback che, dato il nome dell'immagine, ha generato l'URL da scaricare. L'URL ''download'' è predefinito in ''common.py''.

source: We can modify ``form_basic.html`` to display the uploaded images:
it: Possiamo modificare ''form_basic.html'' per visualizzare le immagini caricate:

source: The uploaded files (the thing images) are saved on the UPLOAD_FOLDER folder with their name hashed. Other details on the upload fields can be found on :ref:`Field constructor` paragraph, including a way to save the files inside the database itself.
it: I file caricati (le immagini degli oggetti) vengono salvati nella cartella UPLOAD_FOLDER con il relativo nome sottoposto a hash. Altri dettagli sui campi di caricamento possono essere trovati nel paragrafo :ref:'Field constructor', incluso un modo per salvare i file all'interno del database stesso.

source: Standard widgets
it: Widget standard

source: Py4web provides many widgets in the py4web.utility.form library. They are simple plugins that easily allow you to specify the type of the input elements in a form, along with some of their properties.
it: Py4web fornisce molti widget nella libreria py4web.utility.form. Sono semplici plug-in che consentono di specificare facilmente il tipo di elementi di input in un modulo, insieme ad alcune delle loro proprietà.

source: Here is the full list:
it: Ecco l'elenco completo:

source: CheckboxWidget
it: Widget casella di controllo

source: ListWidget
it: ListWidget (Widget elenco)

source: SelectWidget
it: SelezionareWidget

source: This is an improved 'Basic Form Example' with a radio button widget:
it: Questo è un "Esempio di modulo di base" migliorato con un widget pulsante di opzione:

source: Notice the differences from the 'Basic Form example' we've seen at the beginning of the chapter:
it: Notate le differenze rispetto all'"esempio di modulo di base" che abbiamo visto all'inizio del capitolo:

source: you need to import the widget from the py4web.utils.form library
it: È necessario importare il widget dalla libreria py4web.utils.form

source: before the form definition, you define the ``color`` field form style with the line:
it: Prima della definizione del modulo, si definisce lo stile del modulo del campo ''Colore'' con la riga:

source: The result is the same as before, but now we have a radio button widget instead of the dropdown menu!
it: Il risultato è lo stesso di prima, ma ora abbiamo un widget per i pulsanti di opzione invece del menu a discesa!

source: Using widgets in forms is quite easy, and they'll let you have more control on its pieces.
it: L'uso dei widget nei moduli è abbastanza semplice e ti permetteranno di avere un maggiore controllo sui suoi pezzi.

source: Custom widgets
it: Widget personalizzati

source: You can also customize the widgets properties by subclassing the FormStyleDefault class. Let's have a quick look, improving again our Superhero example:
it: È inoltre possibile personalizzare le proprietà dei widget creando una sottoclasse della classe FormStyleDefault. Diamo una rapida occhiata, migliorando ancora una volta il nostro esempio di Supereroe:

source: The result is similar to the previous ones, but now we have a custom input field, with foreground color red and background color black,
it: Il risultato è simile ai precedenti, ma ora abbiamo un campo di input personalizzato, con il colore di primo piano rosso e il colore di sfondo nero,

source: Even the radio button widget has changed, from red to blue.
it: Anche il widget del pulsante di opzione è cambiato, da rosso a blu.

source: Advanced form design
it: Progettazione avanzata di moduli

source: Form structure manipulation
it: Manipolazione della struttura del modulo

source: In py4web a form is rendered by YATL helpers. This means the tree structure of a form can be manipulated before the form is serialized in HTML. Here is an example of how to manipulate the generate HTML structure:
it: In py4web un form viene visualizzato dagli helper YATL. Ciò significa che la struttura ad albero di un modulo può essere modificata prima che il modulo venga serializzato in HTML. Di seguito è riportato un esempio di come manipolare la struttura HTML generata:

source: Notice that a form does not make an HTML tree until form structure is accessed. Once accessed you can use ``.find(...)`` to find matching elements. The argument of ``find`` is a string following the filter syntax of jQuery. In the above case there is a single match ``[0]`` and we modify the ``_class`` attribute of that element. Attribute names of HTML elements must be preceded by an underscore.
it: Si noti che un modulo non crea una struttura ad albero HTML fino a quando non si accede alla struttura del modulo. Una volta effettuato l'accesso, è possibile utilizzare ''.find(...) '' per trovare gli elementi corrispondenti. L'argomento di ''find'' è una stringa che segue la sintassi del filtro di jQuery. Nel caso precedente c'è una singola corrispondenza ''[0]'' e modifichiamo l'attributo ''_class'' di quell'elemento. I nomi degli attributi degli elementi HTML devono essere preceduti da un carattere di sottolineatura.

source: Custom forms
it: Moduli personalizzati

source: Custom forms allow you to granulary control how the form is processed. In the template file, you can execute specific instructions before the form is displayed or after its data submission by inserting code among the following statements:
it: I moduli personalizzati consentono di controllare in modo granulare la modalità di elaborazione del modulo. Nel file modello è possibile eseguire istruzioni specifiche prima della visualizzazione del modulo o dopo l'invio dei dati inserendo il codice tra le seguenti istruzioni:

source: For example you could use it to avoid displaying the ``id`` field while editing a record in your form:
it: Ad esempio, è possibile utilizzarlo per evitare di visualizzare il campo ''id'' durante la modifica di un record nel modulo:

source: Note: 'custom' is just a convention, it could be any name that does not clash with already defined objects.
it: Nota: 'custom' è solo una convenzione, potrebbe essere qualsiasi nome che non si scontra con oggetti già definiti.

source: When working with custom forms, if you have a writable field that isn't included on your form, it will be set to null when you save a record. Any time a field is not included on a custom form, it should be set field.writable=False to ensure that field is not updated.
it: Quando si utilizzano moduli personalizzati, se si dispone di un campo scrivibile che non è incluso nel modulo, verrà impostato su null quando si salva un record. Ogni volta che un campo non è incluso in un modulo personalizzato, deve essere impostato field.writable=False per garantire che il campo non venga aggiornato.

source: Also, custom forms only create the element for a given field, but no surrounding elements that might be needed based on your css framework. For example, if you're using Bulma as your css framework, you'll have to add an outer DIV in order to get select controls to appear correctly.
it: Inoltre, i moduli personalizzati creano solo l'elemento per un determinato campo, ma non gli elementi circostanti che potrebbero essere necessari in base al framework css. Ad esempio, se stai usando Bulma come framework css, dovrai aggiungere un DIV esterno per far apparire correttamente i controlli select.

source: You can also be more creative and use your HTML in the template instead of using widgets:
it: Puoi anche essere più creativo e utilizzare il tuo HTML nel modello invece di utilizzare i widget:

source: The sidecar parameter
it: Il parametro sidecar

source: The sidecar is the stuff injected in the form along with the submit button.
it: Il sidecar è il materiale iniettato nel modulo insieme al pulsante di invio.

source: For example, you can inject a simple ``click me`` button in your form with the following code:
it: Ad esempio, puoi inserire un semplice pulsante ''cliccami'' nel tuo modulo con il seguente codice:

source: In particular, this is frequently used for adding a ``Cancel`` button, which is not provided by py4web:
it: In particolare, questo è spesso usato per aggiungere un pulsante ''Annulla'', che non è fornito da py4web:

source: Form validation
it: Convalida del modulo

source: Validators are classes used to validate input fields (including forms generated from database tables). They are normally assigned using the ``requires`` attribute of a table ``Field`` object, as already shown on the :ref:`Field constructor` paragraph of the DAL chapter. Also, you can use advanced validators in order to create widgets such as drop-down menus, radio buttons and even lookups from other tables. Last but not least, you can even explicitly define a validation function.
it: I validatori sono classi utilizzate per convalidare i campi di input (inclusi i moduli generati dalle tabelle del database). Normalmente vengono assegnati usando l'attributo ''requires'' di un oggetto ''Field'' della tabella, come già mostrato nel paragrafo :ref:'Field constructor' del capitolo DAL. Inoltre, è possibile utilizzare validatori avanzati per creare widget come menu a discesa, pulsanti di opzione e persino ricerche da altre tabelle. Infine, ma non meno importante, è anche possibile definire in modo esplicito una funzione di convalida.

source: Here is a simple example of how to require a validator for a table field:
it: Di seguito è riportato un semplice esempio di come richiedere un validatore per un campo di tabella:

source: The validator is frequently written explicitly outside the table definition in this equivalent syntax:
it: Il validatore è spesso scritto in modo esplicito all'esterno della definizione della tabella in questa sintassi equivalente:

source: A field can have a single validator or a list of multiple validators:
it: Un campo può avere un singolo validatore o un elenco di più validatori:

source: Mind that the only validators that can be used with ``list:`` type fields are:
it: Tieni presente che gli unici validatori che possono essere utilizzati con i campi di tipo ''list:'' sono:

source: ``IS_IN_DB(..., multiple=True)``
it: ''IS_IN_DB(..., multiplo=Vero)''

source: ``IS_IN_SET(..., multiple=True)``
it: ''IS_IN_SET(..., multiplo=Vero)''

source: The latter can be used to apply any validator to the individual items in the list. ``multiple=(1, 1000)`` requires a selection of between 1 and 1000 items. This enforces selection of at least one choice.
it: Quest'ultimo può essere utilizzato per applicare qualsiasi validatore ai singoli elementi dell'elenco. ''multiple=(1, 1000)'' richiede una selezione compresa tra 1 e 1000 elementi. In questo modo si impone la selezione di almeno una scelta.

source: Built-in validators have constructors that take an ``error_message`` argument:
it: I validatori incorporati hanno costruttori che accettano un argomento ''error_message'':

source: Notice the error message is usually fist option of the constructors and you can normally avoid to name it. Hence the following syntax is equivalent:
it: Si noti che il messaggio di errore è di solito la prima opzione dei costruttori e normalmente è possibile evitare di assegnargli un nome. Quindi la seguente sintassi è equivalente:

source: If you want to use internationalization like explained in a previous chapter you need to define your own messages and wrap the validator message in the T operator:
it: Se si desidera utilizzare l'internazionalizzazione come spiegato in un capitolo precedente, è necessario definire i propri messaggi e racchiudere il messaggio del validatore nell'operatore T:

source: IS_NOT_EMPTY(error_message=T('cannot be empty!'))
it: IS_NOT_EMPTY(error_message=T('non può essere vuoto!'))

source: Here is an example of a validator on a database table:
it: Di seguito è riportato un esempio di convalida su una tabella di database:

source: where we have used the translation operator ``T`` to allow for internationalization. Notice that error messages are not translated by default unless you define them explicitly with ``T``.
it: dove abbiamo usato l'operatore di traduzione ''T'' per consentire l'internazionalizzazione. Si noti che i messaggi di errore non vengono tradotti per impostazione predefinita, a meno che non vengano definiti esplicitamente con ''T''.

source: One can also call validators explicitly for a field:
it: Si possono anche chiamare i validatori in modo esplicito per un campo:

source: which returns a tuple ``(value, error)`` and ``error`` is ``None`` if the value validates.
it: che restituisce una tupla ''(valore, errore)'' e ''errore'' è ''Nessuno'' se il valore viene convalidato.

source: You can easily test most of the following validators directly using python only. For example:
it: È possibile testare facilmente la maggior parte dei seguenti validatori direttamente utilizzando solo python. Per esempio:

source: The DAL validators are well documented inside the python source code. You can easily check it by yourself for all the details!
it: I validatori DAL sono ben documentati all'interno del codice sorgente python. Puoi facilmente controllarlo da solo per tutti i dettagli!

source: Text format validators
it: Validatori di formati di testo

source: This validator checks that a field value contains only characters in the ranges a-z, A-Z, 0-9, and underscores.
it: Questo strumento di convalida verifica che il valore di un campo contenga solo caratteri compresi negli intervalli a-z, A-Z, 0-9 e caratteri di sottolineatura.

source: This validator never returns an error. It just converts the value to lower case.
it: Questo validatore non restituisce mai un errore. Converte semplicemente il valore in minuscolo.

source: This validator never returns an error. It converts the value to upper case.
it: Questo validatore non restituisce mai un errore. Converte il valore in maiuscolo.

source: It checks that the field value looks like an email address. It does not try to send email to confirm.
it: Controlla che il valore del campo assomigli a un indirizzo e-mail. Non tenta di inviare e-mail di conferma.

source: This validator matches the value against a regular expression and returns an error if it does not match. Here is an example of usage to validate a US zip code:
it: Questo validatore confronta il valore con un'espressione regolare e restituisce un errore se non corrisponde. Di seguito è riportato un esempio di utilizzo per convalidare un codice postale statunitense:

source: Here is an example of usage to validate an IPv4 address (note: the IS_IPV4 validator is more appropriate for this purpose):
it: Di seguito è riportato un esempio di utilizzo per convalidare un indirizzo IPv4 (nota: il validatore IS_IPV4 è più appropriato per questo scopo):

source: Here is an example of usage to validate a US phone number:
it: Di seguito è riportato un esempio di utilizzo per convalidare un numero di telefono statunitense:
