Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: Currently keyed tables are only supported for DB2, MSSQL, Ingres and Informix, but others engines will be added.
it: Le tabelle attualmente con chiave sono supportate solo per DB2, MSSQL, Ingres e Informix, ma verranno aggiunti altri motori.

source: At the time of writing, we cannot guarantee that the ``primarykey`` attribute works with every existing legacy table and every supported database backend. For simplicity, we recommend, if possible, creating a database view that has an auto-increment id field.
it: Al momento in cui scriviamo, non possiamo garantire che l'attributo ''primarykey'' funzioni con ogni tabella legacy esistente e con ogni backend di database supportato. Per semplicità, si consiglia, se possibile, di creare una vista di database con un campo id a incremento automatico.

source: Field constructor
it: Costruttore di campo

source: These are the default values of a Field constructor:
it: Di seguito sono riportati i valori predefiniti di un costruttore Field:

source: where DEFAULT is a special value used to allow the value None for a parameter.
it: dove DEFAULT è un valore speciale utilizzato per consentire il valore None per un parametro.

source: Not all of them are relevant for every field. ``length`` is relevant only for fields of type “string”. ``uploadfield``, ``authorize``, and ``autodelete`` are relevant only for fields of type “upload”. ``ondelete`` is relevant only for fields of type “reference” and “upload”.
it: Non tutti sono rilevanti per ogni campo. ''length'' è rilevante solo per i campi di tipo "stringa". ''UploadField'', ''Authorize'' e ''Autodelete'' sono rilevanti solo per i campi di tipo 'upload''. ''ondelete'' è rilevante solo per i campi di tipo "reference" e "upload".

source: ``length`` sets the maximum length of a “string”, “password” or “upload” field. If ``length`` is not specified a default value is used but the default value is not guaranteed to be backward compatible. *To avoid unwanted migrations on upgrades, we recommend that you always specify the length for string, password and upload fields.*
it: ''length'' imposta la lunghezza massima di un campo ''stringa'', 'password'' o 'upload''. Se ''length'' non è specificato, viene utilizzato un valore predefinito, ma non è garantito che il valore predefinito sia compatibile con le versioni precedenti. *Per evitare migrazioni indesiderate durante gli aggiornamenti, si consiglia di specificare sempre la lunghezza dei campi stringa, password e caricamento.*

source: ``default`` sets the default value for the field. The default value is used when performing an insert if a value is not explicitly specified. It is also used to pre-populate forms built from the table using ``Form``. Note, rather than being a fixed value, the default can instead be a function (including a lambda function) that returns a value of the appropriate type for the field. In that case, the function is called once for each record inserted, even when multiple records are inserted in a single transaction.
it: ''default'' imposta il valore predefinito per il campo. Il valore predefinito viene utilizzato quando si esegue un inserimento se non viene specificato in modo esplicito un valore. Viene anche usato per precompilare i moduli creati dalla tabella usando ''Form''. Si noti che, anziché essere un valore fisso, l'impostazione predefinita può essere una funzione (inclusa una funzione lambda) che restituisce un valore del tipo appropriato per il campo. In tal caso, la funzione viene chiamata una volta per ogni record inserito, anche quando vengono inseriti più record in una singola transazione.

source: ``required`` tells the DAL that no insert should be allowed on this table if a value for this field is not explicitly specified.
it: ''required'' dice al DAL che nessun inserimento deve essere consentito in questa tabella se un valore per questo campo non è specificato in modo esplicito.

source: ``requires`` is a **validator** or a list of validators. This is not used by the DAL, but instead it is used by ``Form`` (this will be explained better on the :ref:`Forms` chapter). The default validators for the given types are shown in the next section :ref:`Field types and validators`.
it: ''requires'' è un **validatore** o una lista di validatori. Questo non è usato dal DAL, ma invece è usato da ''Form'' (questo sarà spiegato meglio nel capitolo :ref:'Forms'). I validatori predefiniti per i tipi specificati sono mostrati nella sezione successiva :ref:'Tipi di campo e validatori'.

source: while ``requires=...`` is enforced at the level of forms, ``required=True`` is enforced at the level of the DAL (insert). In addition, ``notnull``, ``unique`` and ``ondelete`` are enforced at the level of the database. While they sometimes may seem redundant, it is important to maintain the distinction when programming with the DAL.
it: mentre ''requires=...'' viene applicato a livello di forms, ''required=True'' viene applicato a livello di DAL (insert). Inoltre, ''notnull'', ''unique'' e ''ondelete'' sono applicati a livello di database. Anche se a volte possono sembrare ridondanti, è importante mantenere la distinzione quando si programma con il DAL.

source: ``rname`` provides the field with a “real name”, a name for the field known to the database adapter; when the field is used, it is the rname value which is sent to the database. The py4web name for the field is then effectively an alias.
it: ''rname'' fornisce al campo un ''real name'', un nome per il campo noto all'adapter del database; Quando il campo viene utilizzato, è il valore rname che viene inviato al database. Il nome py4web per il campo è quindi effettivamente un alias.

source: ``ondelete`` translates into the “ON DELETE” SQL statement. By default it is set to “CASCADE”. This tells the database that when it deletes a record, it should also delete all records that refer to it. To disable this feature, set ``ondelete`` to “NO ACTION” or “SET NULL”.
it: ''ondelete'' si traduce nell'istruzione SQL ON DELETE. Per impostazione predefinita, è impostato su "CASCADE". In questo modo si comunica al database che quando elimina un record, deve eliminare anche tutti i record che vi fanno riferimento. Per disabilitare questa funzione, impostare ''ondelete'' su "NO ACTION" o "SET NULL".

source: ``notnull=True`` translates into the “NOT NULL” SQL statement. It prevents the database from inserting null values for the field.
it: ''notnull=True'' si traduce nell'istruzione SQL "NOT NULL". Impedisce al database di inserire valori Null per il campo.

source: ``unique=True`` translates into the “UNIQUE” SQL statement and it makes sure that values of this field are unique within the table. It is enforced at the database level.
it: ''unique=True'' si traduce nell'istruzione SQL "UNIQUE" e fa in modo che i valori di questo campo siano univoci all'interno della tabella. Viene applicato a livello di database.

source: ``uploadfield`` applies only to fields of type “upload”. A field of type “upload” stores the name of a file saved somewhere else, by default on the filesystem under the application “uploads/” folder. If ``uploadfield`` is set to True, then the file is stored in a blob field within the same table and the value of ``uploadfield`` is the name of the blob field. This will be discussed in more detail later in `More on uploads`_.
it: ''uploadfield'' si applica solo ai campi di tipo "upload". Un campo di tipo "upload" memorizza il nome di un file salvato da qualche altra parte, per impostazione predefinita sul filesystem nella cartella "uploads/" dell'applicazione. Se ''uploadfield'' è impostato su True, il file viene archiviato in un campo BLOB all'interno della stessa tabella e il valore di ''uploadfield'' è il nome del campo BLOB. Questo sarà discusso più dettagliatamente più avanti in 'Ulteriori informazioni sui caricamenti'_.

source: ``uploadfolder`` must be set to a location where to store uploaded files. The scaffolding app defines a folder ``settings.UPLOAD_FOLDER`` which points to ``apps/{app_name}/uploads`` so you can set, for example, ``Field(... uploadfolder=settings.UPLOAD_FOLDER)``.
it: ''uploadfolder'' deve essere impostato su una posizione in cui memorizzare i file caricati. L'app di scaffolding definisce una cartella ''impostazioni. UPLOAD_FOLDER'' che punta a ''apps/{app_name}/uploads'' in modo da poter impostare, ad esempio, ''Field(... uploadfolder=impostazioni. UPLOAD_FOLDER)''.

source: ``uploadseparate`` if set to True will upload files under different subfolders of the *uploadfolder* folder. This is optimized to avoid too many files under the same folder/subfolder. ATTENTION: You cannot change the value of ``uploadseparate`` from True to False without breaking links to existing uploads. pydal either uses the separate subfolders or it does not. Changing the behavior after files have been uploaded will prevent pydal from being able to retrieve those files. If this happens it is possible to move files and fix the problem but this is not described here.
it: ''uploadseparate'' se impostato a True caricherà i file in diverse sottocartelle della cartella *uploadfolder*. Questo è ottimizzato per evitare troppi file nella stessa cartella/sottocartella. ATTENZIONE: Non è possibile modificare il valore di ''uploadseparate'' da True a False senza interrompere i collegamenti ai caricamenti esistenti. pydal utilizza le sottocartelle separate o non lo fa. La modifica del comportamento dopo che i file sono stati caricati impedirà a pydal di essere in grado di recuperare tali file. In questo caso, è possibile spostare i file e risolvere il problema, ma questo non è descritto qui.

source: ``uploadfs`` allows you specify a different file system where to upload files, including an Amazon S3 storage or a remote SFTP storage.
it: ''uploadfs'' consente di specificare un file system diverso in cui caricare i file, incluso uno storage Amazon S3 o uno storage SFTP remoto.

source: You need to have PyFileSystem installed for this to work. ``uploadfs`` must point to PyFileSystem.
it: È necessario che PyFileSystem sia installato affinché funzioni. ''uploadfs'' deve puntare a PyFileSystem.

source: ``autodelete`` determines if the corresponding uploaded file should be deleted when the record referencing the file is deleted. For “upload” fields only. However, records deleted by the database itself due to a CASCADE operation will not trigger py4web’s autodelete.
it: ''Autodelete'' determina se il file caricato corrispondente deve essere eliminato quando il record che fa riferimento al file viene eliminato. Solo per i campi "carica". Tuttavia, i record eliminati dal database stesso a causa di un'operazione CASCADE non attiveranno l'eliminazione automatica di py4web.

source: ``label`` is a string (or a helper or something that can be serialized to a string) that contains the label to be used for this field in auto-generated forms. serialized to a string) that contains a comment associated with this field, and will be displayed to the right of the input field in the autogenerated forms.
it: ''label'' è una stringa (o un helper o qualcosa che può essere serializzato in una stringa) che contiene l'etichetta da usare per questo campo nei moduli generati automaticamente. serializzato in una stringa) che contiene un commento associato a questo campo e verrà visualizzato a destra del campo di input nei moduli generati automaticamente.

source: ``writable`` declares whether a field is writable in forms.
it: ''scrivibile'' dichiara se un campo è scrivibile nelle forme.

source: ``readable`` declares whether a field is readable in forms. If a field is neither readable nor writable, it will not be displayed in create and update forms.
it: ''leggibile'' dichiara se un campo è leggibile nei moduli. Se un campo non è né leggibile né scrivibile, non verrà visualizzato nei moduli di creazione e aggiornamento.

source: ``update`` contains the default value for this field when the record is updated.
it: ''update'' contiene il valore predefinito per questo campo quando il record viene aggiornato.

source: ``compute`` is an optional function. If a record is inserted or updated, the compute function will be executed and the field will be populated with the function result. The record is passed to the compute function as a ``dict``, and the dict will not include the current value of that, or any other compute field.
it: ''compute'' è una funzione opzionale. Se viene inserito o aggiornato un record, la funzione di calcolo verrà eseguita e il campo verrà popolato con il risultato della funzione. Il record viene passato alla funzione di calcolo come ''dict'' e il dict non includerà il valore corrente di quello, o di qualsiasi altro campo di calcolo.

source: ``authorize`` can be used to require access control on the corresponding field, for “upload” fields only. It will be discussed more in detail in the context of Authentication and Authorization.
it: ''Autorizza'' può essere usato per richiedere il controllo dell'accesso sul campo corrispondente, solo per i campi "Carica". Verrà discusso più dettagliatamente nel contesto dell'autenticazione e dell'autorizzazione.

source: ``represent`` can be None or can point to a function that takes a field value and returns an alternate representation for the field value. Examples:
it: ''represent'' può essere None o può puntare a una funzione che accetta un valore di campo e restituisce una rappresentazione alternativa per il valore del campo. Esempi:

source: Note not all the attributes are thread safe and most of them should only be set globally for an app. The following are guaranteed to be thread safe and be set/reset in any action: ``default``, ``update``, ``readable``, ``writable``, ``requires``.
it: Si noti che non tutti gli attributi sono thread-safe e la maggior parte di essi deve essere impostata solo a livello globale per un'app. I seguenti elementi sono garantiti per essere thread-safe e possono essere impostati/ripristinati in qualsiasi azione: ''default'', ''update'', ''readable'', ''writable'', ''requires''.

source: Field types and validators
it: Tipi di campo e validatori

source: Type
it: Tipo

source: Default validators
it: Validatori predefiniti

source: ``string``
it: ''stringa''

source: ``IS_LENGTH(length)`` default length is 512
it: ''IS_LENGTH(length)'' la lunghezza predefinita è 512

source: ``text``
it: ''testo''

source: ``IS_LENGTH(length)`` default length is 32768
it: La lunghezza predefinita di ''IS_LENGTH(length)'' è 32768

source: ``None`` default length is 2**31 (2 GiB)
it: La lunghezza predefinita di ''Nessuno'' è 2**31 (2 GiB)

source: ``boolean``
it: ''booleano''

source: ``None``
it: ''Nessuno''

source: ``integer``
it: ''intero''

source: ``double``
it: ''Doppio''

source: ``decimal(n,m)``
it: ''Decimale(N,M)''

source: ``date``
it: ''data''

source: ``time``
it: ''Tempo''

source: ``password``
it: ''Parola d'ordine''

source: ``upload``
it: ''Carica''

source: ``None`` default length is 512
it: La lunghezza predefinita di ''None'' è 512

source: ``reference <table>``
it: ''Riferimento <table>``</table>

source: ``IS_IN_DB(db, table.field, format)``
it: ''IS_IN_DB(db, tabella.campo, formato)''

source: ``list:string``
it: ''lista:stringa''

source: ``list:integer``
it: ''lista:intero''

source: ``list:reference <table>``
it: ''elenco:riferimento <table>``</table>

source: ``IS_EMPTY_OR(IS_JSON())`` default length is 512
it: La lunghezza predefinita di ''IS_EMPTY_OR(IS_JSON())'' è 512

source: Decimal requires and returns values as ``Decimal`` objects, as defined in the Python ``decimal`` module. SQLite does not handle the ``decimal`` type so internally we treat it as a ``double``. The (n,m) are the number of digits in total and the number of digits after the decimal point respectively.
it: Decimal richiede e restituisce valori come oggetti ''Decimal'', come definito nel modulo ''decimal'' di Python. SQLite non gestisce il tipo ''decimale'', quindi internamente lo trattiamo come un ''double''. (n,m) sono rispettivamente il numero di cifre in totale e il numero di cifre dopo la virgola decimale.

source: The ``big-id`` and, ``big-reference`` are only supported by some of the database engines and are experimental. They are not normally used as field types unless for legacy tables, however, the DAL constructor has a ``bigint_id`` argument that when set to ``True`` makes the ``id`` fields and ``reference`` fields ``big-id`` and ``big-reference`` respectively.
it: ''big-id'' e ''big-reference'' sono supportati solo da alcuni dei motori di database e sono sperimentali. Non sono normalmente usati come tipi di campo a meno che non siano per le tabelle legacy, tuttavia, il costruttore DAL ha un argomento ''bigint_id'' che quando impostato a ''True'' rende i campi ''id'' e ''reference'' campi ''big-id'' e ''big-reference'' rispettivamente.

source: The ``list:<type>`` fields are special because they are designed to take advantage of certain denormalization features on NoSQL (in the case of Google App Engine NoSQL, the field types ``ListProperty`` and ``StringListProperty``) and back-port them all the other supported relational databases. On relational databases lists are stored as a ``text`` field. The items are separated by a ``|`` and each ``|`` in string item is escaped as a ``||``. They are discussed in :ref:`list_type and contains`.
it: I campi ''list:<type>'' sono speciali perché sono progettati per sfruttare alcune funzionalità di denormalizzazione su NoSQL (nel caso di Google App Engine NoSQL, i tipi di campo ''ListProperty'' e ''StringListProperty'') e back-port di tutti gli altri database relazionali supportati. Nei database relazionali le liste sono memorizzate come campo ''testo''. Gli elementi sono separati da un ''|'' e ogni ''|'' nell'elemento stringa viene preceduto da un carattere di escape ''||``. Sono discussi in :ref:'list_type e contiene'.</type>

source: The ``json`` field type is pretty much explanatory. It can store any JSON serializable object. It is designed to work specifically for MongoDB and backported to the other database adapters for portability.
it: Il tipo di campo ''json'' è praticamente esplicativo. Può archiviare qualsiasi oggetto serializzabile JSON. È progettato per funzionare in modo specifico per MongoDB e viene eseguito il backport su altri adattatori di database per la portabilità.

source: ``blob`` fields are also special. By default, binary data is encoded in base64 before being stored into the actual database field, and it is decoded when extracted. This has the negative effect of using 33% more storage space than necessary in blob fields, but has the advantage of making the communication independent of the back-end specific escaping conventions.
it: Anche i campi ''blob'' sono speciali. Per impostazione predefinita, i dati binari vengono codificati in base64 prima di essere archiviati nel campo del database effettivo e vengono decodificati quando vengono estratti. Ciò ha l'effetto negativo di usare il 33% di spazio di archiviazione in più del necessario nei campi BLOB, ma ha il vantaggio di rendere la comunicazione indipendente dalle convenzioni di escape specifiche del back-end.

source: Run-time field and table modification
it: Modifica dei campi e delle tabelle in fase di esecuzione

source: Most attributes of fields and tables can be modified after they are defined:
it: La maggior parte degli attributi dei campi e delle tabelle può essere modificata dopo essere stati definiti:

source: notice that attributes of tables are usually prefixed by an underscore to avoid conflict with possible field names.
it: Si noti che gli attributi delle tabelle sono in genere preceduti da un carattere di sottolineatura per evitare conflitti con i possibili nomi dei campi.

source: You can list the tables that have been defined for a given database connection:
it: È possibile elencare le tabelle definite per una determinata connessione al database:

source: You can query for the type of a table:
it: È possibile eseguire una query per il tipo di tabella:

source: You can access a table using different syntaxes:
it: È possibile accedere a una tabella utilizzando diverse sintassi:

source: You can also list the fields that have been defined for a given table:
it: È inoltre possibile elencare i campi che sono stati definiti per una determinata tabella:

source: Similarly you can access fields from their name in multiple equivalent ways:
it: Allo stesso modo, è possibile accedere ai campi dal loro nome in diversi modi equivalenti:

source: Given a field, you can access the attributes set in its definition:
it: Dato un campo, è possibile accedere agli attributi impostati nella sua definizione:

source: including its parent table, tablename, and parent connection:
it: incluse la tabella padre, il nome della tabella e la connessione padre:

source: A field also has methods. Some of them are used to build queries and we will see them later. A special method of the field object is ``validate`` and it calls the validators for the field.
it: Un campo ha anche dei metodi. Alcuni di essi vengono utilizzati per creare query e li vedremo più avanti. Un metodo speciale dell'oggetto campo è ''validate'' e chiama i validatori per il campo.

source: which returns a tuple ``(value, error)``. ``error`` is ``None`` if the input passes validation.
it: che restituisce una tupla ''(valore, errore)''. ''error'' è ''None'' se l'input supera la convalida.

source: More on uploads
it: Ulteriori informazioni sui caricamenti

source: Consider the following model:
it: Si consideri il seguente modello:

source: In the case of an “upload” field, the default value can optionally be set to a path (an absolute path or a path relative to the current app folder), the default value is then assigned to each new record that does not specify an image.
it: Nel caso di un campo "carica", il valore predefinito può essere facoltativamente impostato su un percorso (un percorso assoluto o un percorso relativo alla cartella dell'app corrente), il valore predefinito viene quindi assegnato a ogni nuovo record che non specifica un'immagine.

source: Notice that this way multiple records may end to reference the same default image file and this could be a problem on a Field having ``autodelete`` enabled. When you do not want to allow duplicates for the image field (i.e. multiple records referencing the same file) but still want to set a default value for the “upload” then you need a way to copy the default file for each new record that does not specify an image. This can be obtained using a file-like object referencing the default file as the ``default`` argument to Field, or even with:
it: Si noti che in questo modo più record potrebbero finire per fare riferimento allo stesso file immagine predefinito e questo potrebbe essere un problema su un campo con ''autodelete'' abilitato. Quando non si desidera consentire duplicati per il campo immagine (ad esempio, più record che fanno riferimento allo stesso file) ma si desidera comunque impostare un valore predefinito per il "caricamento", è necessario un modo per copiare il file predefinito per ogni nuovo record che non specifica un'immagine. Questo può essere ottenuto usando un oggetto simile a un file che fa riferimento al file predefinito come argomento ''default'' di Field, o anche con:

source: Normally an insert is handled automatically via a ``Form`` but occasionally you already have the file on the filesystem and want to upload it programmatically. This can be done in this way:
it: Normalmente un inserimento viene gestito automaticamente tramite un ''Form'', ma occasionalmente si ha già il file sul filesystem e si vuole caricarlo programmaticamente. Questo può essere fatto in questo modo:
