Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: The Database Abstraction Layer (DAL)
it: Il livello di astrazione del database (DAL)

source: DAL introduction
it: Introduzione al DAL

source: py4web rely on a database abstraction layer (DAL), an API that maps Python objects into database objects such as queries, tables, and records. The DAL dynamically generates the SQL in real time using the specified dialect for the database back end, so that you do not have to write SQL code or learn different SQL dialects (the term SQL is used generically), and the application will be portable among different types of databases. The DAL choosen is a pure Python one called `pyDAL <https://github.com/web2py/pydal>`__. It was conceived in the web2py project but it's a standard python module: you can use it in any Python context.
it: py4web si basa su un database abstraction layer (DAL), un'API che mappa gli oggetti Python in oggetti di database come query, tabelle e record. Il DAL genera dinamicamente l'SQL in tempo reale utilizzando il dialetto specificato per il back-end del database, in modo che non sia necessario scrivere codice SQL o imparare diversi dialetti SQL (il termine SQL è usato genericamente) e l'applicazione sarà portabile tra diversi tipi di database. Il DAL scelto è un puro Python chiamato 'pyDAL <https://github.com/web2py/pydal>'__. E' stato concepito nel progetto web2py ma è un modulo python standard: si può usare in qualsiasi contesto Python.

source: A little taste of pyDAL features:
it: Un piccolo assaggio delle caratteristiche di pyDAL:

source: Transactions
it: Transazioni

source: Aggregates
it: Aggregati

source: Inner & Outer Joins
it: Giunzioni interne ed esterne

source: Nested Selects
it: Selezioni nidificate

source: py4web model
it: Modello PY4Web

source: Even if web2py and py4web use the same pyDAL, there are important differences (see :ref:`From web2py to py4web` for details). The main caveat is that in py4web only the action is executed for every HTTP request, while the code defined outside of actions is only executed at startup. That makes py4web much faster, in particular when there are many tables. The downside of this approach is that the developer should be careful to never override pyDAL variables inside action or in any way that depends on the content of the request object, else the code is not thread safe. The only variables that can be changed at will are the following field attributes: readable, writable, requires, update, and default. All the others are for practical purposes to be considered global and non thread safe.
it: Anche se web2py e py4web usano lo stesso pyDAL, ci sono importanti differenze (vedere :ref:'From web2py to py4web' per i dettagli). L'avvertenza principale è che in py4web solo l'azione viene eseguita per ogni richiesta HTTP, mentre il codice definito al di fuori delle azioni viene eseguito solo all'avvio. Questo rende py4web molto più veloce, in particolare quando ci sono molte tabelle. Lo svantaggio di questo approccio è che lo sviluppatore deve fare attenzione a non sovrascrivere mai le variabili pyDAL all'interno dell'azione o in qualsiasi modo che dipenda dal contenuto dell'oggetto richiesta, altrimenti il codice non è thread-safe. Le uniche variabili che possono essere modificate a piacimento sono i seguenti attributi di campo: readable, writable, requires, update e default. Tutti gli altri sono ai fini pratici da considerarsi globali e non thread-safe.

source: Supported databases
it: Database supportati

source: A partial list of supported databases is show in the table below. Please check on the py4web/pyDAL web site and mailing list for more recent adapters.
it: Un elenco parziale dei database supportati è riportato nella tabella seguente. Si prega di controllare sul sito web py4web/pyDAL e sulla mailing list per gli adattatori più recenti.

source: In any modern python distribution **SQLite** is actually built-in as a Python library. The SQLite driver (sqlite3) is also included: you don't need to install it. Hence this is the most popular database for testing and development.
it: In qualsiasi distribuzione python moderna **SQLite** è in realtà incorporato come libreria Python. È incluso anche il driver SQLite (sqlite3): non è necessario installarlo. Quindi questo è il database più popolare per i test e lo sviluppo.

source: The Windows and the Mac binary distribution work out of the box with SQLite only. To use any other database back end, run a full py4web distribution and install the appropriate driver for the required back end. Once the proper driver is installed, start py4web and it will automatically find the driver.
it: La distribuzione binaria per Windows e Mac funziona solo con SQLite. Per utilizzare qualsiasi altro back-end di database, eseguire una distribuzione py4web completa e installare il driver appropriato per il back-end richiesto. Una volta installato il driver corretto, avvia py4web e troverà automaticamente il driver.

source: Here is a list of the drivers py4web can use:
it: Ecco un elenco dei driver che py4web può utilizzare:

source: Drivers (source)
it: Driver (sorgente)

source: sqlite3 or pysqlite2 or zxJDBC (on Jython)
it: sqlite3 o pysqlite2 o zxJDBC (su Jython)

source: psycopg2 or zxJDBC (on Jython)
it: psycopg2 o zxJDBC (su Jython)

source: pymysql or MySQLdb
it: pymysql o MySQLdb

source: Oracle
it: Oracolo

source: pyodbc or pypyodbc
it: pyodbc o pypyodbc

source: kinterbasdb or fdb or pyodbc
it: KinterbasDB o FDB o Pyodbc

source: Support of MongoDB is experimental. Google NoSQL is treated as a particular case. The Gotchas_ section at the end of this chapter has some more information about specific databases.
it: Il supporto di MongoDB è sperimentale. Google NoSQL viene trattato come un caso particolare. La sezione Gotchas_ alla fine di questo capitolo contiene ulteriori informazioni su database specifici.

source: The DAL: a quick tour
it: Il DAL: un breve tour

source: py4web defines the following classes that make up the DAL:
it: py4web definisce le seguenti classi che costituiscono il DAL:

source: represents a database connection. For example:
it: rappresenta una connessione al database. Per esempio:

source: Table
it: Tabella

source: represents a database table. You do not directly instantiate Table; instead, ``DAL.define_table`` does.
it: Rappresenta una tabella di database. Non si crea direttamente un'istanza di Table. Invece, ''DAL.define_table'' lo fa.

source: The most important methods of a Table are:
it: I metodi più importanti di una tabella sono:

source: ``insert``, ``truncate``, ``drop``, and ``import_from_csv_file``.
it: ''Inserisci'', ''Tronca'', ''Elimina'' e ''import_from_csv_file''.

source: Field
it: Campo

source: represents a database field. It can be instantiated and passed as an argument to ``DAL.define_table``.
it: rappresenta un campo di database. Può essere istanziato e passato come argomento a ''DAL.define_table''.

source: Rows
it: Righe

source: is the object returned by a database select. It can be thought of as a list of ``Row`` rows:
it: è l'oggetto restituito da una selezione di database. Può essere pensato come un elenco di righe ''Row'':

source: Row
it: Riga

source: contains field values.
it: Contiene i valori dei campi.

source: is an object that represents a SQL “where” clause:
it: è un oggetto che rappresenta una clausola SQL "where":

source: Set
it: Imposta

source: is an object that represents a set of records. Its most important methods are ``count``, ``select``, ``update``, and ``delete``. For example:
it: è un oggetto che rappresenta un set di record. I suoi metodi più importanti sono ''count'', ''select'', ''update'' e ''delete''. Per esempio:

source: Expression
it: Espressione

source: is something like an ``orderby`` or ``groupby`` expression. The Field class is derived from the Expression. Here is an example.
it: è qualcosa di simile a un'espressione ''orderby'' o ''groupby''. La classe Field è derivata dall'oggetto Expression. Ecco un esempio.

source: Using the DAL “stand-alone”
it: Utilizzo del DAL "stand-alone"

source: pyDAL is an independent python package. As such, it can be used without the web2py/py4web environment; you just need to install it with ``pip``. Then import the pydal module when needed:
it: pyDAL è un pacchetto python indipendente. Come tale, può essere utilizzato senza l'ambiente web2py/py4web; Devi solo installarlo con ''pip''. Quindi importa il modulo pydal quando necessario:

source: Even if you can import modules directly from pydal, this is not advisable from within py4web applications. Remember that ``py4web.DAL`` is a fixture, ``pydal.DAL`` is not. In this context, the last command should better be:
it: Anche se è possibile importare moduli direttamente da pydal, questo non è consigliabile dall'interno delle applicazioni py4web. Ricordate che ''py4web. DAL'' è un appuntamento fisso, ''pydal. DAL'' non lo è. In questo contesto, l'ultimo comando dovrebbe essere migliore:

source: Experiment with the py4web shell
it: Sperimenta con la shell py4web

source: You can also experiment with the pyDAL API using the py4web shell, that is available using the :ref:`shell command option`.
it: Puoi anche sperimentare con l'API pyDAL usando la shell py4web, che è disponibile usando l'opzione :ref:'shell command'.

source: Mind that database changes may be persistent. So be careful and do NOT hesitate to create a new application for doing testing instead of tampering with an existing one.
it: Tenere presente che le modifiche al database possono essere persistenti. Quindi fai attenzione e NON esitare a creare una nuova applicazione per fare test invece di manometterne una esistente.

source: Note that most of the code snippets that contain the python prompt ``>>>`` are also directly executable via a py4web shell.
it: Si noti che la maggior parte dei frammenti di codice che contengono il prompt python ''>>>'' sono anche direttamente eseguibili tramite una shell py4web.

source: This is a simple example, using the provided ``examples`` app:
it: Questo è un semplice esempio, usando l'app ''examples'' fornita:

source: You can also start by creating a connection from zero. For the sake of simplicity, you can use SQLite. Nothing in this discussion changes when you switch the back-end engine.
it: Puoi anche iniziare creando una connessione da zero. Per semplicità, è possibile utilizzare SQLite. In questa discussione non cambia nulla quando si cambia il motore back-end.

source: DAL constructor
it: Costruttore DAL

source: Basic use:
it: Uso di base:

source: The database is now connected and the connection is stored in the global variable ``db``.
it: Il database è ora connesso e la connessione è memorizzata nella variabile globale ''db''.

source: At any time you can retrieve the connection string.
it: In qualsiasi momento è possibile recuperare la stringa di connessione.

source: and the database name
it: e il nome del database

source: The connection string is called ``_uri`` because it is an instance of a uniform resource identifier.
it: La stringa di connessione è chiamata ''_uri'' perché è un'istanza di un uniform resource identifier.

source: The DAL allows multiple connections with the same database or with different databases, even databases of different types. For now, we will assume the presence of a single database since this is the most common situation.
it: Il DAL consente connessioni multiple con lo stesso database o con database diversi, anche di tipo diverso. Per ora, assumeremo la presenza di un unico database poiché questa è la situazione più comune.

source: DAL signature
it: Firma DAL

source: Connection strings (the uri parameter)
it: Stringhe di connessione (parametro uri)

source: A connection with the database is established by creating an instance of the DAL object:
it: Una connessione con il database viene stabilita creando un'istanza dell'oggetto DAL:

source: ``db`` is not a keyword; it is a local variable that stores the connection object ``DAL``. You are free to give it a different name. The constructor of ``DAL`` requires a single argument, the connection string. The connection string is the only py4web code that depends on a specific back-end database. Here are examples of connection strings for specific types of supported back-end databases (in all cases, we assume the database is running from localhost on its default port and is named “test”):
it: ''db'' non è una parola chiave; è una variabile locale che memorizza l'oggetto di connessione ''DAL''. Sei libero di dargli un nome diverso. Il costruttore di ''DAL'' richiede un singolo argomento, la stringa di connessione. La stringa di connessione è l'unico codice py4web che dipende da un database back-end specifico. Di seguito sono riportati alcuni esempi di stringhe di connessione per tipi specifici di database back-end supportati (in tutti i casi, si presume che il database sia in esecuzione da localhost sulla porta predefinita e sia denominato "test"):

source: Connection string
it: stringa di connessione

source: ``mssql3://username:password@localhost/test``
it: ''mssql3://nomeutente:password@localhost/test''

source: ``mssql4://username:password@localhost/test``
it: ''mssql4://nomeutente:password@localhost/test''

source: **Oracle**
it: **Oracolo**

source: ``db2://username:password@test``
it: ''db2://nomeutente:password@test''

source: ``teradata://DSN=dsn;UID=user;PWD=pass;DATABASE=test``
it: ''teradata://DSN=dsn; UID=utente; PWD=passaggio; DATABASE=test''

source: ``imap://user:password@server:port``
it: ''imap://utente:password@server:porto''

source: in SQLite the database consists of a single file. If it does not exist, it is created. This file is locked every time it is accessed.
it: in SQLite il database è costituito da un singolo file. Se non esiste, viene creato. Questo file viene bloccato ogni volta che vi si accede.

source: in the case of MySQL, PostgreSQL, MSSQL, FireBird, Oracle, DB2, Ingres and Informix the database “test” must be created outside py4web. Once the connection is established, py4web will create, alter, and drop tables appropriately.
it: nel caso di MySQL, PostgreSQL, MSSQL, FireBird, Oracle, DB2, Ingres e Informix il database "test" deve essere creato al di fuori di py4web. Una volta stabilita la connessione, py4web creerà, modificherà ed eliminerà le tabelle in modo appropriato.

source: in the MySQL connection string, the ``?set_encoding=utf8mb4`` at the end sets the encoding to UTF-8 and avoids an ``Invalid utf8 character string:`` error on Unicode characters that consist of four bytes, as by default, MySQL can only handle Unicode characters that consist of one to three bytes.
it: nella stringa di connessione MySQL, ''?set_encoding=utf8mb4'' alla fine imposta la codifica su UTF-8 ed evita un errore ''Stringa di caratteri utf8 non valida:'' sui caratteri Unicode che consistono di quattro byte, poiché per impostazione predefinita, MySQL può gestire solo caratteri Unicode che consistono da uno a tre byte.

source: in the Google/NoSQL case the ``+ndb`` option turns on NDB. NDB uses a Memcache buffer to read data that is accessed often. This is completely automatic and done at the datastore level, not at the py4web level.
it: nel caso di Google/NoSQL l'opzione ''+ndb'' attiva NDB. NDB utilizza un buffer Memcache per leggere i dati a cui si accede spesso. Questo è completamente automatico e viene fatto a livello di datastore, non a livello di py4web.

source: it is also possible to set the connection string to ``None``. In this case DAL will not connect to any back-end database, but the API can still be accessed for testing.
it: è anche possibile impostare la stringa di connessione a ''None''. In questo caso DAL non si connetterà ad alcun database back-end, ma è comunque possibile accedere all'API per il test.

source: Some times you may also need to generate SQL as if you had a connection but without actually connecting to the database. This can be done with
it: A volte potrebbe anche essere necessario generare SQL come se si avesse una connessione, ma senza connettersi effettivamente al database. Questo può essere fatto con

source: In this case you will be able to call ``_select``, ``_insert``, ``_update``, and ``_delete`` to generate SQL but not call ``select``, ``insert``, ``update``, and ``delete``; see `Generating raw SQL`_ for details. In most of the cases you can use ``do_connect=False`` even without having the required database drivers.
it: In questo caso sarete in grado di chiamare ''_select'', ''_insert'', ''_update'' e ''_delete'' per generare SQL ma non chiamare ''select'', ''insert'', ''update'' e ''delete''; vedere 'Generazione di SQL grezzo'_ per i dettagli. Nella maggior parte dei casi è possibile utilizzare ''do_connect=False'' anche senza avere i driver di database richiesti.

source: Notice that by default py4web uses utf8 character encoding for databases. If you work with existing databases that behave differently, you have to change it with the optional parameter ``db_codec`` like
it: Si noti che per impostazione predefinita py4web utilizza la codifica dei caratteri utf8 per i database. Se si lavora con database esistenti che si comportano in modo diverso, è necessario modificarlo con il parametro opzionale ''db_codec'' come

source: Otherwise you’ll get UnicodeDecodeError tickets.
it: In caso contrario, si otterranno ticket UnicodeDecodeError.

source: Connection pooling
it: Pool di connessioni

source: A common argument of the DAL constructor is the ``pool_size``; it defaults to zero.
it: Un argomento comune del costruttore DAL è il ''pool_size''; Il valore predefinito è zero.

source: As it is rather slow to establish a new database connection for each request, py4web implements a mechanism for connection pooling. Once a connection is established and the page has been served and the transaction completed, the connection is not closed but goes into a pool. When the next request arrives, py4web tries to recycle a connection from the pool and use that for the new transaction. If there are no available connections in the pool, a new connection is established.
it: Poiché è piuttosto lento stabilire una nuova connessione al database per ogni richiesta, py4web implementa un meccanismo per il pool di connessioni. Una volta stabilita una connessione, la pagina è stata servita e la transazione è stata completata, la connessione non viene chiusa ma viene inserita in un pool. Quando arriva la richiesta successiva, py4web tenta di riciclare una connessione dal pool e di utilizzarla per la nuova transazione. Se non sono disponibili connessioni nel pool, viene stabilita una nuova connessione.

source: When py4web starts, the pool is always empty. The pool grows up to the minimum between the value of ``pool_size`` and the max number of concurrent requests. This means that if ``pool_size=10`` but our server never receives more than 5 concurrent requests, then the actual pool size will only grow to 5. If ``pool_size=0`` then connection pooling is not used.
it: All'avvio di py4web, il pool è sempre vuoto. Il pool cresce fino al minimo compreso tra il valore di ''pool_size'' e il numero massimo di richieste simultanee. Ciò significa che se ''pool_size=10'' ma il nostro server non riceve mai più di 5 richieste simultanee, la dimensione effettiva del pool crescerà solo fino a 5. Se ''pool_size=0'' allora il pool di connessioni non viene usato.

source: Connections in the pools are shared sequentially among threads, in the sense that they may be used by two different but not simultaneous threads. There is only one pool for each py4web process.
it: Le connessioni nei pool vengono condivise in modo sequenziale tra i thread, nel senso che possono essere usate da due thread diversi ma non simultanei. C'è un solo pool per ogni processo py4web.

source: The ``pool_size`` parameter is ignored by SQLite and Google App Engine. Connection pooling is ignored for SQLite, since it would not yield any benefit.
it: Il parametro ''pool_size'' viene ignorato da SQLite e Google App Engine. Il pool di connessioni viene ignorato per SQLite, poiché non produrrebbe alcun vantaggio.

source: Connection failures (attempts parameter)
it: Errori di connessione (parametro tentativi)

source: If py4web fails to connect to the database it waits 1 second and by default tries again up to 5 times before declaring a failure. In case of connection pooling it is possible that a pooled connection that stays open but unused for some time is closed by the database end. Thanks to the retry feature py4web tries to re-establish these dropped connections. The number of attempts is set via the attempts parameter.
it: Se py4web non riesce a connettersi al database, attende 1 secondo e, per impostazione predefinita, riprova fino a 5 volte prima di dichiarare un errore. In caso di pool di connessioni, è possibile che una connessione in pool che rimane aperta ma inutilizzata per un certo periodo di tempo venga chiusa dalla fine del database. Grazie alla funzione di ripetizione dei tentativi, py4web tenta di ristabilire queste connessioni interrotte. Il numero di tentativi viene impostato tramite il parametro tentativi.

source: Lazy Tables
it: Tavoli pigri

source: Setting ``lazy_tables = True`` provides a major performance boost (but not with py4web). It means that table creation is deferred until the table is actually referenced.
it: L'impostazione ''lazy_tables = True'' fornisce un notevole aumento delle prestazioni (ma non con py4web). Significa che la creazione della tabella viene posticipata fino a quando non viene effettivamente fatto riferimento alla tabella.

source: You should never use lazy tables in py4web. There is no advantage, no need, and possibly concurrency problems.
it: Non dovresti mai usare le tabelle pigre in py4web. Non c'è alcun vantaggio, nessuna necessità e possibilmente problemi di concorrenza.

source: Model-less applications
it: Applicazioni senza modello

source: In py4web the code defined outside of actions (where normally DAL tables are defined) is only executed at startup.
it: In py4web il codice definito al di fuori delle azioni (dove normalmente sono definite le tabelle DAL) viene eseguito solo all'avvio.

source: However, it is possible to define DAL tables on demand inside actions. This is referred to as “model-less” development by the py4web community.
it: Tuttavia, è possibile definire tabelle DAL su richiesta all'interno di azioni. Questo è indicato come sviluppo "model-less" dalla comunità py4web.

source: To use the “model-less” approach, you take responsibility for doing all the housekeeping tasks. You call the table definitions when you need them, and provide database connection passed as parameter. Also, remember maintainability: other py4web developers expect to find database definitions in the ``models.py`` file.
it: Per utilizzare l'approccio "senza modello", ti assumi la responsabilità di svolgere tutte le attività di pulizia. Le definizioni di tabella vengono chiamate quando sono necessarie e si fornisce la connessione al database passata come parametro. Inoltre, ricordate la manutenibilità: altri sviluppatori di py4web si aspettano di trovare le definizioni del database nel file ''models.py''.

source: Replicated databases
it: Database replicati

source: The first argument of ``DAL(...)`` can be a list of URIs. In this case py4web tries to connect to each of them. The main purpose for this is to deal with multiple database servers and distribute the workload among them. Here is a typical use case:
it: Il primo argomento di ''DAL(...) '' può essere un elenco di URI. In questo caso py4web tenta di connettersi a ciascuno di essi. Lo scopo principale è quello di gestire più server di database e distribuire il carico di lavoro tra di essi. Ecco un caso d'uso tipico:
