Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-10.po
Languages: it

source: Then in ``index.html`` you can use the injected variable:
it: Quindi in ''index.html'' puoi usare la variabile iniettata:

source: You can also use ``Inject`` to add variables to the auth.enable line; in this way auth forms would have access to that variable.
it: Si può anche usare ''Inject'' per aggiungere variabili alla riga auth.enable; In questo modo i moduli di autenticazione avrebbero accesso a quella variabile.

source: A more complex usage of Inject is for passing python functions to templates. For example if your helper function is called *sidebar_menu* and it's inside the libs/helpers.py module of your app, you could use this in **controllers.py**:
it: Un uso più complesso di Inject è per il passaggio di funzioni python ai modelli. Ad esempio, se la funzione helper si chiama *sidebar_menu* e si trova all'interno del modulo libs/helpers.py dell'app, è possibile usare questa funzione in **controllers.py**:

source: OR
it: O

source: Then you can import the needed code in the index.html template in a clean way:
it: Quindi puoi importare il codice necessario nel modello di index.html in modo pulito:
