Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-06.po
Languages: it

source: This is one case when a fixture (session) requires another fixture (db). This is handled automatically by py4web and the following lines are equivalent:
it: Questo è un caso in cui un dispositivo (sessione) richiede un altro dispositivo (db). Questo viene gestito automaticamente da py4web e le seguenti righe sono equivalenti:

source: Server-side session anywhere
it: Sessione lato server ovunque

source: You can easily store sessions in any place you want. All you need to do is provide to the ``Session`` object a ``storage`` object with both ``get`` and ``set`` methods. For example, imagine you want to store sessions on your local filesystem:
it: È possibile archiviare facilmente le sessioni in qualsiasi luogo si desideri. Tutto quello che dovete fare è fornire all'oggetto ''Session'' un oggetto ''storage'' con entrambi i metodi ''get'' e ''set''. Ad esempio, immagina di voler memorizzare le sessioni sul tuo file system locale:

source: We leave to you as an exercise to implement expiration, limit the number of files per folder by using subfolders, and implement file locking. Yet we do not recommend storing sessions on the filesystem: it is inefficient and does not scale well.
it: Lasciamo a te come esercizio l'implementazione della scadenza, la limitazione del numero di file per cartella utilizzando le sottocartelle e l'implementazione del blocco dei file. Tuttavia, non consigliamo di archiviare le sessioni sul filesystem: è inefficiente e non scala bene.

source: Sharing sessions
it: Condivisione delle sessioni

source: Imagine you have an app "app1" which uses a session and an app "app2" that wants to share a session with app1. Assuming they use sessions in cookies, "app2" would use:
it: Si supponga di avere un'app "app1" che utilizza una sessione e un'app "app2" che vuole condividere una sessione con app1. Supponendo che utilizzino sessioni nei cookie, "app2" utilizzerebbe:

source: The name tells app2 to use the cookie "app1_session" from app1. Notice it is important that the secret is the same as app1's secret. If using a session in db, then app2 must be using the same db as app1. It is up to the user to make sure that the data stored in the session and shared between the two apps are consistent and we strongly recommend that only app1 writes to the session, unless the share one and the same database.
it: Il nome indica ad app2 di utilizzare il cookie "app1_session" di app1. Si noti che è importante che il segreto sia lo stesso del segreto di app1. Se si utilizza una sessione in db, app2 deve utilizzare lo stesso database di app1. Spetta all'utente assicurarsi che i dati archiviati nella sessione e condivisi tra le due app siano coerenti e si consiglia vivamente che solo app1 scriva nella sessione, a meno che non condivida lo stesso database.

source: Notice that it is possible for one app to handle multiple sessions. For example one session may be its own, and another may be used exclusively to read data from another app (app1) running on the same server:
it: Si noti che è possibile che un'app gestisca più sessioni. Ad esempio, una sessione può essere propria e un'altra può essere usata esclusivamente per leggere i dati da un'altra app (app1) in esecuzione sullo stesso server:

source: The Condition fixture
it: L'apparecchio Condition

source: Some times you want to restrict access to an action based on a given condition. For example to enforce a workflow:
it: A volte si desidera limitare l'accesso a un'azione in base a una determinata condizione. Ad esempio, per applicare un flusso di lavoro:

source: Notice that the Condition fixtures takes a function as first argument which is called `on_request` and must evaluate to True or False.
it: Si noti che le fixture Condition accettano una funzione come primo argomento denominato 'on_request' e devono restituire True o False.

source: Also notice that in the above example the Condition depends on the Session therefore it must be listed after `session` in `action.uses`.
it: Si noti inoltre che nell'esempio precedente la condizione dipende dalla sessione, quindi deve essere elencata dopo 'sessione' in 'action.uses'.

source: If False, by default, the Condition fixture raises 404. It is possible to specify a different exception:
it: Se impostato su False, per impostazione predefinita, l'impianto Condizione genera 404. È possibile specificare un'eccezione diversa:

source: It is also possible to call a function before the exception is raised, for example, to redirect to another page:
it: È anche possibile chiamare una funzione prima che venga generata l'eccezione, ad esempio per reindirizzare a un'altra pagina:

source: You can use condition to check permissions. For example, assuming you are using `Tags` as explained in chapter 13 and you are giving group memberships to users, then you can require that users action have specific group membership:
it: È possibile utilizzare condition per controllare le autorizzazioni. Ad esempio, supponendo che si stia utilizzando 'Tag' come spiegato nel capitolo 13 e che si stiano assegnando appartenenze di gruppo agli utenti, è possibile richiedere che l'azione degli utenti abbia un'appartenenza specifica al gruppo:

source: The URLsigner fixture
it: L'apparecchiatura URLsigner

source: A signed URL is a URL that provides limited permission and time to make an HTTP request by containing authentication information in its query string. The typical usage is as follows:
it: Un URL firmato è un URL che fornisce autorizzazioni e tempo limitati per effettuare una richiesta HTTP contenendo informazioni di autenticazione nella stringa di query. L'utilizzo tipico è il seguente:

source: The DAL fixture
it: L'apparecchio DAL

source: We have already used the ``DAL`` fixture in the context of sessions but maybe you want direct access to the DAL object for the purpose of accessing the database, not just sessions.
it: Abbiamo già usato il dispositivo ''DAL'' nel contesto delle sessioni, ma forse si desidera l'accesso diretto all'oggetto DAL allo scopo di accedere al database, non solo alle sessioni.

source: PY4WEB, by default, uses the **PyDAL** (Python Database Abstraction Layer) which is documented in the next chapter. Here is an example, please remember to create the ``databases`` folder under your project in case it doesn't exist:
it: PY4WEB, per impostazione predefinita, utilizza il **PyDAL** (Python Database Abstraction Layer) che è documentato nel prossimo capitolo. Ecco un esempio, ricordati di creare la cartella ''databases'' sotto il tuo progetto nel caso in cui non esista:

source: Notice that the database fixture defines (creates/re-creates) tables automatically when py4web starts (and every time it reloads this app) and picks a connection from the connection pool at every HTTP request. Also each call to the ``index()`` action is wrapped into a transaction and it commits ``on_success`` and rolls back ``on_error``.
it: Si noti che l'apparecchiatura del database definisce (crea/ricrea) automaticamente le tabelle all'avvio di py4web (e ogni volta che ricarica questa app) e seleziona una connessione dal pool di connessioni a ogni richiesta HTTP. Inoltre, ogni chiamata all'azione ''index()'' è racchiusa in una transazione e fa il commit di ''on_success'' e restituisce ''on_error''.

source: The Auth fixture
it: L'apparecchio Auth

source: ``auth`` and ``auth.user`` are both fixtures that depend on ``session`` and ``db``. Their role is to provide the action with authentication information.
it: ''auth'' e ''auth.user'' sono entrambi fixture che dipendono da ''session'' e ''db''. Il loro ruolo è quello di fornire all'azione le informazioni di autenticazione.

source: Auth is used as follows:
it: L'autenticazione viene utilizzata come segue:

source: The constructor of the ``Auth`` object defines the ``auth_user`` table with the following fields: username, email, password, first_name, last_name, sso_id, and action_token (the last two are mostly for internal use).
it: Il costruttore dell'oggetto ''Auth'' definisce la tabella ''auth_user'' con i seguenti campi: username, email, password, first_name, last_name, sso_id e action_token (gli ultimi due sono per lo più per uso interno).

source: If a ``auth_user`` table is defined before calling ``auth.enable()`` the provided table withh be used.
it: Se viene definita una tabella ''auth_user'' prima di chiamare ''auth.enable()'' verrà usata la tabella fornita.

source: It is also possible to add ``extra_fields`` to the ``auth_user`` table, for example:
it: E' anche possibile aggiungere ''extra_fields'' alla tabella ''auth_user'', ad esempio:

source: In any case, we recommend not to pollute the ``auth_user`` table with extra fields but, instead, to use one of more additional custom tables that reference users and store the required information.
it: In ogni caso, si consiglia di non inquinare la tabella ''auth_user'' con campi aggiuntivi ma, invece, di utilizzare una o più tabelle personalizzate aggiuntive che fanno riferimento agli utenti e memorizzano le informazioni richieste.

source: The ``auth`` object exposes the method:``auth.enable()`` which registers multiple actions including ``{appname}/auth/login``. It requires the presence of the ``auth.html`` template and the ``auth`` value component provided by the ``_scaffold`` app. It also exposes the method:
it: L'oggetto ''auth'' espone il metodo:''auth.enable()'' che registra più azioni tra cui ''{appname}/auth/login''. Richiede la presenza del template ''auth.html'' e del componente valore ''auth'' fornito dall'app ''_scaffold''. Espone inoltre il metodo:

source: which returns a python dictionary containing the information of the currently logged in user. If the user is not logged-in, it returns ``None`` and in this case the code of the example redirects to the ``auth/login`` page.
it: che restituisce un dizionario python contenente le informazioni dell'utente attualmente connesso. Se l'utente non è loggato, restituisce ''None'' e in questo caso il codice dell'esempio reindirizza alla pagina ''auth/login''.

source: Since this check is very common, py4web provides an additional fixture ``auth.user``:
it: Dato che questo controllo è molto comune, py4web fornisce un fixture aggiuntivo ''auth.user'':

source: This fixture automatically redirects to the ``auth/login`` page if user is not logged-in, hence this example is equivalent to the previous one.
it: Questo dispositivo reindirizza automaticamente alla pagina ''auth/login'' se l'utente non è connesso, quindi questo esempio è equivalente al precedente.

source: The ``auth`` fixture is plugin based: it supports multiple plugin methods including OAuth2 (Google, Facebook, Twitter), PAM and LDAP. The :ref:`Authentication and authorization` chapter will show you all the related details.
it: Il dispositivo ''auth'' è basato su plugin: supporta diversi metodi di plugin tra cui OAuth2 (Google, Facebook, Twitter), PAM e LDAP. Il capitolo :ref:'Autenticazione e autorizzazione' ti mostrerà tutti i dettagli correlati.

source: Caveats about fixtures
it: Avvertenze sugli impianti

source: Since fixtures are shared by multiple actions you are not allowed to change their state because it would not be thread safe. There is one exception to this rule. Actions can change some attributes of database fields:
it: Poiché gli impianti sono condivisi da più azioni, non è consentito modificarne lo stato perché non sarebbe thread-safe. C'è un'eccezione a questa regola. Le azioni possono modificare alcuni attributi dei campi del database:

source: Note that this code will only be able to display a form, to process it after submit, additional code needs to be added, as we will see later on. This example is assuming that you created the application from the scaffolding app, so that a generic.html is already created for you.
it: Si noti che questo codice sarà in grado di visualizzare solo un modulo, per elaborarlo dopo l'invio, è necessario aggiungere codice aggiuntivo, come vedremo più avanti. In questo esempio si presuppone che l'applicazione sia stata creata dall'app di scaffolding in modo che sia già stato creato un generic.html per l'utente.

source: The ``readable``, ``writable``, ``default``, ``update``, and ``require`` attributes of ``db.{table}.{field}`` are special objects of class ``ThreadSafeVariable`` defined the ``threadsafevariable`` module. These objects are very much like Python thread local objects but they are re-initialized at every request using the value specified outside of the action. This means that actions can safely change the values of these attributes.
it: Gli attributi ''leggibile'', ''scrivibile'', ''default'', ''update'' e ''require'' di ''db. {table}. {field}'' sono oggetti speciali della classe ''ThreadSafeVariable'' definita il modulo ''threadsafevariable''. Questi oggetti sono molto simili agli oggetti locali del thread Python, ma vengono reinizializzati ad ogni richiesta utilizzando il valore specificato all'esterno dell'azione. Ciò significa che le azioni possono modificare in modo sicuro i valori di questi attributi.

source: Custom fixtures
it: Infissi su misura

source: A fixture is an object with the following minimal structure:
it: Un dispositivo è un oggetto con la seguente struttura minima:

source: For example in the DAL fixture case, `on_request` starts a transaction, `on_success` commits it, and `on_error` rolls it back.
it: Ad esempio, nel caso della partita DAL, 'on_request' avvia una transazione, 'on_success' ne esegue il commit e 'on_error' ne esegue il rollback.

source: In the case of a template, `on_request` and `on_error` do nothing but `on_success` transforms the output.
it: Nel caso di un modello, 'on_request' e 'on_error' non fanno altro che 'on_success' trasforma l'output.

source: In the case of `auth.user` fixtures, `on_request` does all the work of determining if the user is logged in (from the dependent session fixture) and eventually preventing the request from accessing the inner layers.
it: Nel caso di dispositivi 'auth.user', 'on_request' fa tutto il lavoro per determinare se l'utente ha effettuato l'accesso (dal dispositivo di sessione dipendente) ed eventualmente impedire alla richiesta di accedere ai livelli interni.

source: Now imagine a request coming in calling an action with three fixtures A, B, and C. Under normal circumstances above methods are executed in this order:
it: Ora immagina che arrivi una richiesta che chiama un'azione con tre dispositivi A, B e C. In circostanze normali, i metodi di cui sopra vengono eseguiti in questo ordine:

source: i.e. the first fixture (A) is the first one to call `on_request` and the last one to call `on_success`. You can think of them as layers of an onion with the action (user code) at the center. `on_success` is called when entering a layer from the outside and `on_success` is called when exiting a layer from the inside (like WSGI middleware).
it: cioè il primo apparecchio (A) è il primo a chiamare 'on_request' e l'ultimo a chiamare 'on_success'. Puoi pensarli come strati di una cipolla con l'azione (codice utente) al centro. 'on_success' viene chiamato quando si entra in un layer dall'esterno e 'on_success' viene chiamato quando si esce da un layer dall'interno (come il middleware WSGI).

source: If any point an exception is raised inner layers are not called and outer layers will call `on_error` instead of `on_success`.
it: Se viene sollevata un'eccezione, i livelli interni non vengono chiamati e i livelli esterni chiameranno 'on_error' invece di 'on_success'.

source: Context is a shared object which contains:
it: Il contesto è un oggetto condiviso che contiene:

source: content['fixtures']: the list of all the fixtures for the action.
it: content['fixtures']: l'elenco di tutte le partite per l'azione.

source: context['processed']: the list of fixtures that called `on_request` previously within the request.
it: context['processed']: l'elenco delle fixture che hanno chiamato 'on_request' in precedenza all'interno della richiesta.

source: context['exception']: the exception raised by the action or any previous fixture logic (usually None)
it: context['exception']: l'eccezione generata dall'azione o da qualsiasi logica di fixture precedente (di solito None)

source: context['output']: the action output.
it: context['output']: l'output dell'azione.

source: `on_success` and `on_error` can see the current `context['exception']` and transform it. They can see the current `context['output']` and transform it as well.
it: 'on_success' e 'on_error' possono vedere il 'contesto['eccezione'] corrente' e trasformarlo. Possono vedere l'attuale 'contesto['output']' e trasformarlo.

source: For example here is a fixture that transforms the output text to upper case:
it: Ad esempio, ecco un dispositivo che trasforma il testo di output in maiuscolo:

source: Notice that this fixture assumes the `context['output']` is a string and therefore it must come before the template.
it: Si noti che questa fixture presuppone che 'context['output']' sia una stringa e pertanto deve precedere il modello.

source: Here is a fixture that logs exceptions tracebacks to a file:
it: Di seguito è riportato un dispositivo che registra i traceback delle eccezioni in un file:

source: Fixtures also have a `__prerequisite__` attribute. If a fixture takes another fixture as an argument, its value must be appended to the list of `__prerequisites__`. This guarantees that they are always executed in the proper order even if listed in the wrong order. It also makes it optional to declare prerequisite fixtures in `action.uses`.
it: Gli apparecchi hanno anche un attributo "__prerequisite__". Se un dispositivo accetta un altro dispositivo come argomento, il suo valore deve essere aggiunto all'elenco di '__prerequisites__'. Ciò garantisce che vengano sempre eseguiti nell'ordine corretto anche se elencati nell'ordine errato. Rende inoltre facoltativa la dichiarazione dei dispositivi prerequisiti in 'action.uses'.

source: For example `Auth` depends on `db`, `session`, and `flash`. `db` and `session` are indeed arguments. `flash` is a special singleton fixture declared within `Auth`. This means that
it: Ad esempio, 'Auth' dipende da 'db', 'session' e 'flash'. 'db' e 'session' sono effettivamente argomenti. 'flash' è un apparecchio speciale singleton dichiarato all'interno di 'Auth'. Ciò significa che

source: is equivalent to
it: è equivalente a

source: Why are fixtures not simply functions that contain a try/except?
it: Perché gli apparecchi non sono semplicemente funzioni che contengono un try/except?

source: We considered the option but there are some special exceptions that should not be considered errors but success (`py4web.HTTP`, `bottle.HTTResponse`) while other exceptions are errors. The actual logic can be complicated and individual fixtures do not need to know these details.
it: Abbiamo preso in considerazione l'opzione, ma ci sono alcune eccezioni speciali che non devono essere considerate errori ma successo ('py4web. HTTP', 'bottiglia. HTTResponse'), mentre le altre eccezioni sono errori. La logica effettiva può essere complicata e i singoli dispositivi non hanno bisogno di conoscere questi dettagli.

source: They all need to know what the context is and whether they are processing a new request or a response and whether the response is a success or an error. We believe this logic keeps the fixtures easy.
it: Tutti hanno bisogno di sapere qual è il contesto e se stanno elaborando una nuova richiesta o una risposta e se la risposta è un successo o un errore. Crediamo che questa logica mantenga gli infissi facili.

source: Fixtures should not in general communicate with each other but nothing prevents one fixture to put data in the context and another fixture to retrieve that data.
it: In generale, le fixture non devono comunicare tra loro, ma nulla impedisce a una fixture di inserire i dati nel contesto e a un'altra di recuperarli.

source: Multiple fixtures
it: Proiettori multipli

source: As previously stated, it's generally not important the order you use to specify the fixtures but it's mandatory that you always place the template as the **first one**. Consider this:
it: Come affermato in precedenza, in genere non è importante l'ordine utilizzato per specificare gli impianti, ma è obbligatorio posizionare sempre il modello come **primo**. Si consideri quanto segue:

source: Pre-processing (``on_request``) in the fixtures happen in the sequence they are listed and then the ``on_success`` or ``on_error`` methods will be executed in reverse order (as an onion).
it: La pre-elaborazione (''on_request'') nelle fixture avviene nella sequenza in cui sono elencate e quindi i metodi ''on_success'' o ''on_error'' verranno eseguiti in ordine inverso (come una cipolla).

source: Hence the previous code can be explicitly transformed to:
it: Di conseguenza, il codice precedente può essere trasformato in modo esplicito in:

source: So if A.on_success() is a template and B is an inject fixture that allows you to add some extra variables to your templates, then A must come first.
it: Quindi, se A.on_success() è un modello e B è un dispositivo di iniezione che ti consente di aggiungere alcune variabili extra ai tuoi modelli, allora A deve venire prima.

source: Notice that
it: Si noti che

source: is almost equivalent to
it: è quasi equivalente a

source: but not quite. All fixtures declared in one `action.uses` share the same context while fixtures in different `action.uses` use different contexts and therefore they cannot communicate with each other. This may change in the future. For now we recommend using a single call to `action.uses`.
it: ma non del tutto. Tutti gli apparecchi dichiarati in un 'action.uses' condividono lo stesso contesto, mentre gli apparecchi in diversi 'action.uses' utilizzano contesti diversi e quindi non possono comunicare tra loro. Questo potrebbe cambiare in futuro. Per il momento, ti consigliamo di utilizzare un singolo invito a 'action.uses'.

source: Caching and Memoize
it: Memorizzazione nella cache e memorizzazione

source: py4web provides a cache in RAM object that implements the last recently used (LRU) algorithm. It can be used to cache any function via a decorator:
it: py4web fornisce una cache nell'oggetto RAM che implementa l'ultimo algoritmo utilizzato di recente (LRU). Può essere utilizzato per memorizzare nella cache qualsiasi funzione tramite un decoratore:

source: It will cache (memoize) the return value of the ``hello`` function, as function of the input ``name``, for up to 60 seconds. It will store in cache the 1000 most recently used values. The data is always stored in RAM.
it: Memorizzerà nella cache (memorizzerà) il valore di ritorno della funzione ''hello'', in funzione dell'input ''name'', per un massimo di 60 secondi. Memorizzerà nella cache i 1000 valori utilizzati più di recente. I dati sono sempre memorizzati nella RAM.

source: The ``cache`` object is not a fixture and it should not and cannot be registered using the ``@action.uses`` decorator but we mention it here because some of the fixtures use this object internally. For example, template files are cached in RAM to avoid accessing the file system every time a template needs to be rendered.
it: L'oggetto ''cache'' non è un fixture e non dovrebbe e non può essere registrato usando il decoratore ''@action.uses'' ma lo menzioniamo qui perché alcuni dei fixture usano questo oggetto internamente. Ad esempio, i file di modello vengono memorizzati nella cache della RAM per evitare di accedere al file system ogni volta che è necessario eseguire il rendering di un modello.

source: Convenience Decorators
it: Decoratori di convenienza
