Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-10.po
Languages: it

source: YATL helpers
it: Aiutanti YATL

source: Helpers overview
it: Panoramica degli helper

source: Consider the following code in a template:
it: Si consideri il codice seguente in un modello:

source: it is rendered as:
it: Viene reso come:

source: You can easily test the rendering of these commands by copying the _scaffold app (see :ref:`copying-the-scaffold-app`) and then editing the file ``new_app/template/index.html``.
it: Si può facilmente testare il rendering di questi comandi copiando l'app _scaffold (vedi :ref:'copying-the-scaffold-app') e poi modificando il file ''new_app/template/index.html''.

source: ``DIV`` is a **helper class**, i.e., something that can be used to build HTML programmatically. It corresponds to the HTML ``<div>`` tag.
it: ''DIV'' è una **classe helper**, cioè qualcosa che può essere usato per costruire HTML programmaticamente. Corrisponde all'HTML ''<div>''.</div>

source: Helpers can have:
it: Gli helper possono avere:

source: **positional arguments** interpreted as objects contained between the open and close tags, like ``thisisatest`` in the previous example
it: **argomenti posizionali** interpretati come oggetti contenuti tra i tag open e close, come ''thisisatest'' nell'esempio precedente

source: **named arguments** (start with an underscore) interpreted as HTML tag attributes (without the underscore), like ``_class`` and ``_id`` in the previous example
it: **argomenti denominati** (iniziano con un carattere di sottolineatura) interpretati come attributi di tag HTML (senza il carattere di sottolineatura), come ''_class'' e ''_id'' nell'esempio precedente

source: **named arguments** (start without an underscore), in this case these arguments are tag-specific
it: **argomenti denominati** (iniziano senza un carattere di sottolineatura), in questo caso questi argomenti sono specifici del tag

source: Instead of a set of unnamed arguments, a helper can also take a single list or tuple as its set of components using the ``*`` notation and it can take a single dictionary as its set of attributes using the ``**``, for example:
it: Invece di un insieme di argomenti senza nome, un helper può anche prendere una singola lista o tupla come set di componenti usando la notazione ''*'' e può prendere un singolo dizionario come set di attributi usando ''**'', per esempio:

source: (produces the same output as before).
it: (produce lo stesso output di prima).

source: The following are the current set of helpers available within the YATL module:
it: Di seguito è riportato il set corrente di helper disponibili all'interno del modulo YATL:

source: ``A``, ``BEAUTIFY``, ``BODY``, ``CAT``, ``CODE``, ``DIV``, ``EM``, ``FORM``, ``H1``, ``H2``, ``H3``, ``H4``, ``H5``, ``H6``, ``HEAD``, ``HTML``, ``IMG``, ``INPUT``, ``LABEL``, ``LI``, ``METATAG``, ``OL``, ``OPTION``, ``P``, ``PRE``, ``SELECT``, ``SPAN``, ``STRONG``, ``TABLE``, ``TAG``, ``TAGGER``, ``THEAD``, ``TBODY``, ``TD``, ``TEXTAREA``, ``TH``, ``TT``, ``TR``, ``UL``, ``XML``, ``xmlescape``, ``I``, ``META``, ``LINK``, ``TITLE``, ``STYLE``, ``SCRIPT``
it: ''A'', ''ABBELLIRE'', ''CORPO'', ''GATTO'', ''CODICE'', ''DIV'', ''EM'', ''FORMA'', ''H1'', ''H2'', ''H3'', ''H4'', ''H5'', ''H6'', ''HEAD'', ''HTML'', ''IMG'', ''INPUT'', ''LABEL'', ''LI'', ''METATAG'', ''OL'', ''OPTION'', ''', '' P'', ''PRE'', ''SELECT'', ''SPAN'', ''STRONG'', ''TABLE'', ''TAG'', ''TAGGER'', ''THEAD'', ''TBODY'', ''TD'', ''TEXTAREA'', ''TH'', ''TT'', ''TR'', ''UL'', ''XML'', ''XMLESCAPE'', ''I'', ''META'', ''LINK'', ''TITLE'', ''STYLE'', ''SCRIPT''

source: Helpers can be used to build complex expressions, that can then be serialized to XML. For example:
it: Gli helper possono essere utilizzati per creare espressioni complesse, che possono quindi essere serializzate in XML. Per esempio:

source: is rendered:
it: viene visualizzato:

source: Helpers can also be serialized into strings, equivalently, with the ``__str__`` and the ``xml`` methods. This can be manually tested directly with a Python shell or by using the :ref:`shell command option` of py4web and then:
it: Gli helper possono anche essere serializzati in stringhe, in modo equivalente, con i metodi ''__str__'' e ''xml''. Questo può essere testato manualmente direttamente con una shell Python o usando l'opzione :ref:'shell command' di py4web e poi:

source: The helpers mechanism in py4web is more than a system to generate HTML without concatenating strings. It provides a server-side representation of the document object model (DOM).
it: Il meccanismo degli helper in py4web è più di un sistema per generare HTML senza concatenare stringhe. Fornisce una rappresentazione lato server del modello DOM (Document Object Model).

source: Components of helpers can be referenced via their position, and helpers act as lists with respect to their components:
it: È possibile fare riferimento ai componenti degli helper tramite la loro posizione e gli helper fungono da elenchi rispetto ai loro componenti:

source: Attributes of helpers can be referenced by name, and helpers act as dictionaries with respect to their attributes:
it: È possibile fare riferimento agli attributi degli helper in base al nome e gli helper fungono da dizionari rispetto ai relativi attributi:

source: Note, the complete set of components can be accessed via a list called ``a.children``, and the complete set of attributes can be accessed via a dictionary called ``a.attributes``. So, ``a[i]`` is equivalent to ``a.children[i]`` when ``i`` is an integer, and ``a[s]`` is equivalent to ``a.attributes[s]`` when ``s`` is a string.
it: Si noti che è possibile accedere all'insieme completo dei componenti tramite una lista chiamata ''a.children'', e l'insieme completo degli attributi è accessibile tramite un dizionario chiamato ''a.attributes''. Quindi, ''a[i]'' è equivalente a ''a.children[i]'' quando ''i'' è un numero intero, e ''a[s]'' è equivalente a ''a.attributes[s]'' quando ''s'' è una stringa.

source: Notice that helper attributes are passed as keyword arguments to the helper. In some cases, however, attribute names include special characters that are not allowed in Python identifiers (e.g., hyphens) and therefore cannot be used as keyword argument names. For example:
it: Si noti che gli attributi dell'helper vengono passati come argomenti di parole chiave all'helper. In alcuni casi, tuttavia, i nomi degli attributi includono caratteri speciali che non sono consentiti negli identificatori Python (ad esempio, i trattini) e quindi non possono essere utilizzati come nomi di argomenti di parole chiave. Per esempio:

source: will not work because “_data-role” includes a hyphen, which will produce a Python syntax error.
it: non funzionerà perché "_data-role" include un trattino, che produrrà un errore di sintassi Python.

source: In such cases you can pass the attributes as a dictionary and make use of Python’s ``**`` function arguments notation, which maps a dictionary of (key:value) pairs into a set of keyword arguments:
it: In questi casi è possibile passare gli attributi come un dizionario e utilizzare la notazione degli argomenti della funzione ''**'' di Python, che mappa un dizionario di coppie (chiave:valore) in un insieme di argomenti di parole chiave:

source: You can also dynamically create special TAGs:
it: È inoltre possibile creare dinamicamente TAG speciali:

source: Built-in helpers
it: Helper incorporati

source: ``XML`` is an helper object used to encapsulate text that should **not** be escaped. The text may or may not contain valid XML; for example it could contain JavaScript.
it: ''XML'' è un oggetto helper usato per incapsulare il testo che **non** deve essere preceduto da un escape. Il testo può contenere o meno un codice XML valido; ad esempio potrebbe contenere JavaScript.

source: The text in this example is escaped:
it: Il testo in questo esempio è preceduto da caratteri di escape:

source: by using ``XML`` you can prevent escaping:
it: usando ''XML'' è possibile impedire l'escape:

source: Sometimes you want to render HTML stored in a variable, but the HTML may contain unsafe tags such as scripts:
it: A volte si desidera eseguire il rendering del codice HTML memorizzato in una variabile, ma il codice HTML può contenere tag non sicuri, ad esempio gli script:

source: Un-escaped executable input such as this (for example, entered in the body of a comment in a blog) is unsafe, because it can be used to generate cross site scripting (XSS) attacks against other visitors to the page. In this case the py4web ``XML`` helper can sanitize our text to prevent injections and escape all tags except those that you explicitly allow. Here is an example:
it: L'input eseguibile senza caratteri di escape come questo (ad esempio, immesso nel corpo di un commento in un blog) non è sicuro, perché può essere utilizzato per generare attacchi XSS (Cross Site Scripting) contro altri visitatori della pagina. In questo caso l'helper ''XML'' di py4web può disinfettare il nostro testo per prevenire le iniezioni e l'escape di tutti i tag tranne quelli che consenti esplicitamente. Ecco un esempio:

source: The ``XML`` constructors, by default, consider the content of some tags and some of their attributes safe. You can override the defaults using the optional ``permitted_tags`` and ``allowed_attributes`` arguments. Here are the default values of the optional arguments of the ``XML`` helper.
it: I costruttori ''XML'', per impostazione predefinita, considerano sicuro il contenuto di alcuni tag e alcuni dei loro attributi. È possibile sovrascrivere le impostazioni predefinite usando gli argomenti opzionali ''permitted_tags'' e ''allowed_attributes''. Di seguito sono riportati i valori predefiniti degli argomenti opzionali dell'helper ''XML''.

source: This helper is used to build links.
it: Questo helper viene utilizzato per creare collegamenti.

source: ``BODY``
it: ''CORPO''

source: This helper makes the body of a page.
it: Questo helper crea il corpo di una pagina.

source: ``CAT``
it: ''GATTO''

source: This helper concatenates other helpers.
it: Questo helper concatena altri helper.

source: This is the content division element.
it: Questo è l'elemento di divisione del contenuto.

source: Emphasizes its content.
it: Ne enfatizza il contenuto.

source: ``FORM``
it: ''FORMA''

source: Use this helper to make a FORM for user input. Forms will be later discussed in detail in the dedicated :ref:`Forms` chapter.
it: Utilizzare questo helper per creare un FORM per l'input dell'utente. I moduli saranno successivamente discussi in dettaglio nel capitolo dedicato :ref:'Forms'.

source: These helpers are for paragraph headings and subheadings.
it: Questi helper sono per le intestazioni e i sottotitoli dei paragrafi.

source: ``HEAD``
it: ''TESTA''

source: For tagging the HEAD of an HTML page.
it: Per taggare l'HEAD di una pagina HTML.

source: For tagging an HTML page.
it: Per taggare una pagina HTML.

source: ``I``
it: ''Io''

source: This helper makes its contents italic.
it: Questo helper rende il suo contenuto corsivo.

source: It can be used to embed images into HTML.
it: Può essere utilizzato per incorporare immagini in HTML.

source: Here is a combination of A, IMG, and URL helpers for including a static image with a link:
it: Di seguito è riportata una combinazione di helper A, IMG e URL per l'inclusione di un'immagine statica con un collegamento:

source: ``INPUT``
it: ''INGRESSO''

source: Creates an ``<input.../>`` tag. An input tag may not contain other tags, and is closed by ``/>`` instead of ``>``. The input tag has an optional attribute ``_type`` that can be set to “text” (the default), “submit”, “checkbox”, or “radio”.
it: Crea un tag ''<input.../>''. Un tag di input non può contenere altri tag, ed è chiuso da ''/>'' invece di ''>''. Il tag di input ha un attributo opzionale ''_type'' che può essere impostato su "testo" (impostazione predefinita), "submit", "checkbox" o "radio".

source: For radio buttons use the ``_checked`` attribute:
it: Per i pulsanti di opzione usare l'attributo ''_checked'':

source: and similarly for checkboxes:
it: e allo stesso modo per le caselle di controllo:

source: ``LABEL``
it: ''ETICHETTA''

source: It is used to create a LABEL tag for an INPUT field.
it: Viene utilizzato per creare un tag LABEL per un campo INPUT.

source: It makes a list item and should be contained in a ``UL`` or ``OL`` tag.
it: È una voce di elenco e dovrebbe essere contenuta in un tag ''UL'' o ''OL''.

source: It stands for ordered list. The list should contain LI tags.
it: È l'acronimo di Ordered List. L'elenco deve contenere tag LI.

source: ``OPTION``
it: ''OPZIONE''

source: This should only be used as argument of a ``SELECT``.
it: Questo dovrebbe essere usato solo come argomento di un ''SELECT''.

source: For selected options use the ``_selected`` attribute:
it: Per le opzioni selezionate usare l'attributo ''_selected'':

source: This is for tagging a paragraph.
it: Serve per taggare un paragrafo.

source: Generates a ``<pre>...</pre>`` tag for displaying pre-formatted text. The ``CODE`` helper is generally preferable for code listings.
it: Genera un ''<pre>...</pre>'' per la visualizzazione di testo preformattato. L'helper ''CODE'' è generalmente preferibile per i listati di codice.

source: ``SCRIPT``
it: ''COPIONE''

source: This is for include or link a script, such as JavaScript.
it: Questo serve per includere o collegare uno script, ad esempio JavaScript.

source: ``SELECT``
it: ''SELEZIONA''

source: Makes a ``<select>...</select>`` tag. This is used with the ``OPTION`` helper.
it: Fa un ''<select>...</select>''. Questo è usato con l'helper ''OPTION''.

source: Similar to ``DIV`` but used to tag inline (rather than block) content.
it: Simile a ''DIV'' ma usato per taggare il contenuto in linea (piuttosto che a blocchi).

source: ``STYLE``
it: ''STILE''

source: Similar to script, but used to either include or link CSS code. Here the CSS is included:
it: Simile allo script, ma utilizzato per includere o collegare il codice CSS. Qui è incluso il CSS:

source: and here it is linked:
it: Ed ecco che è collegato:

source: ``TABLE``, ``TR``, ``TD``
it: ''TAVOLO'', ''TR'', ''TD''

source: These tags (along with the optional ``THEAD`` and ``TBODY`` helpers) are used to build HTML tables.
it: Questi tag (insieme agli helper opzionali ''THEAD'' e ''TBODY'') sono usati per costruire tabelle HTML.

source: ``TR`` expects ``TD`` content.
it: ''TR'' si aspetta contenuti ''TD''.

source: It is easy to convert a Python array into an HTML table using Python’s ``*`` function arguments notation, which maps list elements to positional function arguments.
it: È facile convertire un array Python in una tabella HTML usando la notazione degli argomenti della funzione ''*'' di Python, che mappa gli elementi della lista agli argomenti della funzione posizionale.

source: Here, we will do it line by line:
it: Qui, lo faremo riga per riga:

source: Here we do all lines at once:
it: Qui facciamo tutte le linee contemporaneamente:

source: ``TBODY``
it: ''CORPO''

source: This is used to tag rows contained in the table body, as opposed to header or footer rows. It is optional.
it: Viene utilizzato per contrassegnare le righe contenute nel corpo della tabella, anziché le righe di intestazione o piè di pagina. È facoltativo.

source: This helper makes a ``<textarea>...</textarea>`` tag.
it: Questo aiutante fa un ''<textarea>...</textarea>''.

source: This is used instead of ``TD`` in table headers.
it: Questo è usato al posto di ''TD'' nelle intestazioni delle tabelle.

source: This is used to tag table header rows.
it: Viene utilizzato per contrassegnare le righe di intestazione della tabella.

source: ``TITLE``
it: ''TITOLO''

source: This is used to tag the title of a page in an HTML header.
it: Viene utilizzato per contrassegnare il titolo di una pagina in un'intestazione HTML.

source: Tags text as typewriter (monospaced) text.
it: Contrassegna il testo come testo della macchina da scrivere (a spaziatura fissa).

source: It stands for unordered list. The list should contain LI tags.
it: È l'acronimo di elenco non ordinato. L'elenco deve contenere tag LI.

source: The URL helper is not part of yatl package, instead it is provided by py4web.
it: L'helper URL non fa parte del pacchetto yatl, ma è fornito da py4web.

source: Custom helpers
it: Aiutanti personalizzati

source: Sometimes you need to generate **custom XML tags***. For this purpose py4web provides ``TAG``, a universal tag generator.
it: A volte è necessario generare **tag XML personalizzati***. A questo scopo py4web mette a disposizione ''TAG'', un generatore di tag universale.

source: generates the following XML:
it: genera il seguente codice XML:

source: Arguments “a”, “b”, and “d” are automatically escaped; use the ``XML`` helper to suppress this behavior. Using ``TAG`` you can generate HTML/XML tags not already provided by the API. TAGs can be nested, and are serialized with ``str().`` An equivalent syntax is:
it: Gli argomenti "a", "b" e "d" vengono automaticamente preceduti da caratteri di escape; usare l'helper ''XML'' per sopprimere questo comportamento. Usando ''TAG'' è possibile generare tag HTML/XML non già forniti dall'API. I TAG possono essere nidificati e serializzati con ''str().'' Una sintassi equivalente è:

source: Self-closing tags can be generated with the TAG helper. The tag name must end with a “/”.
it: I tag a chiusura automatica possono essere generati con l'helper TAG. Il nome del tag deve terminare con "/".

source: Notice that ``TAG`` is an object, and ``TAG.name`` or ``TAG['name']`` is a function that returns an helper instance.
it: Si noti che ''TAG'' è un oggetto, e ''TAG.name'' o ''TAG['name']'' è una funzione che restituisce un'istanza helper.

source: ``BEAUTIFY``
it: ''ABBELLIRE''

source: ``BEAUTIFY`` is used to build HTML representations of compound objects, including lists, tuples and dictionaries:
it: ''BEAUTIFY'' è usato per costruire rappresentazioni HTML di oggetti composti, incluse liste, tuple e dizionari:

source: ``BEAUTIFY`` returns an XML-like object serializable to XML, with a nice looking representation of its constructor argument. In this case, the XML representation of:
it: ''BEAUTIFY'' restituisce un oggetto XML-like serializzabile in XML, con una bella rappresentazione del suo argomento costruttore. In questo caso, la rappresentazione XML di:

source: will render as:
it: verrà visualizzato come:

source: Server-side *DOM*
it: Lato server *DOM*

source: As we've already seen the helpers mechanism in py4web also provides a server-side representation of the document object model (DOM).
it: Come abbiamo già visto, il meccanismo degli helper in py4web fornisce anche una rappresentazione lato server del modello a oggetti del documento (DOM).

source: ``children``
it: ''Bambini''

source: Each helper object keep the list of its components into the ``children`` attribute.
it: Ogni oggetto helper mantiene l'elenco dei suoi componenti nell'attributo ''children''.

source: ``find``
it: ''Trova''

source: To help searching into the DOM, all helpers have a ``find`` method with the following signature:
it: Per facilitare la ricerca nel DOM, tutti gli helper hanno un metodo ''find'' con la seguente firma:

source: that returns all the components matching supplied arguments.
it: che restituisce tutti i componenti corrispondenti agli argomenti forniti.

source: A very simple ``query`` can be a tag name:
it: Una ''query'' molto semplice può essere il nome di un tag:

source: It also supports a syntax compatible with `jQuery <https://api.jquery.com/>`__, accepting the following expressions:
it: Supporta inoltre una sintassi compatibile con 'jQuery <https://api.jquery.com/>'__, accettando le seguenti espressioni:

source: `jQuery Multiple Selector <https://api.jquery.com/multiple-selector/>`__, e.g. “selector1, selector2, selectorN”,
it: 'jQuery Multiple Selector <https://api.jquery.com/multiple-selector/>'__, ad esempio "selector1, selector2, selectorN",

source: `jQuery Descendant Selector <https://api.jquery.com/descendant-selector/>`__, e.g. “ancestor descendant”,
it: 'selettore discendente jQuery <https://api.jquery.com/descendant-selector/>'__, ad esempio "discendente antenato",

source: `jQuery ID Selector <https://api.jquery.com/id-selector/>`__, e.g. “#id”,
it: 'selettore ID jQuery <https://api.jquery.com/id-selector/>'__, ad esempio "#id",

source: `jQuery Class Selector <https://api.jquery.com/class-selector/>`__, e.g. “.class”, and
it: 'Selettore di classe jQuery <https://api.jquery.com/class-selector/>'__, ad esempio ".class" e

source: `jQuery Attribute Equals Selector <https://api.jquery.com/attribute-equals-selector/>`__, e.g. “[name=value]”, notice that here the value must be unquoted.
it: 'jQuery Attribute Equals Selector <https://api.jquery.com/attribute-equals-selector/>'__, ad esempio "[name=value]", si noti che qui il valore deve essere senza virgolette.

source: Here are some examples:
it: Ecco alcuni esempi:

source: Elements that are matched can also be replaced or removed by specifying a ``replace`` argument (note, a list of the original matching elements is still returned as usual).
it: Gli elementi che sono abbinati possono anche essere sostituiti o rimossi specificando un argomento ''replace'' (nota, un elenco degli elementi corrispondenti originali viene ancora restituito come al solito).

source: ``replace`` can be a callable, which will be passed the original element and should return a new element to replace it.
it: ''replace'' può essere un callable, che verrà passato l'elemento originale e dovrebbe restituire un nuovo elemento per sostituirlo.

source: If ``replace=None``, matching elements will be removed completely.
it: Se ''replace=None'', gli elementi corrispondenti verranno rimossi completamente.

source: If a ``text`` argument is specified, elements will be searched for text components that match text, and any matching text components will be replaced (``text`` is ignored if ``replace`` is not also specified, use a ``find`` argument when you only need searching for textual elements).
it: Se viene specificato un argomento ''text'', gli elementi verranno cercati per i componenti di testo che corrispondono al testo, e tutti i componenti di testo corrispondenti verranno sostituiti (''text'' viene ignorato se non è specificato anche ''replace'', usare un argomento ''find'' quando è necessaria solo la ricerca di elementi testuali).

source: Like the ``find`` argument, ``text`` can be a string or a compiled regex.
it: Come l'argomento ''find'', ''text'' può essere una stringa o un'espressione regolare compilata.

source: If other attributes are specified along with ``text``, then only components that match the specified attributes will be searched for text.
it: Se vengono specificati altri attributi insieme a ''testo'', verranno cercati solo i componenti che corrispondono agli attributi specificati.

source: Using Inject
it: Utilizzo di Inject

source: Normally all the code should be called from the controller program, and only the necessary data is passed to the template in order to be displayed. But sometimes it's useful to pass variables or even use a python function as a helper called from a template.
it: Normalmente tutto il codice deve essere richiamato dal programma di controllo e solo i dati necessari vengono passati al modello per essere visualizzati. Ma a volte è utile passare variabili o anche usare una funzione python come helper chiamato da un modello.

source: In this case you can use the fixture ``Inject`` from py4web.utils.factories.
it: In questo caso è possibile utilizzare il fixture ''Inject'' da py4web.utils.factories.

source: This is a simple example for injecting a variable:
it: Questo è un semplice esempio per l'inserimento di una variabile:
