Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: In this case the DAL tries to connect to the first and, on failure, it will try the second and the third. This can also be used to distribute load in a database master-slave configuration.
it: In questo caso il DAL tenta di connettersi al primo e, in caso di fallimento, proverà il secondo e il terzo. Questo può essere utilizzato anche per distribuire il carico in una configurazione master-slave del database.

source: Reserved keywords
it: Parole chiave riservate

source: ``check_reserved`` tells the constructor to check table names and column names against reserved SQL keywords in target back-end databases. ``check_reserved`` defaults to None.
it: ''check_reserved'' indica al costruttore di controllare i nomi delle tabelle e dei nomi delle colonne rispetto alle parole chiave SQL riservate nei database back-end di destinazione. Il valore predefinito di ''check_reserved'' è Nessuno.

source: This is a list of strings that contain the database back-end adapter names.
it: Si tratta di un elenco di stringhe che contengono i nomi degli adattatori back-end del database.

source: The adapter name is the same as used in the DAL connection string. So if you want to check against PostgreSQL and MSSQL then your db connection would look as follows:
it: Il nome dell'adapter è lo stesso utilizzato nella stringa di connessione DAL. Quindi, se vuoi controllare PostgreSQL e MSSQL, la tua connessione db sarà simile alla seguente:

source: The DAL will scan the keywords in the same order as of the list.
it: Il DAL eseguirà la scansione delle parole chiave nello stesso ordine dell'elenco.

source: There are two extra options “all” and “common”. If you specify all, it will check against all known SQL keywords. If you specify common, it will only check against common SQL keywords such as ``SELECT``, ``INSERT``, ``UPDATE``, etc.
it: Ci sono due opzioni extra "tutte" e "comuni". Se si specifica all, verranno eseguite tutte le parole chiave SQL note. Se specifichi common, controllerà solo le parole chiave SQL comuni come ''SELECT'', ''INSERT'', ''UPDATE'', ecc.

source: For supported back ends you may also specify if you would like to check against the non-reserved SQL keywords as well. In this case you would append ``_nonreserved`` to the name. For example:
it: Per i back-end supportati, è anche possibile specificare se si desidera eseguire il controllo anche in base alle parole chiave SQL non riservate. In questo caso si dovrebbe aggiungere ''_nonreserved'' al nome. Per esempio:

source: The following database backends support reserved words checking.
it: I seguenti backend di database supportano il controllo delle parole riservate.

source: ``firebird(_nonreserved)``
it: ''uccello di fuoco(_nonreserved)''

source: ``oracle``
it: ''Oracolo''

source: Database quoting and case settings
it: Quotazione del database e impostazioni dei casi

source: Quoting of SQL entities are enabled by default in DAL, that is:
it: Le virgolette di entità SQL sono abilitate per impostazione predefinita in DAL, ovvero:

source: ``entity_quoting = True``
it: ''entity_quoting = Vero''

source: This way identifiers are automatically quoted in SQL generated by DAL. At SQL level keywords and unquoted identifiers are case insensitive, thus quoting an SQL identifier makes it case sensitive.
it: In questo modo gli identificatori vengono automaticamente citati in SQL generato da DAL. A livello SQL, le parole chiave e gli identificatori non racchiusi tra virgolette non fanno distinzione tra maiuscole e minuscole, quindi la citazione di un identificatore SQL fa distinzione tra maiuscole e minuscole.

source: Notice that unquoted identifiers should always be folded to lower case by the back-end engine according to SQL standard but not all engines are compliant with this (for example PostgreSQL default folding is upper case).
it: Si noti che gli identificatori non racchiusi tra virgolette devono sempre essere ripiegati in minuscolo dal motore back-end in base allo standard SQL, ma non tutti i motori sono conformi a questo (ad esempio, la piegatura predefinita di PostgreSQL è maiuscola).

source: By default DAL ignores field case too, to change this use:
it: Per impostazione predefinita, DAL ignora anche le maiuscole e minuscole del campo, per modificare questo utilizzo:

source: ``ignore_field_case = False``
it: ''ignore_field_case = Falso''

source: To be sure of using the same names in python and in the DB schema, you must arrange for both settings above. Here is an example:
it: Per essere sicuri di utilizzare gli stessi nomi in python e nello schema del database, è necessario organizzare entrambe le impostazioni di cui sopra. Ecco un esempio:

source: Making a secure connection
it: Stabilire una connessione sicura

source: Sometimes it is necessary (and advised) to connect to your database using secure connection, especially if your database is not on the same server as your application. In this case you need to pass additional parameters to the database driver. You should refer to database driver documentation for details.
it: A volte è necessario (e consigliato) connettersi al database utilizzando una connessione protetta, soprattutto se il database non si trova sullo stesso server dell'applicazione. In questo caso è necessario passare parametri aggiuntivi al driver del database. Per ulteriori informazioni, fare riferimento alla documentazione del driver del database.

source: For PostgreSQL with psycopg2 it should look like this:
it: Per PostgreSQL con psycopg2 dovrebbe essere simile a questo:

source: where parameters ``sslrootcert``, ``sslcert`` and ``sslkey`` should contain the full path to the files. You should refer to PostgreSQL documentation on how to configure PostgreSQL server to accept secure connections.
it: dove i parametri ''sslrootcert'', ''sslcert'' e ''sslkey'' dovrebbero contenere il percorso completo dei file. È necessario fare riferimento alla documentazione di PostgreSQL su come configurare il server PostgreSQL per accettare connessioni sicure.

source: Other DAL constructor parameters
it: Altri parametri del costruttore DAL

source: Database folder location
it: Percorso della cartella del database

source: ``folder`` sets the place where migration files will be created (see Migrations_ for details). It is also used for SQLite databases. Automatically set within py4web. Set a path when using DAL outside py4web.
it: ''Cartella'' imposta il luogo in cui verranno creati i file di migrazione (vedere Migrations_ per i dettagli). Viene utilizzato anche per i database SQLite. Impostato automaticamente all'interno di py4web. Impostare un percorso quando si utilizza DAL al di fuori di py4web.

source: Default migration settings
it: Impostazioni di migrazione predefinite

source: The DAL constructor migration settings are booleans affecting defaults and global behaviour.
it: Le impostazioni di migrazione del costruttore DAL sono valori booleani che influiscono sulle impostazioni predefinite e sul comportamento globale.

source: ``migrate = True`` sets default migrate behavior for all tables
it: ''migrate = True'' imposta il comportamento di migrazione predefinito per tutte le tabelle

source: ``fake_migrate = False`` sets default fake_migrate behavior for all tables
it: ''fake_migrate = False'' imposta il comportamento predefinito fake_migrate per tutte le tabelle

source: ``migrate_enabled = True`` If set to False disables ALL migrations
it: ''migrate_enabled = True'' Se impostato su False disabilita TUTTE le migrazioni

source: ``fake_migrate_all = False`` If set to True fake migrates ALL tables
it: ''fake_migrate_all = False'' Se impostato su True fake migra TUTTE le tabelle

source: ``commit`` and ``rollback``
it: ''commit'' e ''rollback''

source: The insert, truncate, delete, and update operations aren't actually committed until py4web issues the commit command. The create and drop operations may be executed immediately, depending on the database engine.
it: Le operazioni di inserimento, troncamento, eliminazione e aggiornamento non vengono effettivamente eseguite fino a quando py4web non esegue il comando commit. Le operazioni di creazione ed eliminazione possono essere eseguite immediatamente, a seconda del motore di database.

source: If you pass ``db`` in an ``action.uses`` decorator, you don't need to call commit in the controller, it is done for you. (Also, if you use ``authenticated`` or ``unauthenticated`` decorator.)
it: Se passate ''db'' in un decoratore ''action.uses'', non c'è bisogno di chiamare commit nel controller, è fatto per voi. (Inoltre, se si usa il decoratore ''autenticato'' o ''non autenticato''.)

source: always add ``db`` in an ``action.uses`` decorator (or use the ``authenticated`` or ``unauthenticated`` decorator). Otherwise you have to add ``db.commit()`` in every define_table and in every table activities: insert(), update(), delete()
it: Aggiungere sempre ''db'' in un decoratore ''action.uses'' (o usare il decoratore ''authenticated'' o ''unauthenticated''). Altrimenti devi aggiungere ''db.commit()'' in ogni define_table e in ogni attività della tabella: insert(), update(), delete()

source: So in actions there is normally no need to ever call ``commit`` or ``rollback`` explicitly in py4web unless you need more granular control.
it: Quindi nelle azioni normalmente non c'è bisogno di chiamare ''commit'' o ''rollback'' in modo esplicito in py4web, a meno che non si abbia bisogno di un controllo più granulare.

source: But if you executed commands via the shell, you are required to manually commit:
it: Ma se hai eseguito comandi tramite la shell, ti viene richiesto di eseguire manualmente il commit:

source: To check it let’s insert a new record:
it: Per verificarlo inseriamo un nuovo record:

source: and roll back, i.e., ignore all operations since the last commit:
it: e rollback, cioè ignora tutte le operazioni dall'ultimo commit:

source: If you now insert again, the counter will again be set to 2, since the previous insert was rolled back.
it: Se ora si inserisce di nuovo, il contatore verrà nuovamente impostato su 2, poiché è stato eseguito il rollback dell'inserimento precedente.

source: Code in models, views and controllers is enclosed in py4web code that looks like this (pseudo code):
it: Il codice nei modelli, nelle viste e nei controller è racchiuso nel codice py4web che assomiglia a questo (pseudo codice):

source: Table constructor
it: Costruttore di tabelle

source: Tables are defined in the DAL via ``define_table``.
it: Le tabelle sono definite nel DAL tramite ''define_table''.

source: define_table signature
it: define_table firma

source: The signature for define_table method is:
it: La firma per define_table metodo è:

source: It accepts a mandatory table name and an optional number of ``Field`` instances (even none). You can also pass a ``Table`` (or subclass) object instead of a ``Field`` one, this clones and adds all the fields (but the “id”) to the defining table. Other optional keyword args are: ``rname``, ``redefine``, ``common_filter``, ``fake_migrate``, ``fields``, ``format``, ``migrate``, ``on_define``, ``plural``, ``polymodel``, ``primarykey``, ``sequence_name``, ``singular``, ``table_class``, and ``trigger_name``, which are discussed below.
it: Accetta un nome di tabella obbligatorio e un numero opzionale di istanze ''Field'' (anche nessuna). Puoi anche passare un oggetto ''Table'' (o sottoclasse) invece di uno ''Field'', questo clona e aggiunge tutti i campi (tranne l'"id") alla tabella di definizione. Altre parole chiave opzionali sono: ''rname'', ''redefine'', ''common_filter'', ''fake_migrate'', ''fields'', ''format'', ''migrate'', ''on_define'', ''plural'', ''polymodel'', ''primarykey'', ''sequence_name'', ''singular'', ''table_class'' e ''trigger_name'', che sono discussi di seguito.

source: For example:
it: Ad esempio:

source: It defines, stores and returns a ``Table`` object called “person” containing a field (column) “name”. This object can also be accessed via ``db.person``, so you do not need to catch the value returned by define_table.
it: Definisce, memorizza e restituisce un oggetto ''Table'' chiamato "person" contenente un campo (colonna) "name". È possibile accedere a questo oggetto anche tramite ''db.person'', quindi non è necessario catturare il valore restituito da define_table.

source: ``id``: Notes about the primary key
it: ''id'': Note sulla chiave primaria

source: Do not declare a field called “id”, because one is created by py4web anyway. Every table has a field called “id” by default. It is an auto-increment integer field (usually starting at 1) used for cross-reference and for making every record unique, so “id” is a primary key. (Note: the id counter starting at 1 is back-end specific. For example, this does not apply to the Google App Engine NoSQL.)
it: Non dichiarare un campo chiamato "id", perché ne viene comunque creato uno da py4web. Ogni tabella ha un campo chiamato "id" per impostazione predefinita. Si tratta di un campo intero a incremento automatico (di solito a partire da 1) utilizzato per i riferimenti incrociati e per rendere unico ogni record, quindi "id" è una chiave primaria. (Nota: il contatore id a partire da 1 è specifico del back-end. Ad esempio, questo non si applica a Google App Engine NoSQL.

source: Optionally you can define a field of ``type='id'`` and py4web will use this field as auto-increment id field. This is not recommended except when accessing legacy database tables which have a primary key under a different name. With some limitation, you can also use different primary keys using the ``primarykey`` parameter.
it: Opzionalmente è possibile definire un campo di ''type='id''' e py4web userà questo campo come campo id di incremento automatico. Questa operazione non è consigliata, tranne quando si accede a tabelle di database legacy che hanno una chiave primaria con un nome diverso. Con alcune limitazioni, è anche possibile utilizzare chiavi primarie diverse usando il parametro ''primarykey''.

source: ``plural`` and ``singular``
it: ''plurale'' e ''singolare''

source: As pyDAL is a general DAL, it includes plural and singular attributes to refer to the table names so that external elements can use the proper name for a table.
it: Poiché pyDAL è un DAL generale, include attributi plurali e singolari per fare riferimento ai nomi delle tabelle in modo che gli elementi esterni possano usare il nome corretto per una tabella.

source: ``redefine``
it: ''ridefinire''

source: Tables can be defined only once but you can force py4web to redefine an existing table:
it: Le tabelle possono essere definite una sola volta, ma è possibile forzare py4web a ridefinire una tabella esistente:

source: The redefinition may trigger a migration if table definition changes.
it: La ridefinizione può attivare una migrazione se la definizione della tabella viene modificata.

source: ``format``: Record representation
it: ''format'': Rappresentazione dei record

source: It is optional but recommended to specify a format representation for records with the ``format`` parameter.
it: E' facoltativo ma si consiglia di specificare una rappresentazione del formato per i record con il parametro ''format''.

source: or
it: o

source: or even more complex ones using a function:
it: o ancora più complessi utilizzando una funzione:

source: The format attribute will be used for two purposes:
it: L'attributo format verrà utilizzato per due scopi:

source: To represent referenced records in select/option drop-downs.
it: Per rappresentare i record a cui si fa riferimento negli elenchi a discesa di selezione/opzione.

source: To set the ``db.othertable.otherfield.represent`` attribute for all fields referencing this table. This means that the ``Form`` constructor will not show references by id but will use the preferred format representation instead.
it: Per impostare l'attributo ''db.othertable.otherfield.represent'' per tutti i campi che fanno riferimento a questa tabella. Ciò significa che il costruttore ''Form'' non mostrerà i riferimenti per id ma userà invece la rappresentazione del formato preferito.

source: ``rname``: Real name
it: ''rname'': Vero nome

source: ``rname`` sets a database backend name for the table. This makes the py4web table name an alias, and ``rname`` is the real name used when constructing the query for the backend. To illustrate just one use, ``rname`` can be used to provide MSSQL fully qualified table names accessing tables belonging to other databases on the server: ``rname = 'db1.dbo.table1'``
it: ''rname'' imposta un nome di backend del database per la tabella. Questo rende il nome della tabella py4web un alias, e ''rname'' è il vero nome usato quando si costruisce la query per il backend. Per illustrare solo un utilizzo, ''rname'' può essere usato per fornire nomi di tabella completi MSSQL che accedono a tabelle appartenenti ad altri database sul server: ''rname = 'db1.dbo.table1'''

source: ``primarykey``: Support for legacy tables
it: ''primarykey'': supporto per le tabelle legacy

source: ``primarykey`` helps support legacy tables with existing primary keys, even multi-part. See `Legacy databases and keyed tables`_.
it: ''PrimaryKey'' aiuta a supportare le tabelle legacy con chiavi primarie esistenti, anche multi-parte. Vedere 'Database legacy e tabelle con chiave'_.

source: ``migrate``, ``fake_migrate``
it: ''migrare'', ''fake_migrate''

source: ``migrate`` sets migration options for the table. Refer to `Migrations`_ for details.
it: ''migrate'' imposta le opzioni di migrazione per la tabella. Per informazioni dettagliate, fare riferimento a 'Migrazioni'_.

source: If you define your own table class as a sub-class of pydal.objects.Table, you can provide it here; this allows you to extend and override methods. Example:
it: Se si definisce la propria classe table come sottoclasse di pydal.objects.Table, è possibile fornirla qui; In questo modo è possibile estendere ed eseguire l'override dei metodi. Esempio:

source: The name of a custom table sequence (if supported by the database). Can create a SEQUENCE (starting at 1 and incrementing by 1) or use this for legacy tables with custom sequences.
it: Nome di una sequenza di tabelle personalizzata (se supportata dal database). Può creare una SEQUENZA (a partire da 1 e incrementando di 1) o utilizzarla per tabelle legacy con sequenze personalizzate.

source: Note that when necessary, py4web will create sequences automatically by default.
it: Si noti che, quando necessario, py4web creerà automaticamente le sequenze per impostazione predefinita.

source: Relates to ``sequence_name``. Relevant for some backends which do not support auto-increment numeric fields.
it: Si riferisce a ''sequence_name''. Rilevante per alcuni backend che non supportano l'incremento automatico dei campi numerici.

source: ``polymodel``
it: ''Polimodello''

source: For use with Google App Engine.
it: Da utilizzare con Google App Engine.

source: ``on_define`` is a callback triggered when a lazy_table is instantiated, although it is called anyway if the table is not lazy. This allows dynamic changes to the table without losing the advantages of delayed instantiation.
it: ''on_define'' è un callback attivato quando viene creata un'istanza di un lazy_table, anche se viene chiamato comunque se la tabella non è pigra. In questo modo è possibile apportare modifiche dinamiche alla tabella senza perdere i vantaggi della creazione di istanze ritardate.

source: Example:
it: Esempio:

source: Note this example shows how to use ``on_define`` but it is not actually necessary. The simple ``requires`` values could be added to the Field definitions and the table would still be lazy. However, ``requires`` which take a Set object as the first argument, such as IS_IN_DB, will make a query like ``db.sometable.somefield == some_value`` which would cause ``sometable`` to be defined early. This is the situation saved by ``on_define``.
it: Nota: questo esempio mostra come usare ''on_define'', ma in realtà non è necessario. I semplici valori ''requires'' potrebbero essere aggiunti alle definizioni dei campi e la tabella sarebbe ancora pigra. Tuttavia, ''requires'' che accetta un oggetto Set come primo argomento, come IS_IN_DB, creerà una query come ''db.sometable.somefield == some_value'' che causerebbe la definizione anticipata di ''sometable''. Questa è la situazione salvata da ''on_define''.

source: Adding attributes to fields and tables
it: Aggiunta di attributi a campi e tabelle

source: If you need to add custom attributes to fields, you can simply do this: ``db.table.field.extra = {}``
it: Se hai bisogno di aggiungere attributi personalizzati ai campi, puoi semplicemente fare questo: ''db.table.field.extra = {}''

source: “extra” is not a keyword; it’s a custom attribute now attached to the field object. You can do it with tables too but they must be preceded by an underscore to avoid naming conflicts with fields:
it: "extra" non è una parola chiave; Si tratta di un attributo personalizzato ora associato all'oggetto campo. Puoi farlo anche con le tabelle, ma devono essere precedute da un carattere di sottolineatura per evitare conflitti di denominazione con i campi:

source: Legacy databases and keyed tables
it: Database legacy e tabelle con chiave

source: py4web can connect to legacy databases under some conditions.
it: py4web può connettersi a database legacy in alcune condizioni.

source: The easiest way is when these conditions are met:
it: Il modo più semplice è quando sono soddisfatte queste condizioni:

source: Each table must have a unique auto-increment integer field called “id”.
it: Ogni tabella deve avere un campo intero univoco a incremento automatico denominato "id".

source: Records must be referenced exclusively using the “id” field.
it: È necessario fare riferimento ai record esclusivamente utilizzando il campo "id".

source: When accessing an existing table, i.e., a table not created by py4web in the current application, always set ``migrate=False``.
it: Quando si accede a una tabella esistente, cioè una tabella non creata da py4web nell'applicazione corrente, impostare sempre ''migrate=False''.

source: If the legacy table has an auto-increment integer field but it is not called “id”, py4web can still access it but the table definition must declare the auto-increment field with ‘id’ type (that is using ``Field('...', 'id')``).
it: Se la tabella legacy ha un campo intero a incremento automatico ma non è chiamato "id", py4web può ancora accedervi ma la definizione della tabella deve dichiarare il campo a incremento automatico con il tipo 'id' (che utilizza ''Field('...', 'id')'').

source: Finally if the legacy table uses a primary key that is not an auto-increment id field it is possible to use a “keyed table”, for example:
it: Infine, se la tabella legacy utilizza una chiave primaria che non è un campo id a incremento automatico, è possibile utilizzare una "tabella con chiave", ad esempio:

source: ``primarykey`` is a list of the field names that make up the primary key.
it: ''PrimaryKey'' è un elenco dei nomi dei campi che compongono la chiave primaria.

source: All primarykey fields have a ``NOT NULL`` set even if not specified.
it: Tutti i campi primarykey hanno un ''NOT NULL'' impostato anche se non specificato.

source: Keyed tables can only reference other keyed tables.
it: Le tabelle con chiave possono fare riferimento solo ad altre tabelle con chiave.

source: Referencing fields must use the ``reference tablename.fieldname`` format.
it: I campi di riferimento devono usare il formato ''nometabella di riferimento.nomecampo''.

source: The ``update_record`` function is not available for Rows of keyed tables.
it: La funzione ''update_record'' non è disponibile per le righe di tabelle con chiave.
