Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: You can serialize a single table in CSV and store it in a file “test.csv”:
it: È possibile serializzare una singola tabella in CSV e memorizzarla in un file "test.csv":

source: Converting a ``Rows`` object into a string produces an encoded binary string and it's better to be explicit with the encoding used:
it: La conversione di un oggetto ''Rows'' in una stringa produce una stringa binaria codificata ed è meglio essere espliciti con la codifica utilizzata:

source: This is equivalent to
it: Ciò equivale a

source: You can read the CSV file back with:
it: Puoi rileggere il file CSV con:

source: Again, you can be explict about the encoding for the exporting file:
it: Anche in questo caso, è possibile specificare in modo esplicito la codifica del file di esportazione:

source: and the importing one:
it: e quello importatore:

source: When importing, py4web looks for the field names in the CSV header. In this example, it finds two columns: “person.id” and “person.name”. It ignores the “person.” prefix, and it ignores the “id” fields. Then all records are appended and assigned new ids.
it: Durante l'importazione, py4web cerca i nomi dei campi nell'intestazione CSV. In questo esempio, trova due colonne: "person.id" e "person.name". Ignora il prefisso "person." e ignora i campi "id". Quindi tutti i record vengono aggiunti e assegnati nuovi ID.

source: CSV (all tables at once)
it: CSV (tutte le tabelle contemporaneamente)

source: In py4web, you can backup/restore an entire database with two commands:
it: In py4web, è possibile eseguire il backup/ripristino di un intero database con due comandi:

source: To export:
it: Per esportare:

source: To import:
it: Per importare:

source: This mechanism can be used even if the importing database is of a different type than the exporting database.
it: Questo meccanismo può essere utilizzato anche se il database di importazione è di tipo diverso da quello di esportazione.

source: The data is stored in “somefile.csv” as a CSV file where each table starts with one line that indicates the tablename, and another line with the fieldnames:
it: I dati vengono memorizzati in "somefile.csv" come file CSV in cui ogni tabella inizia con una riga che indica il nome della tabella e un'altra riga con i nomi dei campi:

source: Two tables are separated by ``\r\n\r\n`` (that is two empty lines). The file ends with the line
it: Due tabelle sono separate da ''\r\n\r\n'' (cioè due righe vuote). Il file termina con la riga

source: The file does not include uploaded files if these are not stored in the database. The upload files stored on filesystem must be dumped separately, a zip of the “uploads” folder may suffice in most cases.
it: Il file non include i file caricati se questi non sono memorizzati nel database. I file di caricamento memorizzati sul filesystem devono essere scaricati separatamente, uno zip della cartella "uploads" può essere sufficiente nella maggior parte dei casi.

source: When importing, the new records will be appended to the database if it is not empty. In general the new imported records will not have the same record id as the original (saved) records but py4web will restore references so they are not broken, even if the id values may change.
it: Durante l'importazione, i nuovi record verranno aggiunti al database se non è vuoto. In generale, i nuovi record importati non avranno lo stesso id dei record originali (salvati), ma py4web ripristinerà i riferimenti in modo che non siano interrotti, anche se i valori id possono cambiare.

source: If a table contains a field called ``uuid``, this field will be used to identify duplicates. Also, if an imported record has the same ``uuid`` as an existing record, the previous record will be updated.
it: Se una tabella contiene un campo chiamato ''uuid'', questo campo verrà utilizzato per identificare i duplicati. Inoltre, se un record importato ha lo stesso ''uuid'' di un record esistente, il record precedente verrà aggiornato.

source: CSV and remote database synchronization
it: CSV e sincronizzazione remota del database

source: Consider once again the following model:
it: Si consideri ancora una volta il seguente modello:

source: Each record is identified by an identifier and referenced by that id. If you have two copies of the database used by distinct py4web installations, the id is unique only within each database and not across the databases. This is a problem when merging records from different databases.
it: Ogni record è identificato da un identificatore e vi fa riferimento tale id. Se si dispone di due copie del database utilizzate da installazioni py4web distinte, l'id è univoco solo all'interno di ciascun database e non tra i database. Questo è un problema quando si uniscono record di database diversi.

source: In order to make records uniquely identifiable across databases, they must: - have a unique id (UUID), - have a last modification time to track the most recent among multiple copies, - reference the UUID instead of the id.
it: Al fine di rendere i record identificabili in modo univoco tra i database, devono: - avere un ID univoco (UUID), - avere una data dell'ultima modifica per tenere traccia del più recente tra più copie, - fare riferimento all'UUID anziché all'ID.

source: This can be achieved changing the above model into:
it: Ciò può essere ottenuto modificando il modello di cui sopra in:

source: Notice that in the above table definitions, the default value for the two ``uuid`` fields is set to a lambda function, which returns a UUID (converted to a string). The lambda function is called once for each record inserted, ensuring that each record gets a unique UUID, even if multiple records are inserted in a single transaction.
it: Si noti che nelle definizioni della tabella precedente, il valore predefinito per i due campi ''uuid'' è impostato su una funzione lambda, che restituisce un UUID (convertito in una stringa). La funzione lambda viene chiamata una volta per ogni record inserito, assicurando che ogni record ottenga un UUID univoco, anche se più record vengono inseriti in una singola transazione.

source: Create a controller action to export the database:
it: Creare un'azione del controller per esportare il database:

source: Create a controller action to import a saved copy of the other database and sync records:
it: Creare un'azione del controller per importare una copia salvata dell'altro database e sincronizzare i record:

source: Optionally you should create an index manually to make the search by uuid faster.
it: Facoltativamente, è necessario creare manualmente un indice per rendere più veloce la ricerca in base all'uuid.

source: Alternatively, you can use XML-RPC to export/import the file.
it: In alternativa, è possibile utilizzare XML-RPC per esportare/importare il file.

source: If the records reference uploaded files, you also need to export/import the content of the uploads folder. Notice that files therein are already labeled by UUIDs so you do not need to worry about naming conflicts and references.
it: Se i record fanno riferimento a file caricati, è necessario esportare/importare anche il contenuto della cartella dei caricamenti. Si noti che i file in esso contenuti sono già etichettati dagli UUID, quindi non è necessario preoccuparsi di conflitti di denominazione e riferimenti.

source: HTML and XML (one Table at a time)
it: HTML e XML (una tabella alla volta)

source: Rows objects also have an ``xml`` method (like helpers) that serializes it to XML/HTML:
it: Gli oggetti Rows hanno anche un metodo ''xml'' (come gli helper) che li serializza in XML/HTML:

source: If you need to serialize the Rows in any other XML format with custom tags, you can easily do that using the universal :ref:`TAG` helper that we'll see later and the Python syntax ``*<iterable>`` allowed in function calls:
it: Se hai bisogno di serializzare le righe in qualsiasi altro formato XML con tag personalizzati, puoi farlo facilmente usando l'helper universale :ref:'TAG' che vedremo più avanti e la sintassi Python ''*<iterable>'' consentita nelle chiamate di funzione:</iterable>

source: Data representation
it: Rappresentazione dei dati

source: The ``Rows.export_to_csv_file`` method accepts a keyword argument named ``represent``. When ``True`` it will use the columns ``represent`` function while exporting the data instead of the raw data.
it: Il metodo ''Rows.export_to_csv_file'' accetta un argomento di parola chiave chiamato ''represent''. Quando è ''True'' userà la funzione ''represent'' delle colonne durante l'esportazione dei dati invece dei dati grezzi.

source: The function also accepts a keyword argument named ``colnames`` that should contain a list of column names one wish to export. It defaults to all columns.
it: La funzione accetta anche un argomento di parola chiave chiamato ''colnames'' che dovrebbe contenere un elenco di nomi di colonna che si desidera esportare. Il valore predefinito è tutte le colonne.

source: Both ``export_to_csv_file`` and ``import_from_csv_file`` accept keyword arguments that tell the csv parser the format to save/load the files: - ``delimiter``: delimiter to separate values (default ‘,’) - ``quotechar``: character to use to quote string values (default to double quotes) - ``quoting``: quote system (default ``csv.QUOTE_MINIMAL``)
it: Sia ''export_to_csv_file'' che ''import_from_csv_file'' accettano argomenti di parole chiave che indicano al parser csv il formato per salvare/caricare i file: - ''delimitatore'': delimitatore per separare i valori (default ',') - ''quotechar'': carattere da usare per citare i valori delle stringhe (il valore predefinito è quello delle virgolette doppie) - ''quoting'': sistema di virgolette (default ''csv. QUOTE_MINIMAL'')

source: Here is some example usage:
it: Di seguito sono riportati alcuni esempi di utilizzo:

source: Which would render something similar to
it: Il che renderebbe qualcosa di simile a

source: For more information consult the official Python documentation
it: Per maggiori informazioni consulta la documentazione ufficiale di Python

source: Advanced features
it: Funzionalità avanzate

source: ``list:<type>`` and ``contains``
it: ''elenco:<type>'' e ''contiene''</type>

source: py4web provides the following special field types:
it: py4web fornisce i seguenti tipi di campi speciali:

source: They can contain lists of strings, of integers and of references respectively.
it: Possono contenere rispettivamente liste di stringhe, di numeri interi e di riferimenti.

source: On Google App Engine NoSQL ``list:string`` is mapped into ``StringListProperty``, the other two are mapped into ``ListProperty(int)``. On relational databases they are mapped into text fields which contain the list of items separated by ``|``. For example ``[1, 2, 3]`` is mapped into ``|1|2|3|``.
it: Su Google App Engine NoSQL ''list:string'' è mappato in ''StringListProperty'', gli altri due sono mappati in ''ListProperty(int)''. Nei database relazionali sono mappati in campi di testo che contengono l'elenco degli elementi separati da ''|''. Per esempio ''[1, 2, 3]'' è mappato in ''|1|2|3|''.

source: For lists of string the items are escaped so that any ``|`` in the item is replaced by a ``||``. Anyway this is an internal representation and it is transparent to the user.
it: Per gli elenchi di stringhe, gli elementi vengono preceduti da un carattere di escape in modo che qualsiasi ''|'' nell'elemento venga sostituito da un ''||``. In ogni caso si tratta di una rappresentazione interna ed è trasparente per l'utente.

source: You can use ``list:string``, for example, in the following way:
it: Si può usare ''list:string'', per esempio, nel modo seguente:

source: ``list:integer`` works in the same way but the items must be integers.
it: ''list:integer'' funziona allo stesso modo, ma gli elementi devono essere interi.

source: As usual the requirements are enforced at the level of forms, not at the level of ``insert``.
it: Come al solito i requisiti sono applicati a livello di moduli, non a livello di ''inserimento''.

source: For ``list:<type>`` fields the ``contains(value)`` operator maps into a non trivial query that checks for lists containing the ``value``. The ``contains`` operator also works for regular ``string`` and ``text`` fields and it maps into a ``LIKE '%value%'``.
it: Per i campi ''list:<type>'' l'operatore ''contains(value)'' viene mappato in una query non banale che controlla le liste contenenti il ''value''. L'operatore ''contains'' funziona anche per i normali campi ''stringa'' e ''testo'' e viene mappato in un ''LIKE '%value%'''.</type>

source: The ``list:reference`` and the ``contains(value)`` operator are particularly useful to de-normalize many-to-many relations. Here is an example:
it: L'operatore ''list:reference'' e l'operatore ''contains(value)'' sono particolarmente utili per denormalizzare le relazioni molti-a-molti. Ecco un esempio:

source: Notice that a ``list:reference tag`` field get a default constraint
it: Si noti che un campo ''list:reference tag'' ha un vincolo predefinito

source: that produces a ``SELECT/OPTION`` multiple drop-box in forms.
it: che produce una casella a discesa multipla ''SELECT/OPTION'' nei moduli.

source: Also notice that this field gets a default ``represent`` attribute which represents the list of references as a comma-separated list of formatted references. This is used in read ``forms``.
it: Si noti inoltre che questo campo ottiene un attributo predefinito ''represent'' che rappresenta l'elenco dei riferimenti come un elenco separato da virgole di riferimenti formattati. Questo è usato in ''forms'' di lettura.

source: While ``list:reference`` has a default validator and a default representation, ``list:integer`` and ``list:string`` do not. So these two need an ``IS_IN_SET`` or an ``IS_IN_DB`` validator if you want to use them in forms.
it: Mentre ''list:reference'' ha un validatore predefinito e una rappresentazione predefinita, ''list:integer'' e ''list:string'' non lo fanno. Quindi questi due hanno bisogno di un validatore ''IS_IN_SET'' o ''IS_IN_DB'' se vuoi usarli nei moduli.

source: Table inheritance
it: Ereditarietà delle tabelle

source: It is possible to create a table that contains all the fields from another table. It is sufficient to pass the other table in place of a field to ``define_table``. For example
it: È possibile creare una tabella che contiene tutti i campi di un'altra tabella. E' sufficiente passare l'altra tabella al posto di un campo a ''define_table''. Per esempio

source: It is also possible to define a dummy table that is not stored in a database in order to reuse it in multiple other places. For example:
it: È anche possibile definire una tabella fittizia che non è memorizzata in un database per riutilizzarla in più altre posizioni. Per esempio:

source: This example assumes that standard py4web authentication is enabled.
it: In questo esempio si presuppone che l'autenticazione py4web standard sia abilitata.

source: Notice that if you use ``Auth`` py4web already creates one such table for you:
it: Notate che se usate ''Auth'' py4web crea già una di queste tabelle per voi:

source: When using table inheritance, if you want the inheriting table to inherit validators, be sure to define the validators of the parent table before defining the inheriting table.
it: Quando si utilizza l'ereditarietà delle tabelle, se si desidera che la tabella ereditaria erediti i validatori, assicurarsi di definire i validatori della tabella padre prima di definire la tabella ereditaria.

source: ``filter_in`` and ``filter_out``
it: ''filter_in'' e ''filter_out''

source: It is possible to define a filter for each field to be called before a value is inserted into the database for that field and after a value is retrieved from the database.
it: È possibile definire un filtro per ogni campo da chiamare prima che un valore venga inserito nel database per quel campo e dopo che un valore viene recuperato dal database.

source: Imagine for example that you want to store a serializable Python data structure in a field in the JSON format. Here is how it could be accomplished:
it: Si supponga, ad esempio, di voler archiviare una struttura di dati Python serializzabile in un campo in formato JSON. Ecco come potrebbe essere realizzato:

source: Another way to accomplish the same is by using a Field of type ``SQLCustomType``, as discussed in :ref:`Custom Field types`.
it: Un altro modo per ottenere lo stesso risultato è usare un campo di tipo ''SQLCustomType'', come discusso in :ref:'Custom Field types'.

source: callbacks on record insert, delete and update
it: callback per l'inserimento, l'eliminazione e l'aggiornamento dei record

source: PY4WEB provides a mechanism to register callbacks to be called before and/or after insert, update and delete of records.
it: PY4WEB fornisce un meccanismo per registrare callback da chiamare prima e/o dopo l'inserimento, l'aggiornamento e la cancellazione dei record.

source: Each table stores six lists of callbacks:
it: Ogni tabella memorizza sei elenchi di callback:

source: You can register a callback function by appending it to the corresponding list. The caveat is that depending on the functionality, the callback has different signature.
it: È possibile registrare una funzione di callback aggiungendola all'elenco corrispondente. L'avvertenza è che, a seconda della funzionalità, il callback ha una firma diversa.

source: This is best explained by examples.
it: Questo si spiega meglio con degli esempi.

source: As you can see: - ``f`` gets passed the ``OpRow`` object with data for insert or update. - ``i`` gets passed the id of the newly inserted record. - ``s`` gets passed the ``Set`` object used for update or delete. ``OpRow`` is an helper object specialized in storing (field, value) pairs, you can think of it as a normal dictionary that you can use even with the syntax of attribute notation (that is ``f.name`` and ``f['name']`` are equivalent).
it: Come si può vedere: - ''f'' viene passato all'oggetto ''OpRow'' con i dati per l'inserimento o l'aggiornamento. - ''i'' viene passato l'id del record appena inserito. - ''s'' viene passato all'oggetto ''Set'' usato per l'aggiornamento o la cancellazione. ''OpRow'' è un oggetto helper specializzato nella memorizzazione di coppie (campo, valore), puoi pensarlo come un normale dizionario che puoi usare anche con la sintassi della notazione degli attributi (cioè ''f.name'' e ''f['name']'' sono equivalenti).

source: The return values of these callback should be ``None`` or ``False``. If any of the ``_before_*`` callback returns a ``True`` value it will abort the actual insert/update/delete operation.
it: I valori restituiti di questi callback dovrebbero essere ''None'' o ''False''. Se uno qualsiasi dei callback ''_before_*'' restituisce un valore ''True'', interromperà l'operazione di inserimento/aggiornamento/eliminazione effettiva.

source: Some times a callback may need to perform an update in the same or a different table and one wants to avoid firing other callbacks, which could cause an infinite loop.
it: A volte un callback potrebbe dover eseguire un aggiornamento nella stessa tabella o in una tabella diversa e si desidera evitare di attivare altri callback, che potrebbero causare un ciclo infinito.

source: For this purpose there the ``Set`` objects have an ``update_naive`` method that works like ``update`` but ignores before and after callbacks.
it: A questo scopo gli oggetti ''Set'' hanno un metodo ''update_naive'' che funziona come ''update'' ma ignora i callback prima e dopo.

source: Database cascades
it: Cascate di database

source: Database schema can define relationships which trigger deletions of related records, known as cascading. The DAL is not informed when a record is deleted due to a cascade. So no \*_delete callback will ever be called as consequence of a cascade-deletion.
it: Lo schema del database è in grado di definire relazioni che attivano l'eliminazione di record correlati, nota come propagazione a cascata. Il DAL non viene informato quando un record viene eliminato a causa di una propagazione. Quindi nessun \*_delete callback verrà mai chiamato come conseguenza di una cancellazione a cascata.

source: Record versioning
it: Controllo delle versioni dei record

source: It is possible to ask py4web to save every copy of a record when the record is individually modified. There are different ways to do it and it can be done for all tables at once using the syntax:
it: E' possibile chiedere a py4web di salvare ogni copia di un record quando il record viene modificato singolarmente. Ci sono diversi modi per farlo e può essere fatto per tutte le tabelle contemporaneamente usando la sintassi:

source: this requires ``Auth``. It can also be done for each individual table as discussed below.
it: questo richiede ''Auth''. Può anche essere fatto per ogni singola tabella, come discusso di seguito.

source: Consider the following table:
it: Si consideri la tabella seguente:

source: Notice the hidden boolean field called ``is_active`` and defaulting to True.
it: Si noti il campo booleano nascosto chiamato ''is_active'' e il valore predefinito è True.

source: We can tell py4web to create a new table (in the same or a different database) and store all previous versions of each record in the table, when modified.
it: Possiamo dire a py4web di creare una nuova tabella (nello stesso database o in un database diverso) e memorizzare tutte le versioni precedenti di ogni record nella tabella, quando modificato.

source: This is done in the following way:
it: Questa operazione viene eseguita nel modo seguente:

source: or in a more verbose syntax:
it: o in una sintassi più dettagliata:

source: The ``archive_db=db`` tells py4web to store the archive table in the same database as the ``stored_item`` table. The ``archive_name`` sets the name for the archive table. The archive table has the same fields as the original table ``stored_item`` except that unique fields are no longer unique (because it needs to store multiple versions) and has an extra field which name is specified by ``current_record`` and which is a reference to the current record in the ``stored_item`` table.
it: ''archive_db=db'' dice a py4web di memorizzare la tabella di archivio nello stesso database della tabella ''stored_item''. ''archive_name'' imposta il nome per la tabella di archiviazione. La tabella dell'archivio ha gli stessi campi della tabella originale ''stored_item'', tranne per il fatto che i campi univoci non sono più univoci (perché deve memorizzare più versioni) e ha un campo aggiuntivo il cui nome è specificato da ''current_record'' e che è un riferimento al record corrente nella tabella ''stored_item''.
