Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: ``placeholders`` is an optional sequence of values to be substituted in or, if supported by the DB driver, a dictionary with keys matching named placeholders in your SQL.
it: ''placeholders'' è una sequenza opzionale di valori da sostituire o, se supportato dal driver DB, un dizionario con chiavi corrispondenti ai segnaposto nominati nel tuo SQL.

source: If ``as_dict`` is set to True, the results cursor returned by the DB driver will be converted to a sequence of dictionaries keyed with the db field names. Results returned with ``as_dict = True`` are the same as those returned when applying as_list() to a normal select:
it: Se ''as_dict'' è impostato su True, il cursore dei risultati restituito dal driver DB verrà convertito in una sequenza di dizionari digitati con i nomi dei campi db. I risultati restituiti con ''as_dict = True'' sono gli stessi di quelli restituiti quando si applica as_list() ad una selezione normale:

source: ``as_ordered_dict`` is pretty much like ``as_dict`` but the former ensures that the order of resulting fields (OrderedDict keys) reflect the order on which they are returned from DB driver:
it: ''as_ordered_dict'' è molto simile a ''as_dict'', ma il primo assicura che l'ordine dei campi risultanti (chiavi OrderedDict) rifletta l'ordine in cui vengono restituiti dal driver DB:

source: The ``fields`` argument is a list of DAL Field objects that match the fields returned from the DB. The Field objects should be part of one or more Table objects defined on the DAL object. The ``fields`` list can include one or more DAL Table objects in addition to or instead of including Field objects, or it can be just a single table (not in a list). In that case, the Field objects will be extracted from the table(s).
it: L'argomento ''fields'' è un elenco di oggetti DAL Field che corrispondono ai campi restituiti dal DB. Gli oggetti Field devono far parte di uno o più oggetti Table definiti nell'oggetto DAL. L'elenco ''fields'' può includere uno o più oggetti DAL Table in aggiunta o al posto di includere oggetti Field, oppure può essere solo una singola tabella (non in una lista). In tal caso, gli oggetti Field verranno estratti dalle tabelle.

source: Instead of specifying the ``fields`` argument, the ``colnames`` argument can be specified as a list of field names in tablename.fieldname format. Again, these should represent tables and fields defined on the DAL object.
it: Invece di specificare l'argomento ''fields'', l'argomento ''colnames'' può essere specificato come un elenco di nomi di campo nel formato nometabella.nomecampo. Anche in questo caso, questi devono rappresentare tabelle e campi definiti nell'oggetto DAL.

source: It is also possible to specify both ``fields`` and the associated ``colnames``. In that case, ``fields`` can also include DAL Expression objects in addition to Field objects. For Field objects in “fields”, the associated ``colnames`` must still be in tablename.fieldname format. For Expression objects in ``fields``, the associated ``colnames`` can be any arbitrary labels.
it: E' anche possibile specificare sia i ''campi'' che i ''colnames'' associati. In tal caso, ''fields'' può includere anche oggetti DAL Expression oltre agli oggetti Field. Per gli oggetti Campo in "campi", i ''nomicol'' associati devono essere ancora nel formato nometabella.nomecampo. Per gli oggetti Expression in ''fields'', i ''colnames'' associati possono essere qualsiasi etichetta arbitraria.

source: Notice, the DAL Table objects referred to by ``fields`` or ``colnames`` can be dummy tables and do not have to represent any real tables in the database. Also, note that the ``fields`` and ``colnames`` must be in the same order as the fields in the results cursor returned from the DB.
it: Si noti che gli oggetti DAL Table a cui si fa riferimento con ''fields'' o ''colnames'' possono essere tabelle fittizie e non devono rappresentare alcuna tabella reale nel database. Inoltre, si noti che i ''campi'' e i ''colnames'' devono essere nello stesso ordine dei campi nel cursore dei risultati restituito dal DB.

source: Whether SQL was executed manually using executesql or was SQL generated by the DAL, you can always find the SQL code in ``db._lastsql``. This is useful for debugging purposes:
it: Sia che SQL sia stato eseguito manualmente usando executesql o che sia stato generato dal DAL, è sempre possibile trovare il codice SQL in ''db._lastsql''. Ciò è utile a scopo di debug:

source: py4web never generates queries using the “*” operator. py4web is always explicit when selecting fields.
it: py4web non genera mai query utilizzando l'operatore "*". py4web è sempre esplicito quando si selezionano i campi.

source: Timing queries
it: Query di temporizzazione

source: All queries are automatically timed by py4web. The variable ``db._timings`` is a list of tuples. Each tuple contains the raw SQL query as passed to the database driver and the time it took to execute in seconds.
it: Tutte le query sono temporizzate automaticamente da py4web. La variabile ''db._timings'' è una lista di tuple. Ogni tupla contiene la query SQL non elaborata passata al driver di database e il tempo necessario per l'esecuzione in secondi.

source: Indexes
it: Indici

source: Currently the DAL API does not provide a command to create indexes on tables, but this can be done using the ``executesql`` command. This is because the existence of indexes can make migrations complex, and it is better to deal with them explicitly. Indexes may be needed for those fields that are used in recurrent queries.
it: Attualmente l'API DAL non fornisce un comando per creare indici sulle tabelle, ma questo può essere fatto usando il comando ''executesql''. Ciò è dovuto al fatto che l'esistenza di indici può rendere complesse le migrazioni ed è meglio gestirle in modo esplicito. Gli indici possono essere necessari per i campi utilizzati nelle query ricorrenti.

source: Here is an example of how to:
it: Di seguito è riportato un esempio di come:

source: Other database dialects have very similar syntaxes but may not support the optional “IF NOT EXISTS” directive.
it: Altri dialetti di database hanno sintassi molto simili, ma potrebbero non supportare la direttiva facoltativa "IF NOT EXISTS".

source: Generating raw SQL
it: Generazione di SQL non elaborato

source: Sometimes you need to generate the SQL but not execute it. This is easy to do with py4web since every command that performs database IO has an equivalent command that does not, and simply returns the SQL that would have been executed. These commands have the same names and syntax as the functional ones, but they start with an underscore:
it: A volte è necessario generare l'SQL ma non eseguirlo. Questa operazione è facile da eseguire con py4web poiché ogni comando che esegue l'I/O del database ha un comando equivalente che non lo fa e restituisce semplicemente l'SQL che sarebbe stato eseguito. Questi comandi hanno gli stessi nomi e la stessa sintassi di quelli funzionali, ma iniziano con un carattere di sottolineatura:

source: Here is ``_insert``
it: Ecco ''_insert''

source: Here is ``_count``
it: Ecco ''_count''

source: Here is ``_select``
it: Ecco ''_select''

source: Here is ``_delete``
it: Ecco ''_delete''

source: And finally, here is ``_update``
it: E infine, ecco ''_update''

source: Moreover you can always use ``db._lastsql`` to return the most recent SQL code, whether it was executed manually using executesql or was SQL generated by the DAL.
it: Inoltre è sempre possibile utilizzare ''db._lastsql'' per restituire il codice SQL più recente, sia che sia stato eseguito manualmente utilizzando executesql sia che sia stato generato da SQL dal DAL.

source: ``select`` command
it: Comando ''select''

source: Given a Set, ``s``, you can fetch the records with the command ``select``:
it: Dato un Set, ''s'', è possibile recuperare i record con il comando ''select'':

source: It returns an iterable object of class ``pydal.objects.Rows`` whose elements are Row objects. ``pydal.objects.Row`` objects act like dictionaries, but their elements can also be accessed as attributes. The former differ from the latter because its values are read-only.
it: Restituisce un oggetto iterabile della classe ''pydal.objects.Rows'' i cui elementi sono oggetti Row. Gli oggetti ''pydal.objects.Row'' agiscono come dizionari, ma è possibile accedere ai loro elementi anche come attributi. Il primo differisce dal secondo perché i suoi valori sono di sola lettura.

source: The Rows object allows looping over the result of the select and printing the selected field values for each row:
it: L'oggetto Righe consente di eseguire il ciclo sul risultato della selezione e di stampare i valori dei campi selezionati per ogni riga:

source: You can do all the steps in one statement:
it: È possibile eseguire tutti i passaggi in un'unica istruzione:

source: The select command can take arguments. All unnamed arguments are interpreted as the names of the fields that you want to fetch. For example, you can be explicit on fetching field “id” and field “name”:
it: Il comando select può accettare argomenti. Tutti gli argomenti senza nome vengono interpretati come nomi dei campi che si desidera recuperare. Ad esempio, puoi essere esplicito sul recupero del campo "id" e del campo "name":

source: The table attribute ALL allows you to specify all fields:
it: L'attributo table ALL consente di specificare tutti i campi:

source: Notice that there is no query string passed to db. py4web understands that if you want all fields of the table person without additional information then you want all records of the table person.
it: Si noti che non è presente alcuna stringa di query passata a db. py4web capisce che se si desidera che tutti i campi della persona della tabella non siano informazioni aggiuntive, allora si desidera che tutti i record della persona della tabella.

source: An equivalent alternative syntax is the following:
it: Una sintassi alternativa equivalente è la seguente:

source: and py4web understands that if you ask for all records of the table person without additional information, then you want all the fields of table person.
it: E py4web capisce che se chiedi tutti i record della persona del tavolo senza informazioni aggiuntive, allora vuoi tutti i campi della persona del tavolo.

source: Given one row
it: Data una riga

source: you can extract its values using multiple equivalent expressions:
it: È possibile estrarne i valori utilizzando più espressioni equivalenti:

source: The latter syntax is particularly handy when selecting an expression instead of a column. We will show this later.
it: Quest'ultima sintassi è particolarmente utile quando si seleziona un'espressione anziché una colonna. Lo mostreremo più avanti.

source: You can also do
it: Puoi anche fare

source: to disable the notation
it: Per disabilitare la notazione

source: and enable, instead, the less compact notation:
it: e abilitare, invece, la notazione meno compatta:

source: Yes this is unusual and rarely needed.
it: Sì, questo è insolito e raramente necessario.

source: Row objects also have two important methods:
it: Gli oggetti riga hanno anche due metodi importanti:

source: and
it: e

source: Using an iterator-based select for lower memory use
it: Uso di una selezione basata su iteratore per un utilizzo inferiore della memoria

source: Python “iterators” are a type of “lazy-evaluation”. They ‘feed’ data one step at time; traditional Python loops create the entire set of data in memory before looping.
it: Gli "iteratori" di Python sono un tipo di "valutazione pigra". "Alimentano" i dati un passo alla volta; I cicli Python tradizionali creano l'intero set di dati in memoria prima del ciclo.

source: The traditional use of select is:
it: L'uso tradizionale di select è:

source: but for large numbers of rows, using an iterator-based alternative has dramatically lower memory use:
it: Tuttavia, per un numero elevato di righe, l'uso di un'alternativa basata su iteratore riduce notevolmente l'utilizzo della memoria:

source: Testing shows this is around 10% faster as well, even on machines with large RAM.
it: I test mostrano che anche questo è di circa 10% faster, anche su macchine con RAM di grandi dimensioni.

source: Rendering rows using represent
it: Rendering delle righe con represent

source: You may wish to rewrite rows returned by select to take advantage of formatting information contained in the represents setting of the fields.
it: È possibile riscrivere le righe restituite da select per sfruttare le informazioni di formattazione contenute nell'impostazione represents dei campi.

source: If you don’t specify an index, you get a generator to iterate over all the rows:
it: Se non si specifica un indice, si ottiene un generatore per eseguire l'iterazione su tutte le righe:

source: Can also be applied to slices:
it: Può essere applicato anche alle fette:

source: If you only want to transform selected fields via their “represent” attribute, you can list them in the “fields” argument:
it: Se si desidera trasformare i campi selezionati solo tramite il loro attributo "represent", è possibile elencarli nell'argomento "fields":

source: Note, it returns a transformed copy of the original Row, so there’s no update_record (which you wouldn't want anyway) or delete_record.
it: Si noti che restituisce una copia trasformata della riga originale, quindi non c'è update_record (che comunque non vorresti) o delete_record.

source: Shortcuts
it: Scelte rapide

source: The DAL supports various code-simplifying shortcuts. In particular:
it: Il DAL supporta varie scorciatoie che semplificano il codice. Soprattutto:

source: returns the record with the given ``id`` if it exists. If the ``id`` does not exist, it returns ``None``. The above statement is equivalent to
it: Restituisce il record con l''''ID'' dato, se esiste. Se l''id'' non esiste, restituisce ''None''. L'affermazione di cui sopra equivale a

source: You can delete records by id:
it: È possibile eliminare i record in base all'ID:

source: and this is equivalent to
it: e questo equivale a

source: and deletes the record with the given ``id``, if it exists.
it: e cancella il record con l''''id'' dato, se esiste.

source: Note: this delete shortcut syntax does not currently work if *versioning* is activated
it: Nota: questa sintassi di eliminazione della scorciatoia non funziona attualmente se è attivato il *versioning*

source: You can insert records:
it: È possibile inserire record:

source: It is equivalent to
it: Equivale a

source: and it creates a new record with field values specified by the dictionary on the right hand side.
it: e crea un nuovo record con i valori dei campi specificati dal dizionario sul lato destro.

source: Note: insert shortcut was previously ``db.table[0] = ...``. It has changed in pyDAL 19.02 to permit normal usage of id 0.
it: Nota: la scorciatoia per l'inserimento era in precedenza ''db.table[0] = ...''. È stato modificato in pyDAL 19.02 per consentire il normale utilizzo di id 0.

source: You can update records:
it: È possibile aggiornare i record:

source: which is equivalent to
it: che è equivalente a

source: and it updates an existing record with field values specified by the dictionary on the right hand side.
it: e aggiorna un record esistente con i valori dei campi specificati dal dizionario sul lato destro.

source: Fetching a ``Row``
it: Recuperare una ''riga''

source: Yet another convenient syntax is the following:
it: Un'altra sintassi utile è la seguente:

source: Apparently similar to ``db.mytable[id]`` the above syntax is more flexible and safer. First of all it checks whether ``id`` is an int (or ``str(id)`` is an int) and returns ``None`` if not (it never raises an exception). It also allows to specify multiple conditions that the record must meet. If they are not met, it also returns ``None``.
it: Apparentemente simile a ''db.mytable[id]'', la sintassi di cui sopra è più flessibile e sicura. Prima di tutto controlla se ''id'' è un int (o ''str(id)'' è un int) e restituisce ''None'' in caso contrario (non solleva mai un'eccezione). Consente inoltre di specificare più condizioni che il record deve soddisfare. Se non vengono soddisfatti, restituisce anche ''Nessuno''.

source: Recursive ``select``\ s
it: Ricorsivo ''select''\ s

source: Consider the previous table person and a new table “thing” referencing a “person”:
it: Si consideri la persona della tabella precedente e una nuova "cosa" della tabella che fa riferimento a una "persona":

source: and a simple select from this table:
it: e una semplice selezione da questa tabella:

source: where ``_id`` is a reference to the primary key of the table. Normally ``db.thing._id`` is the same as ``db.thing.id`` and we will assume that in most of this book.
it: dove ''_id'' è un riferimento alla chiave primaria della tabella. Normalmente ''db.thing._id'' è la stessa cosa di ''db.thing.id'' e lo assumeremo nella maggior parte di questo libro.

source: For each Row of things it is possible to fetch not just fields from the selected table (thing) but also from linked tables (recursively):
it: Per ogni Riga di cose è possibile prelevare non solo i campi dalla tabella selezionata (cosa) ma anche dalle tabelle collegate (ricorsivamente):

source: Here ``thing.owner_id.name`` requires one database select for each thing in things and it is therefore inefficient. We suggest using joins whenever possible instead of recursive selects, nevertheless this is convenient and practical when accessing individual records.
it: Qui ''thing.owner_id.name'' richiede una selezione del database per ogni cosa nelle cose ed è quindi inefficiente. Si consiglia di utilizzare i join quando possibile invece delle selezioni ricorsive, tuttavia questo è comodo e pratico quando si accede ai singoli record.

source: You can also do it backwards, by selecting the things referenced by a person:
it: Puoi anche farlo a ritroso, selezionando le cose a cui fa riferimento una persona:

source: In this last expression ``person.thing`` is a shortcut for
it: In quest'ultima espressione ''persona.cosa'' è una scorciatoia per

source: i.e. the Set of ``thing``\ s referenced by the current ``person``. This syntax breaks down if the referencing table has multiple references to the referenced table. In this case one needs to be more explicit and use a full Query.
it: cioè l'insieme di ''cose'' a cui fa riferimento la ''persona'' corrente. Questa sintassi viene interrotta se la tabella di riferimento contiene più riferimenti alla tabella a cui si fa riferimento. In questo caso è necessario essere più espliciti e utilizzare una query completa.

source: The ``select`` command takes a number of optional arguments.
it: Il comando ''select'' accetta un certo numero di argomenti opzionali.

source: orderby
it: ordina per

source: You can fetch the records sorted by name:
it: È possibile recuperare i record ordinati per nome:

source: You can fetch the records sorted by name in reverse order (notice the tilde):
it: È possibile recuperare i record ordinati per nome in ordine inverso (notare la tilde):

source: You can have the fetched records appear in random order:
it: È possibile fare in modo che i record recuperati vengano visualizzati in ordine casuale:

source: The use of ``orderby='<random>'`` is not supported on Google NoSQL. However, to overcome this limit, sorting can be accomplished on selected rows:
it: L'uso di ''orderby='<random>''' non è supportato su Google NoSQL. Tuttavia, per superare questo limite, l'ordinamento può essere eseguito su righe selezionate:</random>

source: You can sort the records according to multiple fields by concatenating them with a “\|”:
it: È possibile ordinare i record in base a più campi concatenandoli con un "\|":

source: groupby, having
it: groupby, avendo

source: Using ``groupby`` together with ``orderby``, you can group records with the same value for the specified field (this is back-end specific, and is not on the Google NoSQL):
it: Usando ''groupby'' insieme a ''orderby'', puoi raggruppare i record con lo stesso valore per il campo specificato (questo è specifico del back-end e non è su Google NoSQL):

source: You can use ``having`` in conjunction with ``groupby`` to group conditionally (only those ``having`` the condition are grouped).
it: Si può usare ''avere'' in congiunzione con ''groupby'' per raggruppare in modo condizionale (solo quelli che ''hanno'' la condizione sono raggruppati).

source: Notice that query1 filters records to be displayed, query2 filters records to be grouped.
it: Si noti che query1 filtra i record da visualizzare, query2 filtra i record da raggruppare.

source: distinct
it: distinto

source: With the argument ``distinct=True``, you can specify that you only want to select distinct records. This has the same effect as grouping using all specified fields except that it does not require sorting. When using distinct it is important not to select ALL fields, and in particular not to select the “id” field, else all records will always be distinct.
it: Con l'argomento ''distinct=True'', è possibile specificare che si desidera selezionare solo record distinti. Questo ha lo stesso effetto del raggruppamento utilizzando tutti i campi specificati, tranne per il fatto che non richiede l'ordinamento. Quando si utilizza distinct è importante non selezionare TUTTI i campi, e in particolare non selezionare il campo "id", altrimenti tutti i record saranno sempre distinti.

source: Here is an example:
it: Ecco un esempio:

source: Notice that ``distinct`` can also be an expression, for example:
it: Si noti che ''distinct'' può anche essere un'espressione, per esempio:

source: limitby
it: limitdi

source: With ``limitby=(min, max)``, you can select a subset of the records from offset=min to but not including offset=max. In the next example we select the first two records starting at zero:
it: Con ''limitby=(min, max)'', è possibile selezionare un sottoinsieme dei record da offset=min a ma non include offset=max. Nell'esempio seguente selezioniamo i primi due record a partire da zero:

source: Note that the DAL defaults to implicitly adding an orderby when using a limitby. This ensures the same query returns the same results each time, important for pagination. But it can cause performance problems. use ``orderby_on_limitby = False`` to change this (this defaults to True).
it: Si noti che per impostazione predefinita il DAL aggiunge in modo implicito un orderby quando si utilizza un limitby. In questo modo si garantisce che la stessa query restituisca ogni volta gli stessi risultati, importante per l'impaginazione. Ma può causare problemi di prestazioni. usa ''orderby_on_limitby = False'' per cambiarlo (il valore predefinito è True).

source: join, left
it: Unisci, a sinistra

source: These are involved in managing `One to many relation`_. They are described in `Inner join`_ and `Left outer join`_ sections respectively.
it: Questi sono coinvolti nella gestione della "relazione uno-a-molti". Sono descritti rispettivamente nelle sezioni 'Inner join'_ e 'Left outer join'_.

source: cache, cacheable
it: cache, memorizzabile nella cache

source: An example use which gives much faster selects is:
it: Un esempio di utilizzo che dà selezioni molto più veloci è:

source: Look at `Caching selects`_, to understand what the trade-offs are.
it: Dai un'occhiata a 'Caching selects'_, per capire quali sono i compromessi.

source: Logical operators
it: Operatori logici

source: Queries can be combined using the binary AND operator “``&``”:
it: Le query possono essere combinate utilizzando l'operatore binario AND "''&''":

source: and the binary OR operator “``|``”:
it: e l'operatore binario OR "''|''":
