Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-12.po
Languages: it

source: This is the recommended syntax. The key must be a unique string associated with the database used. The key can never be changed. If you lose the key, the previously hashed values become useless. By default, CRYPT uses random salt, such that each result is different. To use a constant salt value, specify its value:
it: Questa è la sintassi consigliata. La chiave deve essere una stringa univoca associata al database utilizzato. La chiave non può mai essere cambiata. Se si perde la chiave, i valori hash precedentemente sottoposti a hash diventano inutili. Per impostazione predefinita, CRYPT utilizza salt casuale, in modo che ogni risultato sia diverso. Per utilizzare un valore salt costante, specificarne il valore:

source: Or, to use no salt:
it: Oppure, per non usare sale:

source: The CRYPT validator hashes its input, and this makes it somewhat special. If you need to validate a password field before it is hashed, you can use CRYPT in a list of validators, but must make sure it is the last of the list, so that it is called last. For example:
it: Il validatore CRYPT esegue l'hashing del suo input e questo lo rende in qualche modo speciale. Se è necessario convalidare un campo password prima che venga eseguito l'hashing, è possibile utilizzare CRYPT in un elenco di validatori, ma è necessario assicurarsi che sia l'ultimo dell'elenco, in modo che venga chiamato per ultimo. Per esempio:

source: ``CRYPT`` also takes a ``min_length`` argument, which defaults to zero.
it: ''CRYPT'' accetta anche un argomento ''min_length'', che per impostazione predefinita è zero.

source: The resulting hash takes the form ``alg$salt$hash``, where ``alg`` is the hash algorithm used, ``salt`` is the salt string (which can be empty), and ``hash`` is the algorithm's output. Consequently, the hash is self-identifying, allowing, for example, the algorithm to be changed without invalidating previous hashes. The key, however, must remain the same.
it: L'hash risultante assume la forma ''alg$salt$hash'', dove ''alg'' è l'algoritmo hash usato, ''salt'' è la stringa salt (che può essere vuota) e ''hash'' è l'output dell'algoritmo. Di conseguenza, l'hash si auto-identifica, consentendo, ad esempio, di modificare l'algoritmo senza invalidare gli hash precedenti. La chiave, tuttavia, deve rimanere la stessa.

source: Special type validators
it: Validatori di tipi speciali

source: This validator helps you to ensure length limits on values of type list, for this purpose use its ``minimum``, ``maximum``, and ``error_message`` arguments, for example:
it: Questo validatore ti aiuta a garantire limiti di lunghezza sui valori di tipo list, a questo scopo usa i suoi argomenti ''minimum'', ''maximum'' e ''error_message'', per esempio:

source: A list value may comes from a form containing multiple fields with the same name or a multiple selection box. Note that this validator automatically converts a non-list value into a single valued list:
it: Un valore di elenco può provenire da un modulo contenente più campi con lo stesso nome o da una casella di selezione multipla. Si noti che questo validatore converte automaticamente un valore non di elenco in un elenco a valori singolo:

source: If the first argument of IS_LIST_OF is another validator, then it applies the other validator to each element of the list. A typical usage is validation of a ``list:`` type field, for example:
it: Se il primo argomento di IS_LIST_OF è un altro validatore, allora applica l'altro validatore a ogni elemento della lista. Un uso tipico è la convalida di un campo di tipo ''list:'', per esempio:

source: This validator is specifically designed to work with the following field:
it: Questo validatore è specificamente progettato per funzionare con il seguente campo:

source: Notice that due to the ``widget`` customization this field will be rendered by a textarea in SQLFORMs (see next [[Widgets #Widgets]] section). This let you insert and edit multiple emails in a single input field (very much like normal mail client programs do), separating each email address with ``,``, ``;``, and blanks (space, newline, and tab characters). As a consequence now we need a validator which is able to operate on a single value input and a way to split the validated value into a list to be next processed by DAL, these are what the ``requires`` and ``filter_in`` arguments stand for. As alternative to ``filter_in``, you can pass the following function to the ``onvalidation`` argument of form ``accepts``, ``process``, or ``validate`` method:
it: Si noti che, a causa della personalizzazione del ''widget'', questo campo sarà reso da un'area di testo in SQLFORMs (vedere la prossima sezione [[Widgets #Widgets]]). Ciò consente di inserire e modificare più e-mail in un singolo campo di input (in modo molto simile ai normali programmi client di posta), separando ogni indirizzo e-mail con '','', '';'' e spazi vuoti (spazio, nuova riga e caratteri di tabulazione). Di conseguenza ora abbiamo bisogno di un validatore che sia in grado di operare su un singolo valore in ingresso e di un modo per dividere il valore convalidato in una lista che verrà successivamente elaborata da DAL, questi sono ciò che gli argomenti ''requires'' e ''filter_in'' rappresentano. In alternativa a ''filter_in'', è possibile passare la seguente funzione all'argomento ''onvalidation'' del metodo ''accepts'', ''process'' o ''validate'':

source: The effect of the ``represent`` argument (at lines 6 and 7) is to add a "mailto:..." link to each email address when the record is rendered in HTML pages.
it: L'effetto dell'argomento ''represent'' (alle righe 6 e 7) è quello di aggiungere un ''mailto:..." collegamento a ciascun indirizzo e-mail quando il record viene visualizzato nelle pagine HTML.

source: This validator takes a list of validators and accepts a value if any of the validators in the list does (i.e. it acts like a logical OR with respect to given validators).
it: Questo validatore prende una lista di validatori e accetta un valore se uno qualsiasi dei validatori nella lista lo fa (cioè agisce come un OR logico rispetto a determinati validatori).

source: When none of the validators accepts the value you get the error message form the last attempted one (the last in the list), you can customize the error message as usual:
it: Quando nessuno dei validatori accetta il valore, si ottiene il messaggio di errore dall'ultimo tentativo (l'ultimo della lista), è possibile personalizzare il messaggio di errore come di consueto:

source: This validator checks if a file uploaded through the file input was saved in one of the selected image formats and has dimensions (width and height) within given limits.
it: Questo validatore controlla se un file caricato tramite l'input del file è stato salvato in uno dei formati di immagine selezionati e ha dimensioni (larghezza e altezza) entro determinati limiti.

source: It does not check for maximum file size (use IS_LENGTH for that). It returns a validation failure if no data was uploaded. It supports the file formats BMP, GIF, JPEG, PNG, and it does not require the Python Imaging Library.
it: Non controlla la dimensione massima del file (usa IS_LENGTH per questo). Restituisce un errore di convalida se non è stato caricato alcun dato. Supporta i formati di file BMP, GIF, JPEG, PNG e non richiede la libreria di immagini Python.

source: Code parts taken from ref.``source1``:cite
it: Parti di codice prese da ref.''source1'':cite

source: It takes the following arguments: - extensions: iterable containing allowed image file extensions in lowercase - maxsize: iterable containing maximum width and height of the image - minsize: iterable containing minimum width and height of the image
it: Accetta i seguenti argomenti: - extensions: iterable contenente le estensioni di file immagine consentite in minuscolo - maxsize: iterabile contenente la larghezza e l'altezza massime dell'immagine - minsize: iterabile contenente la larghezza e l'altezza minime dell'immagine

source: Use (-1, -1) as minsize to bypass the image-size check.
it: Usa (-1, -1) come minsize per bypassare il controllo della dimensione dell'immagine.

source: Here are some Examples: - Check if uploaded file is in any of supported image formats:
it: Ecco alcuni esempi: - Controlla se il file caricato è in uno dei formati di immagine supportati:

source: Check if uploaded file is either JPEG or PNG:
it: Controlla se il file caricato è JPEG o PNG:

source: Check if uploaded file is PNG with maximum size of 200x200 pixels:
it: Controlla se il file caricato è PNG con una dimensione massima di 200x200 pixel:

source: Note: on displaying an edit form for a table including ``requires = IS_IMAGE()``, a ``delete`` checkbox will NOT appear because to delete the file would cause the validation to fail. To display the ``delete`` checkbox use this validation:
it: Nota: quando si visualizza un modulo di modifica per una tabella che include ''requires = IS_IMAGE()'', una casella di controllo ''delete'' NON apparirà perché l'eliminazione del file causerebbe il fallimento della convalida. Per visualizzare la casella di controllo ''elimina'' utilizzare questa convalida:

source: Checks if name and extension of file uploaded through file input matches given criteria.
it: Controlla se il nome e l'estensione del file caricato tramite l'input del file corrispondono ai criteri specificati.

source: Does *not* ensure the file type in any way. Returns validation failure if no data was uploaded.
it: *non* garantisce il tipo di file in alcun modo. Restituisce un errore di convalida se non è stato caricato alcun dato.

source: filename: string/compiled regex or a list of strings/regex of valid filenames
it: filename: stringa/regex compilata o un elenco di stringhe/regex di nomi di file validi

source: extension: string/compiled regex or a list of strings/regex of valid extensions
it: extension: stringa/regex compilata o un elenco di stringhe/regex di estensioni valide

source: lastdot: which dot should be used as a filename / extension separator: ``True`` indicates last dot (e.g., "file.tar.gz" will be broken in "file.tar" + "gz") while ``False`` means first dot (e.g., "file.tar.gz" will be broken into "file" + "tar.gz").
it: lastdot: quale punto dovrebbe essere usato come separatore di nome file / estensione: ''True'' indica l'ultimo punto (ad esempio, "file.tar.gz" sarà interrotto in "file.tar" + "gz") mentre ''False'' significa il primo punto (ad esempio, "file.tar.gz" sarà suddiviso in "file" + "tar.gz").

source: case: 0 means keep the case; 1 means transform the string into lowercase (default); 2 means transform the string into uppercase.
it: caso: 0 significa tenere il caso; 1 significa trasformare la stringa in minuscolo (default); 2 significa trasformare la stringa in maiuscolo.

source: If there is no dot present, extension checks will be done against empty string and filename checks against whole value.
it: Se non è presente alcun punto, i controlli dell'estensione verranno eseguiti sulla stringa vuota e i controlli del nome del file sul valore intero.

source: Examples: Check if file has a pdf extension (case insensitive):
it: Esempi: Controlla se il file ha un'estensione pdf (senza distinzione tra maiuscole e minuscole):

source: Check if file is called 'thumbnail' and has a jpg or png extension (case insensitive):
it: Controlla se il file si chiama 'miniatura' e ha un'estensione jpg o png (senza distinzione tra maiuscole e minuscole):

source: Check if file has a tar.gz extension and name starting with backup:
it: Controlla se il file ha un'estensione tar.gz e un nome che inizia con backup:

source: Check if file has no extension and name matching README (case sensitive):
it: Controlla se il file non ha estensione e nome corrispondenti al file README (con distinzione tra maiuscole e minuscole):

source: This is the older implementation for checking files, included for backwards compatibility. For new applications, use ``IS_FILE()``.
it: Questa è l'implementazione precedente per il controllo dei file, inclusa per la compatibilità con le versioni precedenti. Per le nuove applicazioni, usare ''IS_FILE()''.

source: This validator checks if the name and extension of a file uploaded through the file input matches the given criteria.
it: Questo validatore controlla se il nome e l'estensione di un file caricato tramite l'input del file corrispondono ai criteri specificati.

source: It does not ensure the file type in any way. Returns validation failure if no data was uploaded.
it: Non garantisce in alcun modo il tipo di file. Restituisce un errore di convalida se non è stato caricato alcun dato.

source: filename: filename (before dot) regex.
it: filename: regex del nome del file (prima del punto).

source: extension: extension (after dot) regex.
it: Estensione: estensione (dopo il punto) regex.

source: If there is no dot present, extension checks will be done against an empty string and filename checks will be done against the whole value.
it: Se non è presente alcun punto, i controlli dell'estensione verranno eseguiti su una stringa vuota e i controlli del nome del file verranno eseguiti sull'intero valore.

source: Check if file has a pdf extension (case insensitive):
it: Controlla se il file ha un'estensione pdf (senza distinzione tra maiuscole e minuscole):

source: This validator checks if a field's value is an IP version 4 address in decimal form. Can be set to force addresses from a certain range.
it: Questo validatore controlla se il valore di un campo è un indirizzo IP versione 4 in formato decimale. Può essere impostato per forzare gli indirizzi da un determinato intervallo.

source: IPv4 regex taken from ``regexlib``. The signature for the ``IS_IPV4`` constructor is the following:
it: Regex IPv4 presa da ''regexlib''. La firma per il costruttore ''IS_IPV4'' è la seguente:

source: ``minip`` is the lowest allowed address
it: ''minip'' è l'indirizzo più basso consentito

source: ``maxip`` is the highest allowed address
it: ''maxip'' è l'indirizzo più alto consentito

source: ``invert`` is a flag to invert allowed address range, i.e. if set to True allows addresses only from outside of given range; note that range boundaries are not matched this way
it: ''invert'' è un flag per invertire l'intervallo di indirizzi consentito, cioè se impostato a True permette gli indirizzi solo dall'esterno di un dato intervallo; Si noti che i limiti dell'intervallo non corrispondono in questo modo

source: You can pass an IP address either as a string (e.g. '192.168.0.1') or as a list or tuple of 4 integers (e.g. [192, 168, 0, 1]).
it: È possibile passare un indirizzo IP come stringa (ad esempio '192.168.0.1') o come elenco o tupla di 4 numeri interi (ad esempio [192, 168, 0, 1]).

source: To check for multiple address ranges pass to ``minip`` and ``maxip`` a list or tuple of boundary addresses, for example to allow only addresses between '192.168.20.10' and '192.168.20.19' or between '192.168.30.100' and '192.168.30.199' use:
it: Per verificare la presenza di più intervalli di indirizzi, passare a ''minip'' e ''maxip'' una lista o una tupla di indirizzi di confine, ad esempio per consentire solo gli indirizzi compresi tra '192.168.20.10' e '192.168.20.19' o tra '192.168.30.100' e '192.168.30.199' usare:

source: **Notice** that only a range for which both lower and upper limits are set is configured, that is the number of configured ranges is determined by the shorter of the iterables passed to ``minip`` and ``maxip``.
it: **Si noti** che viene configurato solo un intervallo per il quale sono impostati sia i limiti inferiore che quello superiore, ovvero il numero di intervalli configurati è determinato dal più breve degli iterabili passati a ''minip'' e ''maxip''.

source: The arguments ``is_localhost``, ``is_private``, and ``is_automatic`` accept the following values:
it: Gli argomenti ''is_localhost'', ''is_private'' e ''is_automatic'' accettano i seguenti valori:

source: ``None`` to ignore the option
it: ''Nessuno'' per ignorare l'opzione

source: ``True`` to force the option
it: ''True'' per forzare l'opzione

source: ``False`` to forbid the option
it: ''False'' per vietare l'opzione

source: The option meanings are:
it: I significati delle opzioni sono:

source: ``is_localhost``: match localhost address (127.0.0.1)
it: ''is_localhost'': corrisponde all'indirizzo localhost (127.0.0.1)

source: ``is_private``: match address in 172.16.0.0 - 172.31.255.255 and 192.168.0.0 - 192.168.255.255 ranges
it: ''is_private'': corrisponde all'indirizzo negli intervalli 172.16.0.0 - 172.31.255.255 e 192.168.0.0 - 192.168.255.255

source: ``is_automatic``: match address in 169.254.0.0 - 169.254.255.255 range
it: ''is_automatic'': corrisponde all'indirizzo nell'intervallo 169.254.0.0 - 169.254.255.255

source: Check for valid IPv4 address:
it: Verificare la validità dell'indirizzo IPv4:

source: Check for valid private network IPv4 address:
it: Verificare la presenza di un indirizzo IPv4 valido per la rete privata:

source: This validator checks if a field's value is an IP version 6 address.
it: Questo validatore controlla se il valore di un campo è un indirizzo IP versione 6.

source: The signature for the ``IS_IPV6`` constructor is the following:
it: La firma per il costruttore ''IS_IPV6'' è la seguente:

source: The arguments ``is_private``, ``is_link_local``, ``is_reserved``, ``is_multicast``, ``is_routeable``, ``is_6to4``, and ``is_teredo`` accept the following values:
it: Gli argomenti ''is_private'', ''is_link_local'', ''is_reserved'', ''is_multicast'', ''is_routeable'', ''is_6to4'' e ''is_teredo'' accettano i seguenti valori:

source: ``False`` to forbid the option, this does not work for ``is_routeable``
it: ''False'' per vietare l'opzione, questo non funziona per ''is_routeable''

source: ``is_private``: match an address allocated for private networks
it: ''is_private'': corrisponde a un indirizzo allocato per le reti private

source: ``is_link_local``: match an address reserved for link-local (i.e. in fe80::/10 range), this is a private network too (also matched by ``is_private`` above)
it: ''is_link_local'': corrisponde a un indirizzo riservato per link-local (cioè nell'intervallo fe80::/10), anche questa è una rete privata (abbinata anche a ''is_private'' sopra)

source: ``is_reserved``: match an address otherwise IETF reserved
it: ''is_reserved'': corrisponde a un indirizzo altrimenti riservato IETF

source: ``is_multicast``: match an address reserved for multicast use (i.e. in ff00::/8 range)
it: ''is_multicast'': corrisponde a un indirizzo riservato per l'uso multicast (cioè nell'intervallo ff00::/8)

source: ``is_6to4``: match an address that appear to contain a 6to4 embedded address (i.e. in 2002::/16 range)
it: ''is_6to4'': corrisponde a un indirizzo che sembra contenere un indirizzo incorporato 6to4 (cioè nell'intervallo 2002::/16)

source: ``is_teredo``: match a teredo address (i.e. in 2001::/32 range)
it: ''is_teredo'': corrisponde a un indirizzo teredo (cioè nell'intervallo 2001::/32)

source: Forcing ``is_routeable`` (setting to True) is a shortcut to forbid (setting to False) ``is_private``, ``is_reserved``, and ``is_multicast`` all.
it: Forzare ''is_routeable'' (impostando su True) è una scorciatoia per proibire (impostando su False) ''is_private'', ''is_reserved'' e ''is_multicast'' tutti.

source: Use the ``subnets`` argument to pass a subnet or list of subnets to check for address membership, this way an address must be a subnet member to validate.
it: Usa l'argomento ''subnets'' per passare una sottorete o un elenco di sottoreti per verificare l'appartenenza all'indirizzo, in questo modo un indirizzo deve essere un membro della sottorete da convalidare.

source: Check for valid IPv6 address:
it: Verificare la presenza di un indirizzo IPv6 valido:

source: Check for valid private network IPv6 address:
it: Verificare la presenza di un indirizzo IPv6 valido per la rete privata:

source: Check for valid IPv6 address in subnet:
it: Verificare la presenza di un indirizzo IPv6 valido nella subnet:

source: This validator checks if a field's value is an IP address (either version 4 or version 6). Can be set to force addresses from within a specific range. Checks are done using the appropriate ``IS_IPV4`` or ``IS_IPV6`` validator.
it: Questo validatore controlla se il valore di un campo è un indirizzo IP (versione 4 o versione 6). Può essere impostato per forzare gli indirizzi all'interno di un intervallo specifico. I controlli vengono effettuati utilizzando l'apposito validatore ''IS_IPV4'' o ''IS_IPV6''.

source: The signature for the ``IS_IPADDRESS`` constructor is the following:
it: La firma per il costruttore ''IS_IPADDRESS'' è la seguente:

source: With respect to ``IS_IPV4`` and ``IS_IPV6`` validators the only added arguments are:
it: Per quanto riguarda i validatori ''IS_IPV4'' e ''IS_IPV6'' gli unici argomenti aggiunti sono:

source: ``is_ipv4``, set to True to force version 4 or set to False to forbid version 4
it: ''is_ipv4'', impostato su True per forzare la versione 4 o impostato su False per impedire la versione 4

source: ``is_ipv6``, set to True to force version 6 or set to False to forbid version 6
it: ''is_ipv6'', impostato su True per forzare la versione 6 o impostato su False per vietare la versione 6

source: Refer to IS_IPV4 and IS_IPV6 validators for the meaning of other arguments.
it: Fare riferimento ai validatori IS_IPV4 e IS_IPV6 per il significato di altri argomenti.

source: Check for valid IP address (both IPv4 and IPv6):
it: Verificare la presenza di un indirizzo IP valido (sia IPv4 che IPv6):

source: Check for valid IP address (IPv6 only):
it: Verificare la presenza di un indirizzo IP valido (solo IPv6):

source: Other validators
it: Altri validatori

source: ``CLEANUP``
it: ''PULIZIA''

source: This is a filter. It never fails. By default it just removes all characters whose decimal ASCII codes are not in the list [10, 13, 32-127]. It always perform an initial strip (i.e. heading and trailing blank characters removal) on the value.
it: Questo è un filtro. Non fallisce mai. Per impostazione predefinita, rimuove solo tutti i caratteri i cui codici ASCII decimali non sono nell'elenco [10, 13, 32-127]. Esegue sempre una striscia iniziale (ad esempio, la rimozione dei caratteri vuoti di intestazione e finale) sul valore.

source: You can pass a regular expression to decide what has to be removed, for example to clear all non-digit characters use:
it: È possibile passare un'espressione regolare per decidere cosa deve essere rimosso, ad esempio per cancellare tutti i caratteri non numerici utilizzare:

source: Database validators
it: Validatori di database

source: Synopsis: ``IS_NOT_IN_DB(db|set, 'table.field')``
it: Sinossi: ''IS_NOT_IN_DB(db|set, 'table.field')''

source: Consider the following example:
it: Si consideri l'esempio seguente:

source: It requires that when you insert a new person, his/her name is not already in the database, ``db``, in the field ``person.name``.
it: Richiede che quando si inserisce una nuova persona, il suo nome non sia già presente nel database, ''db'', nel campo ''person.name''.

source: A set can be used instead of ``db``.
it: Un set può essere usato al posto di ''db''.
