Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-09.po
Languages: it

source: YATL Template Language
it: Linguaggio dei modelli YATL

source: py4web uses two distinct template languages for rendering dynamic HTML pages that contain Python code:
it: py4web utilizza due linguaggi di template distinti per il rendering di pagine HTML dinamiche che contengono codice Python:

source: `yatl (Yet Another Template Language) <https://pypi.org/project/yatl/>`__ , which is considered the original reference implementation
it: 'yatl (Yet Another Template Language) <https://pypi.org/project/yatl/>'__ , che è considerata l'implementazione di riferimento originale

source: `Renoir <https://pypi.org/project/renoir/>`__, which is a newer and faster implementation of yatl with additional functionality
it: 'Renoir <https://pypi.org/project/renoir/>'__, che è un'implementazione più recente e veloce di yatl con funzionalità aggiuntive

source: Since ``Renoir`` does not include HTML helpers (see next chapter), py4web by default uses the ``Renoir`` module for rendering templates and the ``yatl`` module for helpers, plus some minor trickery to make them work together seamlessly.
it: Dal momento che ''Renoir'' non include gli helper HTML (vedi il prossimo capitolo), py4web di default usa il modulo ''Renoir'' per il rendering dei template e il modulo ''yatl'' per gli helper, più alcuni piccoli trucchi per farli funzionare insieme senza problemi.

source: py4web also uses double square brackets ``[[ ... ]]`` to escape Python code embedded in HTML, unless specified otherwise.
it: py4web usa anche le doppie parentesi quadre ''[[ ... ]] '' per eseguire l'escape del codice Python incorporato in HTML, se non diversamente specificato.

source: The advantage of using square brackets instead of angle brackets is that it’s transparent to all common HTML editors. This allows the developer to use those editors to create py4web templates.
it: Il vantaggio di utilizzare le parentesi quadre invece delle parentesi angolari è che è trasparente a tutti gli editor HTML comuni. Ciò consente allo sviluppatore di utilizzare tali editor per creare modelli py4web.

source: Be careful not to mix Python code square brackets with other square brackets! For example, you'll soon see syntax like this:
it: Fai attenzione a non mischiare le parentesi quadre del codice Python con altre parentesi quadre! Ad esempio, vedrai presto una sintassi come questa:

source: It's mandatory to add a space after the first closed bracket for separating the list from the Python code square brackets.
it: È obbligatorio aggiungere uno spazio dopo la prima parentesi chiusa per separare l'elenco dalle parentesi quadre del codice Python.

source: Since the developer is embedding Python code into HTML, the document should be indented according to HTML rules, and not Python rules. Therefore, we allow un-indented Python inside the ``[[ ... ]]`` tags. But since Python normally uses indentation to delimit blocks of code, we need a different way to delimit them; this is why the py4web template language makes use of the Python keyword ``pass``.
it: Poiché lo sviluppatore incorpora il codice Python in HTML, il documento deve essere rientrato in base alle regole HTML e non alle regole Python. Pertanto, permettiamo Python non indentato all'interno del ''[[ ... ]] ''. Ma poiché Python normalmente usa l'indentazione per delimitare i blocchi di codice, abbiamo bisogno di un modo diverso per delimitarli; questo è il motivo per cui il linguaggio dei template py4web fa uso della parola chiave Python ''pass''.

source: A **code block** starts with a line ending with a colon and ends with a line beginning with ``pass``. The keyword ``pass`` is not necessary when the end of the block is obvious from the context.
it: Un **blocco di codice** inizia con una riga che termina con i due punti e termina con una riga che inizia con ''pass''. La parola chiave ''pass'' non è necessaria quando la fine del blocco è ovvia dal contesto.

source: Here is an example:
it: Ecco un esempio:

source: Note that ``pass`` is a Python keyword, not a py4web keyword. Some Python editors, such as Emacs, use the keyword ``pass`` to signify the division of blocks and use it to re-indent code automatically.
it: Si noti che ''pass'' è una parola chiave Python, non una parola chiave py4web. Alcuni editor Python, come Emacs, usano la parola chiave ''pass'' per indicare la divisione dei blocchi e la usano per re-indentare automaticamente il codice.

source: The py4web template language does exactly the same. When it finds something like:
it: Il linguaggio dei template py4web fa esattamente la stessa cosa. Quando trova qualcosa come:

source: it translates it into a program:
it: lo traduce in un programma:

source: ``response.write`` writes to the response body.
it: ''response.write'' scrive nel corpo della risposta.

source: When there is an error in a py4web template, the error report shows the generated template code, not the actual template as written by the developer. This helps the developer debug the code by highlighting the actual code that is executed (which is something that can be debugged with an HTML editor or the DOM inspector of the browser).
it: Quando si verifica un errore in un modello py4web, il report degli errori mostra il codice del modello generato, non il modello effettivo scritto dallo sviluppatore. Questo aiuta lo sviluppatore a eseguire il debug del codice evidenziando il codice effettivo che viene eseguito (che è qualcosa che può essere sottoposto a debug con un editor HTML o l'ispettore DOM del browser).

source: Also note that:
it: Si noti inoltre che:

source: generates
it: Genera

source: Variables injected into the HTML in this way are escaped by default. The escaping is ignored if ``x`` is an ``XML`` object, even if escape is set to ``True`` (see :ref:`XML` later for details).
it: Le variabili inserite nell'HTML in questo modo vengono precedute da caratteri di escape. L'escape viene ignorato se ''x'' è un oggetto ''XML'', anche se l'escape è impostato a ''True'' (vedere :ref:'XML' più avanti per i dettagli).

source: Here is an example that introduces the ``H1`` helper:
it: Di seguito è riportato un esempio che introduce l'helper ''H1'':

source: which is translated to:
it: che si traduce in:

source: upon evaluation, the ``H1`` object and its components are recursively serialized, escaped and written to the response body. The tags generated by ``H1`` and inner HTML are not escaped. This mechanism guarantees that all text — and only text — displayed on the web page is always escaped, thus preventing XSS vulnerabilities. At the same time, the code is simple and easy to debug.
it: al momento della valutazione, l'oggetto ''H1'' e i suoi componenti vengono serializzati in modo ricorsivo, preceduti da caratteri di escape e scritti nel corpo della risposta. I tag generati da ''H1'' e dall'HTML interno non sono preceduti da caratteri di escape. Questo meccanismo garantisce che tutto il testo, e solo il testo, visualizzato nella pagina Web venga sempre preceduto da un carattere di escape, prevenendo così le vulnerabilità XSS. Allo stesso tempo, il codice è semplice e facile da debuggare.

source: The method ``response.write(obj, escape=True)`` takes two arguments, the object to be written and whether it has to be escaped (set to ``True`` by default). If ``obj`` has an ``.xml()`` method, it is called and the result written to the response body (the ``escape`` argument is ignored). Otherwise it uses the object’s ``__str__`` method to serialize it and, if the escape argument is ``True``, escapes it. All built-in helper objects (``H1`` in the example) are objects that know how to serialize themselves via the ``.xml()`` method.
it: Il metodo ''response.write(obj, escape=True)'' accetta due argomenti, l'oggetto da scrivere e se deve essere preceduto da un escape (impostato a ''True'' per impostazione predefinita). Se ''obj'' ha un metodo ''.xml()'', viene chiamato e il risultato viene scritto nel corpo della risposta (l'argomento ''escape'' viene ignorato). Altrimenti usa il metodo ''__str__'' dell'oggetto per serializzarlo e, se l'argomento di escape è ''True'', ne esegue l'escape. Tutti gli oggetti helper incorporati (''H1'' nell'esempio) sono oggetti che sanno come serializzarsi tramite il metodo ''.xml()''.

source: This is all done transparently.
it: Tutto questo viene fatto in modo trasparente.

source: While the response object used inside the controllers is a full ``bottle.response`` object, inside the yatl templates it is replaced by a dummy object (``yatl.template.DummyResponse``). This object is quite different, and much simpler: it only has a write method! Also, you never need to (and never should) call the ``response.write`` method explicitly.
it: Mentre l'oggetto response usato all'interno dei controller è un oggetto ''bottle.response'' completo, all'interno dei template yatl è sostituito da un oggetto fittizio (''yatl.template.DummyResponse''). Questo oggetto è molto diverso, e molto più semplice: ha solo un metodo di scrittura! Inoltre, non è mai necessario (e non si dovrebbe) chiamare il metodo ''response.write'' in modo esplicito.

source: Basic syntax
it: Sintassi di base

source: The py4web template language supports all Python control structures. Here we provide some examples of each of them. They can be nested according to usual programming practice. You can easily test them by copying the _scaffold app (see :ref:`copying-the-scaffold-app`) and then editing the file ``new_app/template/index.html``.
it: Il linguaggio modello py4web supporta tutte le strutture di controllo Python. Di seguito forniamo alcuni esempi di ciascuno di essi. Possono essere nidificati secondo la consueta pratica di programmazione. Puoi facilmente testarli copiando l'app _scaffold (vedi :ref:'copying-the-scaffold-app') e poi modificando il file ''new_app/template/index.html''.

source: ``for...in``
it: ''Per... dentro''

source: In templates you can loop over any iterable object:
it: Nei modelli è possibile eseguire il ciclo su qualsiasi oggetto iterabile:

source: which produces:
it: che produce:

source: Here ``items`` is any iterable object such as a Python list, Python tuple, or Rows object, or any object that is implemented as an iterator. The elements displayed are first serialized and escaped.
it: Qui ''items'' è qualsiasi oggetto iterabile come una lista Python, una tupla Python o un oggetto Rows, o qualsiasi oggetto che viene implementato come iteratore. Gli elementi visualizzati vengono prima serializzati e preceduti da caratteri di escape.

source: ``while``
it: ''mentre''

source: You can create a loop using the while keyword:
it: È possibile creare un ciclo utilizzando la parola chiave while:

source: ``if...elif...else``
it: ''Se... elif... altro''

source: You can use conditional clauses:
it: È possibile utilizzare le clausole condizionali:

source: Since it is obvious that ``else`` closes the first ``if`` block, there is no need for a ``pass`` statement, and using one would be incorrect. However, you must explicitly close the ``else`` block with a ``pass``.
it: Dal momento che è ovvio che ''else'' chiude il primo blocco ''if'', non c'è bisogno di un'istruzione ''pass'', e usarne una non sarebbe corretto. Tuttavia, è necessario chiudere esplicitamente il blocco ''else'' con un ''pass''.

source: Recall that in Python “else if” is written ``elif`` as in the following example:
it: Ricordiamo che in Python "else if" si scrive ''elif'' come nell'esempio seguente:

source: It produces:
it: Produce:

source: ``try...except...else...finally``
it: ''Provate... eccetto... altro... finalmente''

source: It is also possible to use ``try...except`` statements in templates with one caveat. Consider the following example:
it: E' anche possibile utilizzare ''prova... tranne'' le dichiarazioni nei modelli con un avvertimento. Si consideri l'esempio seguente:

source: It will produce the following output:
it: Produrrà il seguente output:

source: This example illustrates that all output generated before an exception occurs is rendered (including output that preceded the exception) inside the try block. “Hello” is written because it precedes the exception.
it: In questo esempio viene illustrato che viene eseguito il rendering di tutto l'output generato prima che si verifichi un'eccezione (incluso l'output che ha preceduto l'eccezione) all'interno del blocco try. "Hello" si scrive perché precede l'eccezione.

source: ``def...return``
it: ''Def... ritorno''

source: The py4web template language allows the developer to define and implement functions that can return any Python object or a text/html string. Here we consider two examples:
it: Il linguaggio dei template py4web consente allo sviluppatore di definire e implementare funzioni in grado di restituire qualsiasi oggetto Python o una stringa text/html. Consideriamo qui due esempi:

source: produces the following output:
it: produce il seguente output:

source: The function ``itemize1`` returns a helper object that is inserted at the location where the function is called.
it: La funzione ''itemize1'' restituisce un oggetto helper che viene inserito nella posizione in cui viene chiamata la funzione.

source: Consider now the following code:
it: Si consideri ora il codice seguente:

source: It produces exactly the same output as above. In this case, the function ``itemize2`` represents a piece of HTML that is going to replace the py4web tag where the function is called. Notice that there is no ‘=’ in front of the call to ``itemize2``, since the function does not return the text, but it writes it directly into the response.
it: Produce esattamente lo stesso output di cui sopra. In questo caso, la funzione ''itemize2'' rappresenta un pezzo di HTML che sostituirà il tag py4web dove viene chiamata la funzione. Si noti che non c'è '=' davanti alla chiamata a ''itemize2'', poiché la funzione non restituisce il testo, ma lo scrive direttamente nella risposta.

source: There is one caveat: functions defined inside a template must terminate with a ``return`` statement, or the automatic indentation will fail.
it: C'è un avvertimento: le funzioni definite all'interno di un modello devono terminare con un'istruzione ''return'', altrimenti l'indentazione automatica fallirà.

source: Information workflow
it: Flusso di lavoro delle informazioni

source: For dynamically modifying the workflow of the information there are custom commands available: ``extend``, ``include``, ``block`` and ``super``. Note that they are special template directives, not Python commands.
it: Per modificare dinamicamente il flusso di lavoro delle informazioni sono disponibili comandi personalizzati: ''extend'', ''include'', ''block'' e ''super''. Si noti che si tratta di direttive speciali del modello, non di comandi Python.

source: In addition, you can use normal Python functions inside templates.
it: Inoltre, è possibile utilizzare le normali funzioni Python all'interno dei modelli.

source: ``extend`` and ``include``
it: ''estendi'' e ''includi''

source: Templates can extend and include other templates in a tree-like structure.
it: I modelli possono estendere e includere altri modelli in una struttura ad albero.

source: For example, we can think of a template “index.html” that extends “layout.html” and includes “body.html”. At the same time, “layout.html” may include “header.html” and “footer.html”.
it: Ad esempio, possiamo pensare a un modello "index.html" che estende "layout.html" e include "body.html". Allo stesso tempo, "layout.html" può includere "header.html" e "footer.html".

source: The root of the tree is what we call a **layout template**. Just like any other HTML template file, you can edit it from the command line or using the py4web Dashboard. The file name “layout.html” is just a convention.
it: La radice dell'albero è ciò che chiamiamo un **modello di layout**. Proprio come qualsiasi altro file modello HTML, puoi modificarlo dalla riga di comando o utilizzando la dashboard di py4web. Il nome del file "layout.html" è solo una convenzione.

source: Here is a minimalist page that extends the “layout.html” template and includes the “page.html” template:
it: Ecco una pagina minimalista che estende il modello "layout.html" e include il modello "page.html":

source: The extended layout file must contain an ``[[include]]`` directive, something like:
it: Il file di layout esteso deve contenere una direttiva ''[[include]]'', qualcosa del tipo:

source: When the template is called, the extended (layout) template is loaded, and the calling template replaces the ``[[include]]`` directive inside the layout. If you don't write the ``[[include]]`` directive inside the layout, then it will be included at the beginning of the file. Also, if you use multiple ``[[extend]]`` directives only the last one will be processed. Processing continues recursively until all ``extend`` and ``include`` directives have been processed. The resulting template is then translated into Python code.
it: Quando il template viene chiamato, viene caricato il template esteso (layout) e il template chiamante sostituisce la direttiva ''[[include]]'' all'interno del layout. Se non si scrive la direttiva ''[[include]]'' all'interno del layout, allora sarà inclusa all'inizio del file. Inoltre, se si usano più direttive ''[[extend]]'' verrà elaborata solo l'ultima. L'elaborazione continua in modo ricorsivo fino a quando tutte le direttive ''extend'' e ''include'' sono state elaborate. Il modello risultante viene quindi tradotto in codice Python.

source: Note, when an application is bytecode compiled, it is this Python code that is compiled, not the original template files themselves. So, the bytecode compiled version of a given template is a single .pyc file that includes the Python code not just for the original template file, but for its entire tree of extended and included templates.
it: Si noti che quando un'applicazione viene compilata con bytecode, viene compilato questo codice Python, non i file di modello originali. Quindi, la versione compilata in bytecode di un dato modello è un singolo file .pyc che include il codice Python non solo per il file modello originale, ma per l'intero albero di modelli estesi e inclusi.

source: Any content or code that **precedes** the ``[[extend ...]]`` directive will be inserted (and therefore executed) before the beginning of the extended template's content/code. Although this is not typically used to insert actual HTML content before the extended template's content, it can be useful as a means to define variables or functions that you want to make available to the extended template. For example, consider a template “index.html”:
it: Qualsiasi contenuto o codice che **precede** il ''[[extend ...]] '' verrà inserita (e quindi eseguita) prima dell'inizio del contenuto/codice del template esteso. Sebbene non venga in genere utilizzato per inserire il contenuto HTML effettivo prima del contenuto del modello esteso, può essere utile come mezzo per definire le variabili o le funzioni che si desidera rendere disponibili per il modello esteso. Si consideri, ad esempio, un modello "index.html":

source: and an excerpt from “layout.html”:
it: e un estratto da "layout.html":

source: Because the ``sidebar_enabled`` assignment in “index.html” comes before the ``extend``, that line gets inserted before the beginning of “layout.html”, making ``sidebar_enabled`` available anywhere within the “layout.html” code.
it: Poiché l'assegnazione ''sidebar_enabled'' in "index.html" viene prima di ''extend'', quella riga viene inserita prima dell'inizio di "layout.html", rendendo ''sidebar_enabled'' disponibile ovunque all'interno del codice "layout.html".

source: It is also worth pointing out that the variables returned by the controller function are available not only in the function’s main template, but in all of its extended and included templates as well.
it: Vale anche la pena sottolineare che le variabili restituite dalla funzione controller sono disponibili non solo nel modello principale della funzione, ma anche in tutti i suoi modelli estesi e inclusi.

source: Extending using variables
it: Estensione tramite variabili

source: The argument of an ``extend`` or ``include`` (i.e., the extended or included template name) can be a Python variable (though not a Python expression). However, this imposes a limitation – templates that use variables in ``extend`` or ``include`` statements cannot be bytecode compiled. As noted above, bytecode-compiled templates include the entire tree of extended and included templates, so the specific extended and included templates must be known at compile time, which is not possible if the template names are variables (whose values are not determined until run time). Because bytecode compiling templates can provide a significant speed boost, using variables in ``extend`` and ``include`` should generally be avoided if possible.
it: L'argomento di un ''extend'' o ''include'' (cioè il nome del template esteso o incluso) può essere una variabile Python (anche se non un'espressione Python). Tuttavia, questo impone una limitazione: i modelli che usano variabili nelle istruzioni ''extend'' o ''include'' non possono essere compilati con bytecode. Come indicato in precedenza, i modelli compilati con bytecode includono l'intero albero dei modelli estesi e inclusi, quindi i modelli estesi e inclusi specifici devono essere noti in fase di compilazione, il che non è possibile se i nomi dei modelli sono variabili (i cui valori non vengono determinati fino alla fase di esecuzione). Poiché i modelli di compilazione del bytecode possono fornire un significativo aumento di velocità, l'uso di variabili in ''extend'' e ''include'' dovrebbe essere generalmente evitato, se possibile.

source: In some cases, an alternative to using a variable in an ``include`` is simply to place regular ``[[include ...]]`` directives inside an ``if...else`` block.
it: In alcuni casi, un'alternativa all'uso di una variabile in un ''include'' è semplicemente quella di inserire ''[[include ...]] '' direttive all'interno di un ''se... else''.

source: The above code does not present any problem for bytecode compilation because no variables are involved. Note, however, that the bytecode compiled template will actually include the Python code for both “this_template.html” and “that_template.html”, though only the code for one of those templates will be executed, depending on the value of ``some_condition``.
it: Il codice di cui sopra non presenta alcun problema per la compilazione del bytecode perché non sono coinvolte variabili. Si noti, tuttavia, che il modello compilato bytecode includerà effettivamente il codice Python sia per "this_template.html" che per "that_template.html", anche se verrà eseguito solo il codice per uno di questi modelli, a seconda del valore di ''some_condition''.

source: Keep in mind, this only works for ``include`` – you cannot place ``[[extend ...]]`` directives inside ``if...else`` blocks.
it: Tenete a mente che questo funziona solo per ''include'' – non potete inserire ''[[extend ...]] '' direttive all'interno di ''se... else''.

source: Layouts are used to encapsulate page commonality (headers, footers, menus), and though they are not mandatory, they will make your application easier to write and maintain.
it: I layout vengono utilizzati per incapsulare la comunanza delle pagine (intestazioni, piè di pagina, menu) e, sebbene non siano obbligatori, semplificano la scrittura e la gestione dell'applicazione.

source: Template Functions
it: Funzioni del modello

source: Consider this “layout.html”:
it: Si consideri questo "layout.html":

source: and this extending template
it: e questo modello di estensione
