Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-09.po
Languages: it

source: Notice the function is defined before the ``[[extend...]]`` statement – this results in the function being created before the “layout.html” code is executed, so the function can be called anywhere within “layout.html”, even before the ``[[include]]``. Also notice the function is included in the extended template without the ``=`` prefix.
it: Si noti che la funzione è definita prima di ''[[extend...]] '' - questo fa sì che la funzione venga creata prima che il codice "layout.html" venga eseguito, quindi la funzione può essere chiamata ovunque all'interno di "layout.html", anche prima di ''[[include]]''. Si noti inoltre che la funzione è inclusa nel modello esteso senza il prefisso ''=''.

source: The code generates the following output:
it: Il codice genera l'output seguente:

source: Notice that the function is defined in HTML (although it could also contain Python code) so that ``response.write`` is used to write its content (the function does not return the content). This is why the layout calls the template function using ``[[mysidebar()]]`` rather than ``[[=mysidebar()]]``. Functions defined in this way can take arguments.
it: Si noti che la funzione è definita in HTML (anche se potrebbe contenere anche codice Python) in modo che ''response.write'' sia usato per scrivere il suo contenuto (la funzione non restituisce il contenuto). Questo è il motivo per cui il layout chiama la funzione template usando ''[[mysidebar()]]'' piuttosto che ''[[=mysidebar()]]''. Le funzioni definite in questo modo possono accettare argomenti.

source: ``block`` and ``super``
it: ''Blocca'' e ''Super''

source: The main way to make a template more modular is by using ``[[block ...]]``\ s and this mechanism is an alternative to the mechanism discussed in the previous section.
it: Il modo principale per rendere un template più modulare è usare ''[[block ...]] ''\ s e questo meccanismo è un'alternativa al meccanismo discusso nella sezione precedente.

source: To understand how this works, consider apps based on the scaffolding app welcome, which has a template layout.html. This template is extended by the template ``default/index.html`` via ``[[extend 'layout.html']]``. The contents of layout.html predefine certain blocks with certain default content, and these are therefore included into default/index.html.
it: Per capire come funziona, prendi in considerazione le app basate sull'app di supporto per l'impalcatura, che ha un modello layout.html. Questo template è esteso dal template ''default/index.html'' tramite ''[[extend 'layout.html']]''. Il contenuto di layout.html predefinisce, determinati blocchi con determinati contenuti predefiniti, e questi sono quindi inclusi in default/index.html.

source: You can override these default content blocks by enclosing your new content inside the same block name. The location of the block in the layout.html is not changed, but the contents is.
it: È possibile ignorare questi blocchi di contenuto predefiniti racchiudendo il nuovo contenuto all'interno dello stesso nome di blocco. La posizione del blocco nel layout.html non viene modificata, ma il contenuto sì.

source: Here is a simplified version. Imagine this is “layout.html”:
it: Ecco una versione semplificata. Immagina che questo sia "layout.html":

source: and this is a simple extending template ``default/index.html``:
it: E questo è un semplice template di estensione ''default/index.html'':

source: It generates the following output, where the content is provided by the over-riding block in the extending template, yet the enclosing DIV and class comes from layout.html. This allows consistency across templates:
it: Genera l'output seguente, in cui il contenuto viene fornito dal blocco di override nel modello di estensione, ma il DIV e la classe che li contengono provengono da layout.html. Ciò consente la coerenza tra i modelli:

source: The real layout.html defines a number of useful blocks, and you can easily add more to match the layout your desire.
it: Il layout.html reale definisce una serie di blocchi utili e puoi facilmente aggiungerne altri per abbinarli al layout che desideri.

source: You can have many blocks, and if a block is present in the extended template but not in the extending template, the content of the extended template is used. Also, notice that unlike with functions, it is not necessary to define blocks before the ``[[extend ...]]`` – even if defined after the ``extend``, they can be used to make substitutions anywhere in the extended template.
it: È possibile avere molti blocchi e, se un blocco è presente nel modello esteso ma non nel modello esteso, viene utilizzato il contenuto del modello esteso. Inoltre, si noti che, a differenza delle funzioni, non è necessario definire i blocchi prima di ''[[extend ...]] '' – anche se definiti dopo l'''estensione'', possono essere utilizzati per effettuare sostituzioni in qualsiasi punto del modello esteso.

source: Inside a block, you can use the expression ``[[super]]`` to include the content of the parent. For example, if we replace the above extending template with:
it: All'interno di un blocco, è possibile utilizzare l'espressione ''[[super]]'' per includere il contenuto del genitore. Ad esempio, se sostituiamo il modello di estensione di cui sopra con:

source: we get:
it: Otteniamo:

source: Page layout standard structure
it: Struttura standard del layout di pagina

source: Default page layout
it: Layout predefinito della pagina

source: The “templates/layout.html” that currently ships with the py4web **_scaffold** application is quite complex but it has the following structure:
it: Il "templates/layout.html" che attualmente viene fornito con l'applicazione py4web **_scaffold** è piuttosto complesso ma ha la seguente struttura:

source: There are a few features of this default layout that make it very easy to use and customize:
it: Ci sono alcune caratteristiche di questo layout predefinito che lo rendono molto facile da usare e personalizzare:

source: it is written in HTML5
it: è scritto in HTML5

source: on line 7 it's used the ``no.css`` stylesheet, see `here <https://github.com/mdipierro/no.css/>`__
it: Alla riga 7 viene usato il foglio di stile ''no.css'', vedi 'qui <https://github.com/mdipierro/no.css/>'__

source: on line 58 ``[[include]]`` is replaced by the content of the extending template when the page is rendered
it: Alla riga 58 ''[[include]]'' viene sostituito dal contenuto del template di estensione quando la pagina viene visualizzata

source: it contains the following blocks: page_head, page_left_menu, page_scripts
it: Contiene i seguenti blocchi: page_head, page_left_menu page_scripts

source: on line 30 it checks if the user is logged on and changes the menu accordingly
it: Alla riga 30 controlla se l'utente è connesso e modifica il menu di conseguenza

source: on line 54 it checks for flash alert messages
it: alla riga 54 verifica la presenza di messaggi di avviso lampeggianti

source: Of course you can also completely replace the “layout.html” and the stylesheet with your own.
it: Naturalmente puoi anche sostituire completamente il "layout.html" e il foglio di stile con il tuo.

source: Mobile development
it: Sviluppo per dispositivi mobili

source: Although the default layout.html is designed to be mobile-friendly, one may sometimes need to use different templates when a page is visited by a mobile device.
it: Sebbene il layout.html predefinito sia progettato per essere ottimizzato per i dispositivi mobili, a volte potrebbe essere necessario utilizzare modelli diversi quando una pagina viene visitata da un dispositivo mobile.
