Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: It is also possible to insert a file in a simpler way and have the insert method call ``store`` automatically:
it: E' anche possibile inserire un file in modo più semplice e fare in modo che il metodo insert chiami ''store'' automaticamente:

source: In this case the filename is obtained from the stream object if available.
it: In questo caso, il nome del file viene ottenuto dall'oggetto stream, se disponibile.

source: The ``store`` method of the upload field object takes a file stream and a filename. It uses the filename to determine the extension (type) of the file, creates a new temp name for the file (according to py4web upload mechanism) and loads the file content in this new temp file (under the uploads folder unless specified otherwise). It returns the new temp name, which is then stored in the ``image`` field of the ``db.myfile`` table.
it: Il metodo ''store'' dell'oggetto campo di caricamento accetta un flusso di file e un nome di file. Utilizza il nome del file per determinare l'estensione (tipo) del file, crea un nuovo nome temporaneo per il file (in base al meccanismo di caricamento py4web) e carica il contenuto del file in questo nuovo file temporaneo (nella cartella uploads se non diversamente specificato). Restituisce il nuovo nome temporaneo, che viene poi memorizzato nel campo ''image'' della tabella ''db.myfile''.

source: Note, if the file is to be stored in an associated blob field rather than the file system, the ``store`` method will not insert the file in the blob field (because ``store`` is called before the insert), so the file must be explicitly inserted into the blob field:
it: Si noti che, se il file deve essere archiviato in un campo BLOB associato anziché nel file system, il metodo ''store'' non inserirà il file nel campo BLOB (perché ''store'' viene chiamato prima dell'inserimento), quindi il file deve essere inserito in modo esplicito nel campo BLOB:

source: The ``retrieve`` method does the opposite of ``store``.
it: Il metodo ''retrieve'' fa l'opposto di ''store''.

source: When uploaded files are stored on filesystem (as in the case of a plain ``Field('image', 'upload')``) the code:
it: Quando i file caricati sono memorizzati sul filesystem (come nel caso di un semplice ''Field('image', 'upload')'') il codice:

source: retrieves the original file name (filename) as seen by the user at upload time and the name of stored file (fullname, with path relative to application folder). While in general the call:
it: Recupera il nome del file originale (filename) visto dall'utente al momento del caricamento e il nome del file memorizzato (fullname, con percorso relativo alla cartella dell'applicazione). Mentre in generale l'invito:

source: retrieves the original file name (filename) and a file-like object ready to access uploaded file data (stream).
it: Recupera il nome del file originale (filename) e un oggetto simile a un file pronto per accedere ai dati del file caricato (flusso).

source: Notice that the stream returned by ``retrieve`` is a real file object in the case that uploaded files are stored on filesystem. In that case remember to close the file when you are done, calling ``stream.close()``.
it: Si noti che il flusso restituito da ''retrieve'' è un oggetto file reale nel caso in cui i file caricati siano memorizzati sul filesystem. In tal caso ricordati di chiudere il file quando hai finito, chiamando ''stream.close()''.

source: Here is an example of safe usage of ``retrieve``:
it: Ecco un esempio di utilizzo sicuro di ''retrieve'':

source: Migrations
it: Migrazioni

source: With our example table definition:
it: Con la nostra definizione di tabella di esempio:

source: ``define_table`` checks whether or not the corresponding table exists. If it does not, it generates the SQL to create it and executes the SQL. If the table does exist but differs from the one being defined, it generates the SQL to alter the table and executes it. If a field has changed type but not name, it will try to convert the data (If you do not want this, you need to redefine the table twice, the first time, letting py4web drop the field by removing it, and the second time adding the newly defined field so that py4web can create it). If the table exists and matches the current definition, it will leave it alone. In all cases it will create the ``db.person`` object that represents the table.
it: ''define_table'' controlla se la tabella corrispondente esiste o meno. In caso contrario, genera l'SQL per crearlo ed esegue l'SQL. Se la tabella esiste ma è diversa da quella definita, genera l'SQL per modificare la tabella e lo esegue. Se un campo ha cambiato tipo ma non nome, cercherà di convertire i dati (se non lo si desidera, è necessario ridefinire la tabella due volte, la prima volta, lasciando che py4web elimini il campo rimuovendolo, e la seconda volta aggiungendo il campo appena definito in modo che py4web possa crearlo). Se la tabella esiste e corrisponde alla definizione corrente, verrà lasciata invariata. In tutti i casi creerà l'oggetto ''db.person'' che rappresenta la tabella.

source: We refer to this behavior as a “migration”. py4web logs all migrations and migration attempts in the file “sql.log”.
it: Ci riferiamo a questo comportamento come "migrazione". py4web registra tutte le migrazioni e i tentativi di migrazione nel file "sql.log".

source: by default py4web uses the “app/databases” folder for the log file and all other migration files it needs. You can change this setting by changing the ``folder`` argument to DAL. To set a different log file name, for example “migrate.log” you can do ``db = DAL(..., adapter_args=dict(logfile='migrate.log'))``
it: Per impostazione predefinita, py4web utilizza la cartella "App/Databases" per il file di log e tutti gli altri file di migrazione necessari. È possibile modificare questa impostazione cambiando l'argomento ''folder'' in DAL. Per impostare un nome diverso per il file di log, ad esempio "migrate.log" si può fare ''db = DAL(..., adapter_args=dict(logfile='migrate.log'))''

source: The first argument of ``define_table`` is always the table name. The other unnamed arguments are the fields. The function also takes an optional keyword argument called “migrate”:
it: Il primo argomento di ''define_table'' è sempre il nome della tabella. Gli altri argomenti senza nome sono i campi. La funzione accetta anche un argomento di parola chiave facoltativo chiamato "migrate":

source: The value of migrate is the filename where py4web stores internal migration information for this table. These files are very important and should never be removed while the corresponding tables exist. In cases where a table has been dropped and the corresponding file still exist, it can be removed manually. By default, migrate is set to True. This causes py4web to generate the filename from a hash of the connection string. If migrate is set to False, the migration is not performed, and py4web assumes that the table exists in the datastore and it contains (at least) the fields listed in ``define_table``.
it: Il valore di migrate è il nome del file in cui py4web memorizza le informazioni di migrazione interne per questa tabella. Questi file sono molto importanti e non dovrebbero mai essere rimossi mentre esistono le tabelle corrispondenti. Nei casi in cui una tabella è stata eliminata e il file corrispondente esiste ancora, può essere rimosso manualmente. Per impostazione predefinita, la migrazione è impostata su True. Questo fa sì che py4web generi il nome del file da un hash della stringa di connessione. Se migrate è impostato su False, la migrazione non viene eseguita e py4web assume che la tabella esista nel datastore e contenga (almeno) i campi elencati in ''define_table''.

source: There may not be two tables in the same application with the same migrate filename.
it: È possibile che nella stessa applicazione non siano presenti due tabelle con lo stesso nome file di migrazione.

source: The DAL class also takes a “migrate” argument, which determines the default value of migrate for calls to ``define_table``. For example,
it: La classe DAL accetta anche un argomento "migrate", che determina il valore predefinito di migrate per le chiamate a ''define_table''. Per esempio

source: will set the default value of migrate to False whenever ``db.define_table`` is called without a migrate argument.
it: imposterà il valore predefinito di migrate a False ogni volta che ''db.define_table'' viene chiamato senza un argomento di migrazione.

source: py4web only migrates new columns, removed columns, and changes in column type (except in SQLite). py4web does not migrate changes in attributes such as changes in the values of ``default``, ``unique``, ``notnull``, and ``ondelete``.
it: py4web esegue solo la migrazione di nuove colonne, colonne rimosse e modifiche nel tipo di colonna (tranne che in SQLite). py4web non migra le modifiche negli attributi come le modifiche nei valori di ''default'', ''unique'', ''notnull'' e ''ondelete''.

source: Migrations can be disabled for all tables at once:
it: Le migrazioni possono essere disabilitate per tutte le tabelle contemporaneamente:

source: This is the recommended behavior when two apps share the same database. Only one of the two apps should perform migrations, the other should disable them.
it: Questo è il comportamento consigliato quando due app condividono lo stesso database. Solo una delle due app deve eseguire le migrazioni, l'altra deve disabilitarle.

source: Fixing broken migrations
it: Correzione delle migrazioni interrotte

source: There are two common problems with migrations and there are ways to recover from them.
it: Ci sono due problemi comuni con le migrazioni e ci sono modi per riprendersi da esse.

source: One problem is specific with SQLite. SQLite does not enforce column types and cannot drop columns. This means that if you have a column of type string and you remove it, it is not really removed. If you add the column again with a different type (for example datetime) you end up with a datetime column that contains strings (junk for practical purposes). py4web does not complain about this because it does not know what is in the database, until it tries to retrieve records and fails.
it: Un problema è specifico con SQLite. SQLite non applica i tipi di colonna e non può eliminare le colonne. Ciò significa che se si dispone di una colonna di tipo string e la si rimuove, non viene effettivamente rimossa. Se si aggiunge di nuovo la colonna con un tipo diverso (ad esempio datetime), si ottiene una colonna datetime che contiene stringhe (spazzatura per scopi pratici). py4web non si lamenta di questo perché non sa cosa c'è nel database, fino a quando non tenta di recuperare i record e fallisce.

source: If py4web returns an error in some parse function when selecting records, most likely this is due to corrupted data in a column because of the above issue.
it: Se py4web restituisce un errore in una funzione di analisi durante la selezione dei record, molto probabilmente ciò è dovuto a dati danneggiati in una colonna a causa del problema di cui sopra.

source: The solution consists in updating all records of the table and updating the values in the column in question with None.
it: La soluzione consiste nell'aggiornare tutti i record della tabella e aggiornare i valori nella colonna in questione con None.

source: The other problem is more generic but typical with MySQL. MySQL does not allow more than one ALTER TABLE in a transaction. This means that py4web must break complex transactions into smaller ones (one ALTER TABLE at the time) and commit one piece at the time. It is therefore possible that part of a complex transaction gets committed and one part fails, leaving py4web in a corrupted state. Why would part of a transaction fail? Because, for example, it involves altering a table and converting a string column into a datetime column, py4web tries to convert the data, but the data cannot be converted. What happens to py4web? It gets confused about what exactly is the table structure actually stored in the database.
it: L'altro problema è più generico ma tipico di MySQL. MySQL non consente più di un ALTER TABLE in una transazione. Ciò significa che py4web deve suddividere le transazioni complesse in transazioni più piccole (un ALTER TABLE alla volta) e fare un commit alla volta. È quindi possibile che una parte di una transazione complessa venga salvata e una parte fallisca, lasciando py4web in uno stato corrotto. Perché una parte di una transazione non riesce? Poiché, ad esempio, comporta la modifica di una tabella e la conversione di una colonna stringa in una colonna datetime, py4web tenta di convertire i dati, ma i dati non possono essere convertiti. Cosa succede a py4web? Si confonde su quale sia esattamente la struttura della tabella effettivamente memorizzata nel database.

source: The solution consists of enabling fake migrations:
it: La soluzione consiste nell'abilitare false migrazioni:

source: This will rebuild py4web metadata about the table according to the table definition. Try multiple table definitions to see which one works (the one before the failed migration and the one after the failed migration). Once successful remove the ``fake_migrate=True`` parameter.
it: In questo modo verranno ricostruiti i metadati py4web relativi alla tabella in base alla definizione della tabella. Provare più definizioni di tabella per vedere quale funziona (quella prima della migrazione non riuscita e quella dopo la migrazione non riuscita). Una volta riuscito, rimuovere il parametro ''fake_migrate=True''.

source: Before attempting to fix migration problems it is prudent to make a copy of “yourapp/databases/\*.table” files.
it: Prima di tentare di risolvere i problemi di migrazione, è prudente creare una copia dei file "yourapp/databases/\*.table".

source: Migration problems can also be fixed for all tables at once:
it: I problemi di migrazione possono anche essere risolti per tutte le tabelle contemporaneamente:

source: This also fails if the model describes tables that do not exist in the database, but it can help narrowing down the problem.
it: Questa operazione ha esito negativo anche se il modello descrive tabelle che non esistono nel database, ma può aiutare a restringere il problema.

source: Migration control summary
it: Riepilogo del controllo della migrazione

source: The logic of the various migration arguments are summarized in this pseudo-code:
it: La logica dei vari argomenti di migrazione è riassunta in questo pseudo-codice:

source: Table methods
it: Metodi di tabella

source: ``insert``
it: ''inserisci''

source: Given a table, you can insert records
it: Data una tabella, è possibile inserire record

source: Insert returns the unique “id” value of each record inserted.
it: Inserisci restituisce il valore "id" univoco di ogni record inserito.

source: You can truncate the table, i.e., delete all records and reset the counter of the id.
it: È possibile troncare la tabella, ovvero eliminare tutti i record e reimpostare il contatore dell'id.

source: Now, if you insert a record again, the counter starts again at 1 (this is back-end specific and does not apply to Google NoSQL):
it: Ora, se inserisci di nuovo un record, il contatore ricomincia da 1 (questo è specifico del back-end e non si applica a Google NoSQL):

source: Notice you can pass a parameter to ``truncate``, for example you can tell SQLite to restart the id counter.
it: Si noti che si può passare un parametro a ''truncate'', ad esempio si può dire a SQLite di riavviare il contatore id.

source: The argument is in raw SQL and therefore engine specific.
it: L'argomento è in SQL non elaborato e quindi specifico del motore.

source: py4web also provides a bulk_insert method
it: py4web fornisce anche un metodo bulk_insert

source: It takes a list of dictionaries of fields to be inserted and performs multiple inserts at once. It returns the list of “id” values of the inserted records. On the supported relational databases there is no advantage in using this function as opposed to looping and performing individual inserts but on Google App Engine NoSQL, there is a major speed advantage.
it: Richiede un elenco di dizionari di campi da inserire ed esegue più inserimenti contemporaneamente. Restituisce l'elenco dei valori "id" dei record inseriti. Sui database relazionali supportati non c'è alcun vantaggio nell'utilizzo di questa funzione rispetto al looping e all'esecuzione di singoli inserimenti, ma su Google App Engine NoSQL c'è un grande vantaggio in termini di velocità.

source: ``Query``, ``Set``, ``Rows``
it: ''Interrogazione'', ''Imposta'', ''Righe''

source: Let’s consider again the table defined (and dropped) previously and insert three records:
it: Consideriamo nuovamente la tabella definita (e eliminata) in precedenza e inseriamo tre record:

source: You can store the table in a variable. For example, with variable ``person``, you could do:
it: È possibile memorizzare la tabella in una variabile. Ad esempio, con la variabile ''person'', si potrebbe fare:

source: You can also store a field in a variable such as ``name``. For example, you could also do:
it: Puoi anche memorizzare un campo in una variabile come ''name''. Ad esempio, potresti anche fare:

source: You can even build a query (using operators like ==, !=, <, >, <=, >=, like, belongs) and store the query in a variable ``q`` such as in:
it: È anche possibile creare una query (usando operatori come ==, !=, <, >, <=, >=, like, belongs) e memorizzare la query in una variabile ''q'' come in:

source: When you call ``db`` with a query, you define a set of records. You can store it in a variable ``s`` and write:
it: Quando si chiama ''db'' con una query, si definisce un insieme di record. Puoi memorizzarlo in una variabile ''s'' e scrivere:

source: Notice that no database query has been performed so far. DAL + Query simply define a set of records in this db that match the query. py4web determines from the query which table (or tables) are involved and, in fact, there is no need to specify that.
it: Si noti che finora non è stata eseguita alcuna query di database. DAL + Query definisce semplicemente un insieme di record in questo db che corrispondono alla query. py4web determina dalla query quale tabella (o tabelle) sono coinvolte e, di fatto, non c'è bisogno di specificarlo.

source: Some times you need to perform an insert only if there is no record with the same values as those being inserted. This can be done with
it: A volte è necessario eseguire un inserimento solo se non è presente alcun record con gli stessi valori di quelli inseriti. Questo può essere fatto con

source: The record will be inserted only if there is no other user called John born in Chicago.
it: Il record verrà inserito solo se non c'è nessun altro utente di nome John nato a Chicago.

source: You can specify which values to use as a key to determine if the record exists. For example:
it: È possibile specificare i valori da utilizzare come chiave per determinare se il record esiste. Per esempio:

source: and if there is John his birthplace will be updated else a new record will be created.
it: e se c'è Giovanni, il suo luogo di nascita verrà aggiornato, altrimenti verrà creato un nuovo record.

source: The selection criteria in the example above is a single field. It can also be a query, such as
it: Il criterio di selezione nell'esempio precedente è un singolo campo. Può anche essere una query, ad esempio

source: The function
it: La funzione

source: works very much like
it: funziona in modo molto simile

source: except that it calls the validators for the fields before performing the insert and bails out if the validation does not pass. If validation does not pass the errors can be found in ``ret["errors"]``. ``ret["errors"]`` holds a key-value mapping where each key is the field name whose validation failed, and the value of the key is the result from the validation error (much like ``form["errors"]``). If it passes, the id of the new record is in ``ret["id"]``. Mind that normally validation is done by the form processing logic so this function is rarely needed.
it: tranne per il fatto che chiama i validatori per i campi prima di eseguire l'inserimento e si salva se la convalida non viene superata. Se la convalida non ha esito positivo, gli errori possono essere trovati in ''ret["errors"]''. ''ret["errors"]'' contiene una mappatura chiave-valore in cui ogni chiave è il nome del campo la cui convalida non è riuscita, e il valore della chiave è il risultato dell'errore di convalida (molto simile a ''form["errors"]''). Se passa, l'id del nuovo record è in ''ret["id"]''. Tieni presente che normalmente la convalida viene eseguita dalla logica di elaborazione del modulo, quindi questa funzione è raramente necessaria.

source: Similarly
it: Similmente

source: works very much the same as
it: funziona molto allo stesso modo di

source: except that it calls the validators for the fields before performing the update. Notice that it only works if query involves a single table. The number of updated records can be found in ``ret["updated"]`` and errors will be in ``ret["errors"]``.
it: tranne per il fatto che chiama i validatori per i campi prima di eseguire l'aggiornamento. Si noti che funziona solo se la query coinvolge una singola tabella. Il numero di record aggiornati può essere trovato in ''ret["updated"]'' e gli errori saranno in ''ret["errors"]''.

source: ``drop``
it: ''goccia''

source: Finally, you can drop tables and all data will be lost:
it: Infine, è possibile eliminare le tabelle e tutti i dati andranno persi:

source: Tagging records
it: Assegnazione di tag ai record

source: Tags allows to add or find properties attached to records in your database.
it: Tag consente di aggiungere o trovare proprietà associate ai record nel database.

source: It is internally implemented as a table, which in this example would be db.thing_tags_default, because no tail was specified on the Tags(table, tail=“default”) constructor.
it: Viene implementato internamente come tabella, che in questo esempio sarebbe db.thing_tags_default, perché non è stata specificata alcuna coda nel costruttore Tags(table, tail="default").

source: The ``find`` method is doing a search by ``startswith`` of the parameter. Then find([“color”]) would return id1 and id2 because both records have tags starting with “color”. py4web uses tags as a flexible mechanism to manage permissions.
it: Il metodo ''find'' consiste nell'eseguire una ricerca per ''startswith'' del parametro. Quindi find(["color"]) restituirebbe id1 e id2 perché entrambi i record hanno tag che iniziano con "color". py4web utilizza i tag come meccanismo flessibile per gestire le autorizzazioni.

source: Raw SQL
it: SQL non elaborato

source: The DAL allows you to explicitly issue SQL statements.
it: Il DAL consente di emettere in modo esplicito istruzioni SQL.

source: In this case, the return values are not parsed or transformed by the DAL, and the format depends on the specific database driver. This usage with selects is normally not needed, but it is more common with indexes.
it: In questo caso, i valori restituiti non vengono analizzati o trasformati dal DAL e il formato dipende dal driver di database specifico. Questo utilizzo con le selezioni non è normalmente necessario, ma è più comune con gli indici.

source: ``executesql`` takes five optional arguments: ``placeholders``, ``as_dict``, ``fields``, ``colnames``, and ``as_ordered_dict``.
it: ''ExecuteSQL'' accetta cinque argomenti facoltativi: ''Segnaposto'', ''as_dict'', ''Campi'', ''Colnames'' e ''as_ordered_dict''.
