Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-12.po
Languages: it

source: For more information on Python regular expressions, refer to the official Python documentation.
it: Per ulteriori informazioni sulle espressioni regolari di Python, fare riferimento alla documentazione ufficiale di Python.

source: ``IS_MATCH`` takes an optional argument ``strict`` which defaults to ``False``. When set to ``True`` it only matches the whole string (from the beginning to the end):
it: ''IS_MATCH'' accetta un argomento opzionale ''strict'' che di default è ''False''. Quando è impostato su ''True'' corrisponde solo all'intera stringa (dall'inizio alla fine):

source: ``IS_MATCH`` takes an other optional argument ``search`` which defaults to ``False``. When set to ``True``, it uses regex method ``search`` instead of method ``match`` to validate the string.
it: ''IS_MATCH'' accetta un altro argomento opzionale ''search'' che il valore predefinito è ''False''. Quando è impostato su ''True'', usa il metodo regex ''search'' invece del metodo ''match'' per convalidare la stringa.

source: ``IS_MATCH('...', extract=True)`` filters and extract only the first matching substring rather than the original value.
it: ''IS_MATCH('...', extract=True)'' filtra ed estrae solo la prima sottostringa corrispondente anziché il valore originale.

source: Checks if length of field's value fits between given boundaries. Works for both text and file inputs.
it: Controlla se la lunghezza del valore del campo rientra tra i limiti specificati. Funziona sia per gli input di testo che per quelli di file.

source: Its arguments are:
it: Le sue argomentazioni sono:

source: maxsize: the maximum allowed length / size (has default = 255)
it: maxsize: la lunghezza/dimensione massima consentita (ha il valore predefinito = 255)

source: minsize: the minimum allowed length / size
it: minsize: la lunghezza/dimensione minima consentita

source: Examples: Check if text string is shorter than 16 characters:
it: Esempi: controlla se la stringa di testo è più breve di 16 caratteri:

source: Check if uploaded file has size between 1KB and 1MB:
it: Controlla se il file caricato ha dimensioni comprese tra 1 KB e 1 MB:

source: For all field types except for files, it checks the length of the value. In the case of files, the value is a ``cgi.FieldStorage``, so it validates the length of the data in the file, which is the behavior one might intuitively expect.
it: Per tutti i tipi di campo, ad eccezione dei file, controlla la lunghezza del valore. Nel caso dei file, il valore è un ''cgi. FieldStorage'', in modo da convalidare la lunghezza dei dati nel file, che è il comportamento che ci si potrebbe intuitivamente aspettare.

source: Rejects a URL string if any of the following is true:
it: Rifiuta una stringa URL se si verifica una delle seguenti condizioni:

source: The string is empty or None
it: La stringa è vuota o None

source: The string uses characters that are not allowed in a URL
it: La stringa utilizza caratteri non consentiti in un URL

source: The string breaks any of the HTTP syntactic rules
it: La stringa interrompe una qualsiasi delle regole sintattiche HTTP

source: The URL scheme specified (if one is specified) is not 'http' or 'https'
it: Lo schema URL specificato (se specificato) non è 'http' o 'https'

source: The top-level domain (if a host name is specified) does not exist
it: Il dominio di primo livello (se è specificato un nome host) non esiste

source: (These rules are based on ``RFC 2616``)
it: (Queste regole sono basate su ''RFC 2616'')

source: This function only checks the URL's syntax. It does not check that the URL points to a real document, for example, or that it otherwise makes semantic sense. This function does automatically prepend 'http://' in front of a URL in the case of an abbreviated URL (e.g. 'google.ca'). If the parameter ``mode='generic'`` is used, then this function's behavior changes. It then rejects a URL string if any of the following is true:
it: Questa funzione controlla solo la sintassi dell'URL. Non controlla che l'URL punti a un documento reale, ad esempio, o che abbia un senso semantico. Questa funzione antepone automaticamente 'http://' davanti a un URL nel caso di un URL abbreviato (ad es. 'google.ca'). Se viene utilizzato il parametro ''mode='generic''', il comportamento di questa funzione cambia. Rifiuta quindi una stringa URL se si verifica una delle seguenti condizioni:

source: The URL scheme specified (if one is specified) is not valid
it: Lo schema URL specificato (se specificato) non è valido

source: (These rules are based on ``RFC 2396``)
it: (Queste regole sono basate su ''RFC 2396'')

source: The list of allowed schemes is customizable with the allowed_schemes parameter. If you exclude None from the list, then abbreviated URLs (lacking a scheme such as 'http') will be rejected.
it: L'elenco degli schemi consentiti è personalizzabile con il parametro allowed_schemes. Se escludi Nessuno dall'elenco, gli URL abbreviati (privi di uno schema come "http") verranno rifiutati.

source: The default prepended scheme is customizable with the prepend_scheme parameter. If you set prepend_scheme to None, then prepending will be disabled. URLs that require prepending to parse will still be accepted, but the return value will not be modified.
it: Lo schema preposto predefinito è personalizzabile con il parametro prepend_scheme. Se si imposta prepend_scheme su Nessuno, l'anteposizione verrà disabilitata. Gli URL che richiedono l'anteposizione per l'analisi verranno comunque accettati, ma il valore restituito non verrà modificato.

source: IS_URL is compatible with the Internationalized Domain Name (IDN) standard specified in ``RFC 3490``). As a result, URLs can be regular strings or unicode strings. If the URL's domain component (e.g. google.ca) contains non-US-ASCII letters, then the domain will be converted into Punycode (defined in ``RFC 3492``). IS_URL goes a bit beyond the standards, and allows non-US-ASCII characters to be present in the path and query components of the URL as well. These non-US-ASCII characters will be encoded. For example, space will be encoded as'%20'. The unicode character with hex code 0x4e86 will become '%4e%86'.
it: IS_URL è compatibile con lo standard IDN (Internationalized Domain Name) specificato in ''RFC 3490''). Di conseguenza, gli URL possono essere stringhe normali o stringhe Unicode. Se il componente di dominio dell'URL (ad esempio google.ca) contiene lettere non US-ASCII, il dominio verrà convertito in Punycode (definito in ''RFC 3492''). IS_URL va un po' oltre gli standard e consente la presenza di caratteri non US-ASCII anche nel percorso e nei componenti di query dell'URL. Questi caratteri non US-ASCII verranno codificati. Ad esempio, lo spazio verrà codificato come'%20'. Il carattere Unicode con codice esadecimale 0x4e86 diventerà '%4e%86'.

source: Examples:
it: Esempi:

source: This validators is for text fields that should contain HTML and may contain invalid tags (script, ember, object, iframe). It works by trying to sanitize the content and either provide an error (mode="error") or replacing the content with the sanitized one (mode="sanitize"). You can specify the error message, the mode, and provide your own sanitizer.
it: Questo validatore è per i campi di testo che devono contenere HTML e possono contenere tag non validi (script, ember, object, iframe). Funziona provando a disinfettare il contenuto e fornendo un errore (mode="error") o sostituendo il contenuto con quello disinfettato (mode="sanitize"). È possibile specificare il messaggio di errore, la modalità e fornire il proprio disinfettante.

source: If ``check`` is set to ``True`` it check whether the validated value is a slug (allowing only alphanumeric characters and non-repeated dashes).
it: Se ''check'' è impostato su ''True'' controlla se il valore convalidato è uno slug (che consente solo caratteri alfanumerici e trattini non ripetuti).

source: If ``check`` is set to ``False`` (default) it converts the input value to a slug.
it: Se ''check'' è impostato a ''False'' (default) converte il valore di input in uno slug.

source: This validator checks that a field value is in JSON format.
it: Questo validatore verifica che il valore di un campo sia in formato JSON.

source: If ``native_json`` is set to ``False`` (default) it converts the input value to the serialized value otherwise the input value is left unchanged.
it: Se ''native_json'' è impostato a ''False'' (default) converte il valore di input nel valore serializzato, altrimenti il valore di input viene lasciato invariato.

source: Date and time validators
it: Validatori di data e ora

source: This validator checks that a field value contains a valid time in the specified format.
it: Questo strumento di convalida verifica che il valore di un campo contenga un'ora valida nel formato specificato.

source: This validator checks that a field value contains a valid date in the specified format. It is good practice to specify the format using the translation operator, in order to support different formats in different locales.
it: Questo strumento di convalida verifica che il valore di un campo contenga una data valida nel formato specificato. È buona norma specificare il formato utilizzando l'operatore di traduzione, in modo da supportare formati diversi in impostazioni locali diverse.

source: For the full description on % directives look under the IS_DATETIME validator.
it: Per la descrizione completa delle % directive guarda sotto il validatore IS_DATETIME.

source: This validator checks that a field value contains a valid datetime in the specified format. It is good practice to specify the format using the translation operator, in order to support different formats in different locales.
it: Questo strumento di convalida verifica che il valore di un campo contenga un valore datetime valido nel formato specificato. È buona norma specificare il formato utilizzando l'operatore di traduzione, in modo da supportare formati diversi in impostazioni locali diverse.

source: The following symbols can be used for the format string (this shows the symbol, their meaning, and an example string):
it: Per la stringa di formato è possibile utilizzare i seguenti simboli (che mostrano il simbolo, il loro significato e una stringa di esempio):

source: Works very much like the previous validator but allows to specify a range:
it: Funziona in modo molto simile al validatore precedente, ma permette di specificare un intervallo:

source: Range, set and equality validators
it: Validatori di intervalli, insiemi e uguaglianza

source: Checks whether the validated value is equal to a given value (which can be a variable):
it: Controlla se il valore convalidato è uguale a un determinato valore (che può essere una variabile):

source: This validator checks that the content of the field value is neither None nor an empty string nor an empty list. A string value is checked for after a ``.strip()``.
it: Questo strumento di convalida verifica che il contenuto del valore del campo non sia né Nessuno, né una stringa vuota, né un elenco vuoto. Un valore stringa viene controllato dopo un ''.strip()''.

source: You can provide a regular expression for the matching of the empty string.
it: È possibile fornire un'espressione regolare per la corrispondenza della stringa vuota.

source: Deprecated, an alias for ``IS_EMPTY_OR`` described below.
it: Deprecato, un alias per ''IS_EMPTY_OR'' descritto di seguito.

source: Sometimes you need to allow empty values on a field along with other requirements. For example a field may be a date but it can also be empty. The ``IS_EMPTY_OR`` validator allows this:
it: A volte è necessario consentire valori vuoti in un campo insieme ad altri requisiti. Ad esempio, un campo può essere una data, ma può anche essere vuoto. Il validatore ''IS_EMPTY_OR'' permette questo:

source: An empty value is either None or an empty string or an empty list. A string value is checked for after a ``.strip()``.
it: Un valore vuoto è None o una stringa vuota o un elenco vuoto. Un valore stringa viene controllato dopo un ''.strip()''.

source: You can provide a regular expression for the matching of the empty string with the ``empty_regex`` argument (like for IS_NOT_EMPTY validator).
it: È possibile fornire un'espressione regolare per la corrispondenza della stringa vuota con l'argomento ''empty_regex'' (come per IS_NOT_EMPTY validatore).

source: You may also specify a value to be used for the empty case.
it: È inoltre possibile specificare un valore da utilizzare per il caso vuoto.

source: This validator let you express a general condition by means of a callable which takes a value to validate and returns the error message or ``None`` to accept the input value.
it: Questo validatore consente di esprimere una condizione generale per mezzo di un callable che prende un valore da convalidare e restituisce il messaggio di errore o ''None'' per accettare il valore di input.

source: **Notice** that returned message will not be translated if you do not arrange otherwise.
it: **Si noti** che il messaggio restituito non verrà tradotto se non si dispone diversamente.

source: For backward compatibility the condition may be expressed as a string containing a logical expression in terms of a variable value. It validates a field value if the expression evaluates to ``True``.
it: Per compatibilità con le versioni precedenti, la condizione può essere espressa come una stringa contenente un'espressione logica in termini di valore di variabile. Convalida un valore di campo se l'espressione restituisce ''True''.

source: One should first check that the value is an integer so that an exception will not occur.
it: Si dovrebbe prima controllare che il valore sia un numero intero in modo che non si verifichi un'eccezione.

source: It converts the input into a Python Decimal or generates an error if the decimal does not fall within the specified inclusive range. The comparison is made with Python Decimal arithmetic.
it: Converte l'input in un decimale Python o genera un errore se il decimale non rientra nell'intervallo inclusivo specificato. Il confronto viene effettuato con l'aritmetica decimale Python.

source: The minimum and maximum limits can be None, meaning no lower or upper limit, respectively.
it: I limiti minimo e massimo possono essere Nessuno, ovvero nessun limite inferiore o superiore, rispettivamente.

source: The ``dot`` argument is optional and allows you to internationalize the symbol used to separate the decimals.
it: L'argomento ''punto'' è facoltativo e permette di internazionalizzare il simbolo usato per separare i decimali.

source: Checks that the field value is a floating point number within a definite range, ``0 <= value <= 100`` in the following example:
it: Controlla che il valore del campo sia un numero a virgola mobile all'interno di un intervallo definito, ''0 <= valore <= 100'' nell'esempio seguente:

source: Checks that the field value is an integer number within a definite range,
it: Controlla che il valore del campo sia un numero intero all'interno di un intervallo definito,

source: ``0 <= value < 100`` in the following example:
it: ''0 <= valore < 100'' nell'esempio seguente:

source: This validator will automatically set the form field to an option field (ie, with a drop-down menu).
it: Questo validatore imposterà automaticamente il campo del modulo su un campo di opzione (ad esempio, con un menu a discesa).

source: ``IS_IN_SET`` checks that the field values are in a set:
it: ''IS_IN_SET'' controlla che i valori dei campi siano in un insieme:

source: The zero argument is optional and it determines the text of the option selected by default, an option which is not accepted by the ``IS_IN_SET`` validator itself. If you do not want a "choose one" option, set ``zero=None``.
it: L'argomento zero è opzionale e determina il testo dell'opzione selezionata di default, un'opzione che non è accettata dal validatore ''IS_IN_SET'' stesso. Se non si desidera un'opzione "scegline uno", impostare ''zero=None''.

source: The elements of the set can be combined with a numerical validator, as long as IS_IN_SET is first in the list. Doing so will force conversion by the last validator to the numerical type. So, IS_IN_SET can be followed by ``IS_INT_IN_RANGE`` (which converts the value to int) or ``IS_FLOAT_IN_RANGE`` (which converts the value to float). For example:
it: Gli elementi dell'insieme possono essere combinati con un validatore numerico, purché IS_IN_SET sia il primo nell'elenco. In questo modo verrà forzata la conversione da parte dell'ultimo validatore al tipo numerico. Quindi, IS_IN_SET può essere seguito da ''IS_INT_IN_RANGE'' (che converte il valore in int) o ''IS_FLOAT_IN_RANGE'' (che converte il valore in float). Per esempio:

source: Checkbox validation
it: Convalida delle caselle di controllo

source: To force a filled-in form checkbox (such as an acceptance of terms and conditions), use this:
it: Per forzare la casella di controllo di un modulo compilato (ad esempio l'accettazione di termini e condizioni), utilizzare quanto segue:

source: Dictionaries and tuples with IS_IN_SET
it: Dizionari e tuple con IS_IN_SET

source: You may also use a dictionary or a list of tuples to make the drop down list more descriptive:
it: È anche possibile utilizzare un dizionario o un elenco di tuple per rendere l'elenco a discesa più descrittivo:

source: Sorted options
it: Opzioni ordinate

source: To keep the options alphabetically sorted by their labels into the drop down list, use the ``sort`` argument with IS_IN_SET.
it: Per mantenere le opzioni in ordine alfabetico in base alle loro etichette nell'elenco a discesa, usare l'argomento ''ordina'' con IS_IN_SET.

source: ``IS_IN_SET`` and Tagging
it: ''IS_IN_SET'' e tagging

source: The ``IS_IN_SET`` validator has an optional attribute ``multiple=False``. If set to True, multiple values can be stored in one field. The field should be of type ``list:integer`` or ``list:string`` as discussed in [[Chapter 6 ../06#list-type-and-contains]]. An explicit example of tagging is discussed there. We strongly suggest using the jQuery multiselect plugin to render multiple fields.
it: Il validatore ''IS_IN_SET'' ha un attributo opzionale ''multiple=False''. Se impostato su True, è possibile memorizzare più valori in un campo. Il campo dovrebbe essere di tipo ''list:integer'' o ''list:string'' come discusso in [[Chapter 6 .. /06#tipo-elenco-e-contiene]]. Un esempio esplicito di tagging viene discusso qui. Si consiglia vivamente di utilizzare il plug-in jQuery multiselect per eseguire il rendering di più campi.

source: **Note** that when ``multiple=True``, ``IS_IN_SET`` will accept zero or more values, i.e. it will accept the field when nothing has been selected. ``multiple`` can also be a tuple of the form ``(a, b)`` where ``a`` and ``b`` are the minimum and (exclusive) maximum number of items that can be selected respectively.
it: **Nota** che quando ''multiple=True'', ''IS_IN_SET'' accetterà zero o più valori, cioè accetterà il campo quando non è stato selezionato nulla. ''Multiplo'' può anche essere una tupla della forma ''(a, b)'' dove ''a'' e ''b'' sono rispettivamente il numero minimo e massimo (esclusivo) di elementi che possono essere selezionati.

source: Complexity and security validators
it: Validatori di complessità e sicurezza

source: Enforces complexity requirements on a field (usually a password field).
it: Applica i requisiti di complessità a un campo (in genere un campo password).

source: Example:
it: Esempio:

source: where:
it: dove:

source: ``min`` is minimum length of the value
it: ''min'' è la lunghezza minima del valore

source: ``special`` is the minimum number of required special characters, by default special characters are any of the following ``^!!@#$%^&*()_+-=?<>,.:;{}[]|`` (you can customize these using ``specials = '...'``)
it: ''speciale'' è il numero minimo di caratteri speciali richiesti, per impostazione predefinita i caratteri speciali sono uno dei seguenti ''^!! @#$%^&*()_+-=?<>,.:; {} []|'' (puoi personalizzarli usando ''specials = '...''')

source: ``upper`` is the minimum number of upper case characters
it: ''maiuscolo'' è il numero minimo di caratteri maiuscoli

source: other accepted arguments are:
it: Altri argomenti accettati sono:

source: ``invalid`` for the list of forbidden characters, by default ``invalid=' "'``
it: ''invalid'' per l'elenco dei caratteri proibiti, di default ''invalid=' "'''

source: ``max`` for the maximum length of the value
it: ''max'' per la lunghezza massima del valore

source: ``lower`` for the minimum number of lower case characters
it: ''lower'' per il numero minimo di caratteri minuscoli

source: ``number`` for the minimum number of digit characters
it: ''number'' per il numero minimo di caratteri numerici

source: Obviously you can provide an ``error_message`` as for any other validator, although IS_STRONG is clever enough to provide a clear message to describe the validation failure.
it: Ovviamente è possibile fornire un ''error_message'' come per qualsiasi altro validatore, anche se IS_STRONG è abbastanza intelligente da fornire un messaggio chiaro per descrivere l'errore di validazione.

source: A special argument you can use is ``entropy``, that is a minimum value for the complexity of the value to accept (a number), experiment this with:
it: Un argomento speciale che puoi usare è ''entropia'', che è un valore minimo per la complessità del valore da accettare (un numero), sperimentalo con:

source: **Notice** that if the argument ``entropy`` is not given then IS_STRONG implicitly sets the following defaults: ``min = 8, upper = 1, lower = 1, number = 1, special = 1`` which otherwise are all sets to ``None``.
it: **Notate** che se l'argomento ''entropia'' non è dato allora IS_STRONG imposta implicitamente i seguenti valori predefiniti: ''min = 8, upper = 1, lower = 1, number = 1, special = 1'' che altrimenti sono tutti impostati su ''None''.

source: ``CRYPT``
it: ''CRIPTA''

source: This is also a filter. It performs a secure hash on the input and it is used to prevent passwords from being passed in the clear to the database.
it: Anche questo è un filtro. Esegue un hash sicuro sull'input e viene utilizzato per impedire che le password vengano passate in chiaro al database.

source: By default, CRYPT uses 1000 iterations of the pbkdf2 algorithm combined with SHA512 to produce a 20-byte-long hash. Old versions of web2py used md5 or HMAC+SHA512 depending on whether a key was specified or not.
it: Per impostazione predefinita, CRYPT utilizza 1000 iterazioni dell'algoritmo pbkdf2 combinato con SHA512 per produrre un hash lungo 20 byte. Le vecchie versioni di web2py usavano md5 o HMAC+SHA512 a seconda che fosse specificata o meno una chiave.

source: If a key is specified, CRYPT uses the HMAC algorithm. The key may contain a prefix that determines the algorithm to use with HMAC, for example SHA512:
it: Se viene specificata una chiave, CRYPT utilizza l'algoritmo HMAC. La chiave può contenere un prefisso che determina l'algoritmo da utilizzare con HMAC, ad esempio SHA512:
