Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: Virtual fields can be *lazy*; all they need to do is return a function and access it by calling the function:
it: I campi virtuali possono essere *pigri*; Tutto quello che devono fare è restituire una funzione e accedervi chiamando la funzione:

source: or shorter using a lambda function:
it: o più breve utilizzando una funzione lambda:

source: Joins and Relations
it: Join e relazioni

source: One to many relation
it: Relazione uno-amolti

source: To illustrate how to implement one to many relations with the DAL, define another table “thing” that refers to the table “person” which we redefine here:
it: Per illustrare come implementare le relazioni uno-a-molti con il DAL, definire un'altra tabella "cosa" che si riferisce alla tabella "persona" che ridefiniamo qui:

source: Table “thing” has two fields, the name of the thing and the owner of the thing. The “owner_id” field is a reference field, it is intended that the field reference the other table by its id. A reference type can be specified in two equivalent ways, either: ``Field('owner_id', 'reference person')`` or: ``Field('owner_id', db.person)``.
it: La tabella "cosa" ha due campi, il nome dell'oggetto e il proprietario dell'oggetto. Il campo "owner_id" è un campo di riferimento, si intende che il campo faccia riferimento all'altra tabella tramite il suo id. Un tipo di riferimento può essere specificato in due modi equivalenti, ''Field('owner_id', 'reference person')'' o: ''Field('owner_id', db.person)''.

source: The latter is always converted to the former. They are equivalent except in the case of lazy tables, self references or other types of cyclic references where the former notation is the only allowed notation.
it: Quest'ultimo viene sempre convertito nel primo. Sono equivalenti, tranne nel caso di tabelle lazy, autoriferimenti o altri tipi di riferimenti ciclici in cui la prima notazione è l'unica notazione consentita.

source: Now, insert three things, two owned by Alex and one by Bob:
it: Ora, inserisci tre cose, due di proprietà di Alex e una di Bob:

source: You can select as you did for any other table:
it: È possibile selezionare come è stato fatto per qualsiasi altra tabella:

source: Because a thing has a reference to a person, a person can have many things, so a record of table person now acquires a new attribute thing, which is a Set, that defines the things of that person. This allows looping over all persons and fetching their things easily:
it: Poiché una cosa ha un riferimento a una persona, una persona può avere molte cose, quindi un record di persona della tabella ora acquisisce un nuovo attributo cosa, che è un Insieme, che definisce le cose di quella persona. Questo permette di passare sopra tutte le persone e di recuperare facilmente le loro cose:

source: Inner join
it: Join interno

source: Another way to achieve a similar result is by using a join, specifically an INNER JOIN. py4web performs joins automatically and transparently when the query links two or more tables as in the following example:
it: Un altro modo per ottenere un risultato simile consiste nell'utilizzare un join, in particolare un INNER JOIN. py4web esegue i join in modo automatico e trasparente quando la query collega due o più tabelle, come nell'esempio seguente:

source: Observe that py4web did a join, so the rows now contain two records, one from each table, linked together. Because the two records may have fields with conflicting names, you need to specify the table when extracting a field value from a row. This means that while before you could do:
it: Si noti che py4web ha eseguito un join, quindi le righe ora contengono due record, uno per ogni tabella, collegati tra loro. Poiché i due record possono contenere campi con nomi in conflitto, è necessario specificare la tabella quando si estrae il valore di un campo da una riga. Ciò significa che mentre prima potevi fare:

source: and it was obvious whether this was the name of a person or a thing, in the result of a join you have to be more explicit and say:
it: ed era ovvio che questo fosse il nome di una persona o di una cosa, nel risultato di un join devi essere più esplicito e dire:

source: or:
it: oppure:

source: There is an alternative syntax for INNER JOINS:
it: Esiste una sintassi alternativa per INNER JOINS:

source: While the output is the same, the generated SQL in the two cases can be different. The latter syntax removes possible ambiguities when the same table is joined twice and aliased:
it: Anche se l'output è lo stesso, l'SQL generato nei due casi può essere diverso. Quest'ultima sintassi rimuove le possibili ambiguità quando la stessa tabella viene unita due volte e sottoposta a alias:

source: The value of ``join`` can be list of ``db.table.on(...)`` to join.
it: Il valore di ''join'' può essere list of ''db.table.on(...) '' per unirsi.

source: Left outer join
it: Giunto esterno sinistro

source: Notice that Carl did not appear in the list above because he has no things. If you intend to select on persons (whether they have things or not) and their things (if they have any), then you need to perform a LEFT OUTER JOIN. This is done using the argument “left” of the select. Here is an example:
it: Si noti che Carl non è apparso nell'elenco qui sopra perché non ha cose. Se si intende selezionare le persone (che abbiano o meno delle cose) e le loro cose (se ne hanno), allora è necessario eseguire un LEFT OUTER JOIN. Questa operazione viene eseguita utilizzando l'argomento "left" della selezione. Ecco un esempio:

source: where:
it: dove:

source: does the left join query. Here the argument of ``db.thing.on`` is the condition required for the join (the same used above for the inner join). In the case of a left join, it is necessary to be explicit about which fields to select.
it: Esegue la query di join a sinistra. Qui l'argomento di ''db.thing.on'' è la condizione richiesta per il join (lo stesso usato sopra per l'inner join). Nel caso di un left join, è necessario essere espliciti su quali campi selezionare.

source: Multiple left joins can be combined by passing a list or tuple of ``db.mytable.on(...)`` to the ``left`` parameter.
it: Più left join possono essere combinati passando una lista o una tupla di ''db.mytable.on(...) '' al parametro ''left''.

source: Grouping and counting
it: Raggruppamento e conteggio

source: When doing joins, sometimes you want to group rows according to certain criteria and count them. For example, count the number of things owned by every person. py4web allows this as well. First, you need a count operator. Second, you want to join the person table with the thing table by owner. Third, you want to select all rows (person + thing), group them by person, and count them while grouping:
it: Quando si eseguono join, a volte si desidera raggruppare le righe in base a determinati criteri e contarle. Ad esempio, conta il numero di cose possedute da ogni persona. py4web permette anche questo. Innanzitutto, è necessario un operatore di conteggio. In secondo luogo, si desidera unire la tabella delle persone con la tabella degli oggetti in base al proprietario. In terzo luogo, si desidera selezionare tutte le righe (persona + cosa), raggrupparle per persona e contarle durante il raggruppamento:

source: Notice the ``count`` operator (which is built-in) is used as a field. The only issue here is in how to retrieve the information. Each row clearly contains a person and the count, but the count is not a field of a person nor is it a table. So where does it go? It goes into the storage object representing the record with a key equal to the query expression itself.
it: Si noti che l'operatore ''count'' (che è incorporato) è usato come campo. L'unico problema qui è come recuperare le informazioni. Ogni riga contiene chiaramente una persona e il conteggio, ma il conteggio non è un campo di una persona né una tabella. Allora, dove va? Entra nell'oggetto di archiviazione che rappresenta il record con una chiave uguale all'espressione di query stessa.

source: The ``count`` method of the Field object has an optional ``distinct`` argument. When set to ``True`` it specifies that only distinct values of the field in question are to be counted.
it: Il metodo ''count'' dell'oggetto Field ha un argomento opzionale ''distinct''. Quando è impostato su ''True'' specifica che devono essere conteggiati solo i valori distinti del campo in questione.

source: Many to many relation
it: Relazione molti a molti

source: In the previous examples, we allowed a thing to have one owner but one person could have many things. What if Boat was owned by Alex and Curt? This requires a many-to-many relation, and it is realized via an intermediate table that links a person to a thing via an ownership relation.
it: Negli esempi precedenti, abbiamo permesso a una cosa di avere un proprietario, ma una persona potrebbe avere molte cose. E se Boat fosse di proprietà di Alex e Curt? Ciò richiede una relazione molti-a-molti e si realizza tramite una tabella intermedia che collega una persona a una cosa tramite una relazione di proprietà.

source: Here is how to do it:
it: Ecco come farlo:

source: the existing ownership relationship can now be rewritten as:
it: La relazione di proprietà esistente può ora essere riscritta come:

source: Now you can add the new relation that Curt co-owns Boat:
it: A questo punto è possibile aggiungere la nuova relazione di cui Curt è co-proprietario Boat:

source: Because you now have a three-way relation between tables, it may be convenient to define a new set on which to perform operations:
it: Poiché ora si dispone di una relazione a tre vie tra le tabelle, può essere utile definire un nuovo set su cui eseguire le operazioni:

source: Now it is easy to select all persons and their things from the new Set:
it: Ora è facile selezionare tutte le persone e le loro cose dal nuovo Set:

source: Similarly, you can search for all things owned by Alex:
it: Allo stesso modo, puoi cercare tutte le cose di proprietà di Alex:

source: and all owners of Boat:
it: e tutti i proprietari di Boat:

source: A lighter alternative to many-to-many relations is tagging, you can found an example of this in the next section. Tagging works even on database backends that do not support JOINs like the Google App Engine NoSQL.
it: Un'alternativa più semplice alle relazioni molti-a-molti è l'assegnazione di tag, di cui puoi trovare un esempio nella prossima sezione. La codifica funziona anche sui backend di database che non supportano i JOIN come Google App Engine NoSQL.

source: Self-Reference and aliases
it: Autoreferenzialità e alias

source: It is possible to define tables with fields that refer to themselves, here is an example:
it: E' possibile definire tabelle con campi che fanno riferimento a se stessi, ecco un esempio:

source: Notice that the alternative notation of using a table object as field type will fail in this case, because it uses a table before it is defined:
it: Si noti che la notazione alternativa di utilizzo di un oggetto tabella come tipo di campo avrà esito negativo in questo caso, perché utilizza una tabella prima che venga definita:

source: In general ``db.tablename`` and ``'reference tablename'`` are equivalent field types, but the latter is the only one allowed for self-references.
it: In generale ''db.tablename'' e '''reference tablename''' sono tipi di campo equivalenti, ma quest'ultimo è l'unico consentito per gli autoriferimenti.

source: When a table has a self-reference and you have to do join, for example to select a person and its father, you need an alias for the table. In SQL an alias is a temporary alternate name you can use to reference a table/column into a query (or other SQL statement).
it: Quando una tabella ha un autoreferenzialità e devi fare join, ad esempio per selezionare una persona e suo padre, hai bisogno di un alias per la tabella. In SQL, un alias è un nome alternativo temporaneo che è possibile utilizzare per fare riferimento a una tabella/colonna in una query (o in un'altra istruzione SQL).

source: With py4web you can make an alias for a table using the ``with_alias`` method. This works also for expressions, which means also for fields since ``Field`` is derived from ``Expression``.
it: Con py4web è possibile creare un alias per una tabella usando il metodo ''with_alias''. Questo funziona anche per le espressioni, il che significa anche per i campi poiché ''Field'' è derivato da ''Expression''.

source: Notice that we have chosen to make a distinction between: - “father_id”: the field name used in the table “person”; - “father”: the alias we want to use for the table referenced by the above field; this is communicated to the database; - “Father”: the variable used by py4web to refer to that alias.
it: Si noti che si è scelto di fare una distinzione tra: - "father_id": il nome del campo utilizzato nella tabella "persona"; - "father": l'alias che vogliamo usare per la tabella a cui fa riferimento il campo precedente; ciò viene comunicato alla banca dati; - "Father": la variabile usata da py4web per riferirsi a quell'alias.

source: The difference is subtle, and there is nothing wrong in using the same name for the three of them:
it: La differenza è sottile e non c'è niente di sbagliato nell'usare lo stesso nome per loro tre:

source: But it is important to have the distinction clear in order to build correct queries.
it: Ma è importante che la distinzione sia chiara per costruire query corrette.

source: Other operators
it: Altri operatori

source: py4web has other operators that provide an API to access equivalent SQL operators. Let’s define another table “log” to store security events, their event_time and severity, where the severity is an integer number.
it: py4web dispone di altri operatori che forniscono un'API per accedere a operatori SQL equivalenti. Definiamo un'altra tabella "log" per memorizzare gli eventi di sicurezza, la loro event_time e gravità, dove la gravità è un numero intero.

source: As before, insert a few events, a “port scan”, an “xss injection” and an “unauthorized login”. For the sake of the example, you can log events with the same event_time but with different severities (1, 2, and 3 respectively).
it: Come prima, inserisci alcuni eventi, una "scansione della porta", un'"iniezione xss" e un "accesso non autorizzato". Ai fini dell'esempio, è possibile registrare eventi con lo stesso event_time ma con gravità diverse (rispettivamente 1, 2 e 3).

source: ``like``, ``ilike``, ``regexp``, ``startswith``, ``endswith``, ``contains``, ``upper``, ``lower``
it: ''Mi piace'', ''Mi piace'', ''Regexp'', ''Inizia con'', ''Finisce con'', ''Contiene'', ''Superiore'', ''Inferiore''

source: Fields have a ``like`` operator that you can use to match strings:
it: I campi hanno un operatore ''like'' che puoi usare per trovare le stringhe:

source: Here “port%” indicates a string starting with “port”. The percent sign character, “%”, is a wild-card character that means “any sequence of characters”.
it: Qui "port%" indica una stringa che inizia con "port". Il carattere del segno di percentuale, "%", è un carattere jolly che indica "qualsiasi sequenza di caratteri".

source: The ``like`` operator maps to the LIKE word in ANSI-SQL. LIKE is case-sensitive in most databases, and depends on the collation of the database itself. The ``like`` method is hence case-sensitive but it can be made case-insensitive with
it: L'operatore ''like'' viene mappato alla parola LIKE in ANSI-SQL. LIKE fa distinzione tra maiuscole e minuscole nella maggior parte dei database e dipende dalle regole di confronto del database stesso. Il metodo ''like'' è quindi sensibile alle maiuscole e alle minuscole, ma può essere reso insensibile alle maiuscole e alle minuscole con

source: which is the same as using ``ilike``
it: che è lo stesso che usare ''ilike''

source: py4web also provides some shortcuts:
it: py4web fornisce anche alcune scorciatoie:

source: which are roughly equivalent respectively to
it: che sono all'incirca equivalenti rispettivamente a

source: Remember that ``contains`` has a special meaning for ``list:<type>`` fields, as discussed in :ref:`list_type and contains`.
it: Ricordate che ''contiene'' ha un significato speciale per i campi ''list:<type>'', come discusso in :ref:'list_type e contiene''.</type>

source: The ``contains`` method can also be passed a list of values and an optional boolean argument ``all`` to search for records that contain all values:
it: Al metodo ''contains'' può anche essere passata una lista di valori e un argomento booleano opzionale ''all'' per cercare i record che contengono tutti i valori:

source: or any value from the list
it: o qualsiasi valore dell'elenco

source: There is a also a ``regexp`` method that works like the ``like`` method but allows regular expression syntax for the look-up expression. It is only supported by MySQL, Oracle, PostgreSQL, SQLite, and MongoDB (with different degree of support).
it: C'è anche un metodo ''regexp'' che funziona come il metodo ''like'' ma permette la sintassi delle espressioni regolari per l'espressione di ricerca. È supportato solo da MySQL, Oracle, PostgreSQL, SQLite e MongoDB (con diversi gradi di supporto).

source: The ``upper`` and ``lower`` methods allow you to convert the value of the field to upper or lower case, and you can also combine them with the like operator:
it: I metodi ''upper'' e ''lower'' ti permettono di convertire il valore del campo in maiuscolo o minuscolo, e puoi anche combinarli con l'operatore like:

source: ``year``, ``month``, ``day``, ``hour``, ``minutes``, ``seconds``
it: ''anno'', ''mese'', ''giorno'', ''ora'', ''minuti'', ''secondi''

source: The date and datetime fields have ``day``, ``month`` and ``year`` methods. The datetime and time fields have ``hour``, ``minutes`` and ``seconds`` methods. Here is an example:
it: I campi date e datetime hanno i metodi ''day'', ''month'' e ''year''. I campi datetime e time hanno i metodi ''hour'', ''minutes'' e ''seconds''. Ecco un esempio:

source: ``belongs``
it: ''appartiene''

source: The SQL IN operator is realized via the ``belongs`` method which returns true when the field value belongs to the specified set (list or tuples):
it: L'operatore SQL IN è realizzato tramite il metodo ''belongs'' che restituisce true quando il valore del campo appartiene all'insieme specificato (lista o tuple):

source: The DAL also allows a nested select as the argument of the belongs operator. The only caveat is that the nested select has to be a ``_select``, not a ``select``, and only one field has to be selected explicitly, the one that defines the set.
it: Il DAL consente anche una selezione nidificata come argomento dell'operatore appartene. L'unica avvertenza è che la selezione nidificata deve essere un ''_select'', non un ''select'', e solo un campo deve essere selezionato esplicitamente, quello che definisce l'insieme.

source: In those cases where a nested select is required and the look-up field is a reference we can also use a query as argument. For example:
it: Nei casi in cui è richiesta una selezione nidificata e il campo di ricerca è un riferimento, è possibile utilizzare anche una query come argomento. Per esempio:

source: In this case it is obvious that the nested select only needs the field referenced by the ``db.thing.owner_id`` field so we do not need the more verbose ``_select`` notation.
it: In questo caso è ovvio che la selezione nidificata ha bisogno solo del campo a cui fa riferimento il campo ''db.thing.owner_id'', quindi non abbiamo bisogno della notazione ''_select'' più dettagliata.

source: A nested select can also be used as insert/update value but in this case the syntax is different:
it: Una selezione nidificata può essere utilizzata anche come valore di inserimento/aggiornamento, ma in questo caso la sintassi è diversa:

source: In this case ``lazy`` is a nested expression that computes the ``id`` of person “Jonathan”. The two lines result in one single SQL query.
it: In questo caso ''lazy'' è un'espressione nidificata che calcola l''id'' della persona ''Jonathan''. Le due righe generano un'unica query SQL.

source: ``sum``, ``avg``, ``min``, ``max`` and ``len``
it: ''Somma'', ''Media'', ''Min'', ''Max'' e ''Len''

source: Previously, you have used the ``count`` operator to count records. Similarly, you can use the ``sum`` operator to add (sum) the values of a specific field from a group of records. As in the case of count, the result of a sum is retrieved via the storage object:
it: In precedenza, è stato utilizzato l'operatore ''count'' per contare i record. Allo stesso modo, è possibile utilizzare l'operatore ''sum'' per aggiungere (sommare) i valori di un campo specifico da un gruppo di record. Come nel caso di count, il risultato di una somma viene recuperato tramite l'oggetto di archiviazione:

source: You can also use ``avg``, ``min``, and ``max`` to the average, minimum, and maximum value respectively for the selected records. For example:
it: È inoltre possibile utilizzare ''avg'', ''min'' e ''max'' rispettivamente per il valore medio, minimo e massimo per i record selezionati. Per esempio:

source: ``len`` computes the length of field’s value. It is generally used on string or text fields but depending on the back-end it may still work for other types too (boolean, integer, etc).
it: ''len'' calcola la lunghezza del valore del campo. Viene generalmente utilizzato su campi stringa o di testo, ma a seconda del back-end può funzionare anche per altri tipi (booleani, interi, ecc.).

source: Expressions can be combined to form more complex expressions. For example here we are computing the sum of the length of the event strings in the logs plus one:
it: Le espressioni possono essere combinate per formare espressioni più complesse. Ad esempio, qui calcoliamo la somma della lunghezza delle stringhe di evento nei log più uno:

source: Substrings
it: Sottostringhe

source: One can build an expression to refer to a substring. For example, we can group things whose name starts with the same three characters and select only one from each group:
it: È possibile creare un'espressione per fare riferimento a una sottostringa. Ad esempio, possiamo raggruppare le cose il cui nome inizia con gli stessi tre caratteri e selezionarne solo uno da ogni gruppo:

source: Default values with ``coalesce`` and ``coalesce_zero``
it: Valori predefiniti con ''coalesce'' e ''coalesce_zero''

source: There are times when you need to pull a value from database but also need a default values if the value for a record is set to NULL. In SQL there is a function, ``COALESCE``, for this. py4web has an equivalent ``coalesce`` method:
it: In alcuni casi è necessario estrarre un valore dal database, ma è anche necessario un valore predefinito se il valore di un record è impostato su NULL. In SQL c'è una funzione, ''COALESCE'', per questo. py4web ha un metodo ''coalesce'' equivalente:

source: Other times you need to compute a mathematical expression but some fields have a value set to None while it should be zero. ``coalesce_zero`` comes to the rescue by defaulting None to zero in the query:
it: Altre volte è necessario calcolare un'espressione matematica, ma alcuni campi hanno un valore impostato su None mentre dovrebbe essere zero. ''coalesce_zero'' viene in soccorso impostando il valore predefinito di None su zero nella query:

source: Exporting and importing data
it: Esportazione e importazione di dati

source: CSV (one Table at a time)
it: CSV (una tabella alla volta)

source: When a Rows object is converted to a string it is automatically serialized in CSV:
it: Quando un oggetto Rows viene convertito in una stringa, viene serializzato automaticamente in CSV:
