Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-11.po
Languages: it

source: Internationalization
it: Internazionalizzazione

source: Pluralize
it: Pluralizza

source: Pluralize is a Python library for Internationalization (i18n) and Pluralization (p10n).
it: Pluralize è una libreria Python per l'internazionalizzazione (i18n) e la pluralizzazione (p10n).

source: The library assumes a folder (for example “translations”) that contains files like:
it: La libreria presuppone una cartella (ad esempio "translations") che contiene file come:

source: Each file has the following structure, for example for Italian (it.json):
it: Ogni file ha la seguente struttura, ad esempio per l'italiano (it.json):

source: The top level keys are the expressions to be translated and the associated value/dictionary maps a number to a translation. Different translations correspond to different plural forms of the expression,
it: Le chiavi di primo livello sono le espressioni da tradurre e il valore/dizionario associato associa un numero a una traduzione. Traduzioni diverse corrispondono a diverse forme plurali dell'espressione,

source: Here is another example for the word “bed” in Czech
it: Ecco un altro esempio per la parola "letto" in ceco

source: To translate and pluralize a string “dog” one simply warps the string in the T operator as follows:
it: Per tradurre e pluralizzare una stringa "dog" è sufficiente deformare la stringa nell'operatore T come segue:

source: The string can contain multiple placeholders but the {n} placeholder is special because the variable called “n” is used to determine the pluralization by best match (max dict key <= n).
it: La stringa può contenere più segnaposto, ma il segnaposto {n} è speciale perché la variabile denominata "n" viene utilizzata per determinare la pluralizzazione in base alla migliore corrispondenza (max dict key <= n).

source: T(…) objects can be added together with each other and with string, like regular strings.
it: Gli oggetti T(...) possono essere sommati tra loro e con stringa, come le stringhe normali.

source: T.select(s) can parse a string s following the HTTP accept language format.
it: T.select(s) può analizzare una stringa s seguendo il formato della lingua di accettazione HTTP.

source: Update the translation files
it: Aggiornare i file di traduzione

source: Find all strings wrapped in T(…) in .py, .html, and .js files:
it: Trova tutte le stringhe racchiuse in T(...) nei file .py, .html e .js:

source: Add newly discovered entries in all supported languages
it: Aggiungere le voci appena individuate in tutte le lingue supportate

source: Add a new supported language (for example German, “de”)
it: Aggiungere una nuova lingua supportata (ad esempio tedesco, "de")

source: Make sure all languages contain the same origin expressions
it: Assicurarsi che tutte le lingue contengano le stesse espressioni di origine

source: Finally save the changes:
it: Infine, salva le modifiche:
