Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-07.po
Languages: it

source: When records are deleted, they are not really deleted. A deleted record is copied in the ``stored_item_archive`` table (like when it is modified) and the ``is_active`` field is set to False. By enabling record versioning py4web sets a ``common_filter`` on this table that hides all records in table ``stored_item`` where the ``is_active`` field is set to False. The ``is_active`` parameter in the ``_enable_record_versioning`` method allows to specify the name of the field used by the ``common_filter`` to determine if the field was deleted or not.
it: Quando i record vengono eliminati, non vengono effettivamente eliminati. Un record eliminato viene copiato nella tabella ''stored_item_archive'' (come quando viene modificato) e il campo ''is_active'' viene impostato su False. Abilitando il controllo delle versioni dei record, py4web imposta un ''common_filter'' su questa tabella che nasconde tutti i record nella tabella ''stored_item'' dove il campo ''is_active'' è impostato su False. Il parametro ''is_active'' nel metodo ''_enable_record_versioning'' permette di specificare il nome del campo usato dal ''common_filter'' per determinare se il campo è stato cancellato o meno.

source: Common filters
it: Filtri comuni

source: A common filter is a generalization of the above multi-tenancy idea. It provides an easy way to prevent repeating of the same query. Consider for example the following table:
it: Un filtro comune è una generalizzazione dell'idea di multi-tenancy di cui sopra. Fornisce un modo semplice per impedire la ripetizione della stessa query. Si consideri, ad esempio, la seguente tabella:

source: Any select, delete or update in this table, will include only public blog posts. The attribute can also be modified at runtime:
it: Qualsiasi selezione, eliminazione o aggiornamento in questa tabella includerà solo i post pubblici del blog. L'attributo può essere modificato anche in fase di esecuzione:

source: It serves both as a way to avoid repeating the “db.blog_post.is_public==True” phrase in each blog post search, and also as a security enhancement, that prevents you from forgetting to disallow viewing of non-public posts.
it: Serve sia come un modo per evitare di ripetere la frase "db.blog_post.is_public==True" in ogni ricerca di post del blog, sia come miglioramento della sicurezza, che ti impedisce di dimenticare di non consentire la visualizzazione di post non pubblici.

source: In case you actually do want items left out by the common filter (for example, allowing the admin to see non-public posts), you can either remove the filter:
it: Nel caso in cui si desideri effettivamente che gli elementi vengano esclusi dal filtro comune (ad esempio, consentendo all'amministratore di vedere i post non pubblici), è possibile rimuovere il filtro:

source: or ignore it:
it: o ignorarlo:

source: Note that common_filters are ignored by the appadmin interface.
it: Si noti che common_filters vengono ignorati dall'interfaccia appadmin.

source: Custom ``Field`` types
it: Tipi di ''Campo'' personalizzati

source: Aside for using ``filter_in`` and ``filter_out``, it is possible to define new/custom field types. For example, suppose that you want to define a custom type to store an IP address:
it: Oltre all'uso di ''filter_in'' e ''filter_out'', è possibile definire tipi di campo nuovi/personalizzati. Si supponga, ad esempio, di voler definire un tipo personalizzato per archiviare un indirizzo IP:

source: ``SQLCustomType`` is a field type factory. Its ``type`` argument must be one of the standard py4web types. It tells py4web how to treat the field values at the py4web level. ``native`` is the type of the field as far as the database is concerned. Allowed names depend on the database engine. ``encoder`` is an optional transformation function applied when the data is stored and ``decoder`` is the optional reverse transformation function.
it: ''SQLCustomType'' è una factory di tipi di campo. Il suo argomento ''type'' deve essere uno dei tipi standard py4web. Indica a py4web come trattare i valori dei campi a livello di py4web. ''nativo'' è il tipo di campo per quanto riguarda il database. I nomi consentiti dipendono dal motore di database. ''encoder'' è una funzione di trasformazione opzionale applicata quando i dati sono memorizzati e ''decoder'' è la funzione opzionale di trasformazione inversa.

source: This feature is marked as experimental because can make your code not portable across database engines.
it: Questa funzionalità è contrassegnata come sperimentale perché può rendere il codice non portabile tra i motori di database.

source: It does not work on Google App Engine NoSQL.
it: Non funziona su Google App Engine NoSQL.

source: Using DAL without define tables
it: Utilizzo di DAL senza tabelle definite

source: The DAL can be used from any Python program simply by doing this:
it: Il DAL può essere utilizzato da qualsiasi programma Python semplicemente facendo questo:

source: i.e. import the DAL, connect and specify the folder which contains the .table files (the app/databases folder).
it: ad esempio, importare il DAL, connettersi e specificare la cartella che contiene i file .table (la cartella app/databases).

source: To access the data and its attributes we still have to define all the tables we are going to access with ``db.define_table``.
it: Per accedere ai dati e ai loro attributi dobbiamo ancora definire tutte le tabelle a cui accederemo con ''db.define_table''.

source: If we just need access to the data but not to the py4web table attributes, we get away without re-defining the tables but simply asking py4web to read the necessary info from the metadata in the .table files:
it: Se abbiamo solo bisogno di accedere ai dati ma non agli attributi della tabella py4web, ce la caviamo senza ridefinire le tabelle ma semplicemente chiedendo a py4web di leggere le informazioni necessarie dai metadati nei file .table:

source: This allows us to access any db.table without need to re-define it.
it: Questo ci permette di accedere a qualsiasi db.table senza bisogno di ridefinirlo.

source: Distributed transaction
it: Transazione distribuita

source: At the time of writing this feature is only supported by PostgreSQL, MySQL and Firebird, since they expose API for two-phase commits.
it: Al momento in cui scriviamo questa funzionalità è supportata solo da PostgreSQL, MySQL e Firebird, poiché espongono API per commit in due fasi.

source: Assuming you have two (or more) connections to distinct PostgreSQL databases, for example:
it: Supponendo di avere due (o più) connessioni a database PostgreSQL distinti, ad esempio:

source: In your models or controllers, you can commit them concurrently with:
it: Nei modelli o nei controller, è possibile eseguirne il commit contemporaneamente a:

source: On failure, this function rolls back and raises an ``Exception``.
it: In caso di errore, questa funzione esegue il rollback e genera un''eccezione.

source: In controllers, when one action returns, if you have two distinct connections and you do not call the above function, py4web commits them separately. This means there is a possibility that one of the commits succeeds and one fails. The distributed transaction prevents this from happening.
it: Nei controller, quando un'azione viene restituita, se si hanno due connessioni distinte e non si chiama la funzione precedente, py4web le esegue il commit separatamente. Ciò significa che esiste la possibilità che uno dei commit abbia esito positivo e l'altro abbia esito negativo. La transazione distribuita impedisce che ciò accada.

source: Copy data from one db into another
it: Copiare i dati da un db all'altro

source: Consider the situation in which you have been using the following database:
it: Si consideri la situazione in cui è stato utilizzato il seguente database:

source: and you wish to move to another database using a different connection string:
it: e si desidera passare a un altro database usando una stringa di connessione diversa:

source: Before you switch, you want to move the data and rebuild all the metadata for the new database. We assume the new database to exist but we also assume it is empty.
it: Prima di eseguire il passaggio, è necessario spostare i dati e ricostruire tutti i metadati per il nuovo database. Si presuppone che il nuovo database esista, ma si presume anche che sia vuoto.

source: Gotchas
it: Trucchi

source: Note on new DAL and adapters
it: Nota sui nuovi DAL e adattatori

source: The source code of the Database Abstraction Layer was completely rewritten in 2010. While it stays backward compatible, the rewrite made it more modular and easier to extend. Here we explain the main logic.
it: Il codice sorgente del Database Abstraction Layer è stato completamente riscritto nel 2010. Pur rimanendo retrocompatibile, la riscrittura lo ha reso più modulare e più facile da estendere. Qui spieghiamo la logica principale.

source: The module “dal.py” defines, among other, the following classes.
it: Il modulo "dal.py" definisce, tra l'altro, le seguenti classi.

source: Their use has been explained in the previous sections, except for ``BaseAdapter``. When the methods of a ``Table`` or ``Set`` object need to communicate with the database they delegate to methods of the adapter the task to generate the SQL and or the function call.
it: Il loro utilizzo è stato spiegato nelle sezioni precedenti, ad eccezione di ''BaseAdapter''. Quando i metodi di un oggetto ''Table'' o ''Set'' hanno bisogno di comunicare con il database, delegano ai metodi dell'adapter il compito di generare l'SQL e/o la chiamata di funzione.

source: calls
it: Chiamate

source: which delegates the adapter by returning:
it: che delega l'adapter restituendo:

source: Here ``db.mytable._listify`` converts the dict of arguments into a list of ``(field,value)`` and calls the ``insert`` method of the ``adapter``. ``db._adapter`` does more or less the following:
it: Qui ''db.mytable._listify'' converte il dict di argomenti in una lista di ''(field,value)'' e chiama il metodo ''insert'' dell'''adattatore''. ''db._adapter'' fa più o meno quanto segue:

source: where the first line builds the query and the second executes it.
it: dove la prima riga compila la query e la seconda la esegue.

source: ``BaseAdapter`` defines the interface for all adapters.
it: ''BaseAdapter'' definisce l'interfaccia per tutti gli adattatori.

source: pyDAL at the moment of writing this book, contains the following adapters:
it: pyDAL, al momento della stesura di questo libro, contiene i seguenti adattatori:

source: which override the behavior of the ``BaseAdapter``.
it: che sovrascrivono il comportamento di ''BaseAdapter''.

source: Each adapter has more or less this structure:
it: Ogni adattatore ha più o meno questa struttura:

source: Looking at the various adapters as example should be easy to write new ones.
it: Guardando i vari adattatori come esempio dovrebbe essere facile scriverne di nuovi.

source: When ``db`` instance is created:
it: Quando viene creata l'istanza ''db'':

source: the prefix in the uri string defines the adapter. The mapping is defined in the following dictionary also in “dal.py”:
it: Il prefisso nella stringa URI definisce l'adapter. La mappatura è definita nel seguente dizionario anche in "dal.py":

source: jdbc:sqlite:memory
it: jdbc:sqlite:memoria

source: oracle
it: oracolo

source: spatialite:memory
it: spatialite:memoria

source: sqlite:memory
it: sqlite:memoria

source: the uri string is then parsed in more detail by the adapter itself. An updated list of adapters can be obtained as dictionary with
it: La stringa URI viene quindi analizzata in modo più dettagliato dall'adapter stesso. Un elenco aggiornato degli adattatori può essere ottenuto come dizionario con

source: For any adapter you can replace the driver with a different one globally (not thread safe):
it: Per qualsiasi adattatore è possibile sostituire il driver con uno diverso a livello globale (non thread-safe):

source: i.e. ``mysqldb`` has to be *that module* with a .connect() method. You can specify optional driver arguments and adapter arguments:
it: cioè ''mysqldb'' deve essere *quel modulo* con un metodo .connect(). È possibile specificare gli argomenti facoltativi del driver e gli argomenti dell'adattatore:

source: For recognized adapters you can also simply specify the name in the ``adapter_args``:
it: Per gli adattatori riconosciuti è anche possibile specificare semplicemente il nome nel ''adapter_args'':

source: SQLite does not support dropping and altering columns. That means that py4web migrations will work up to a point. If you delete a field from a table, the column will remain in the database but will be invisible to py4web. If you decide to reinstate the column, py4web will try re-create it and fail. In this case you must set ``fake_migrate=True`` so that metadata is rebuilt without attempting to add the column again. Also, for the same reason, SQLite is not aware of any change of column type. If you insert a number in a string field, it will be stored as string. If you later change the model and replace the type “string” with type “integer”, SQLite will continue to keep the number as a string and this may cause problem when you try to extract the data.
it: SQLite non supporta l'eliminazione e la modifica delle colonne. Ciò significa che le migrazioni py4web funzioneranno fino a un certo punto. Se elimini un campo da una tabella, la colonna rimarrà nel database ma sarà invisibile a py4web. Se decidi di ripristinare la colonna, py4web proverà a ricrearla e fallirà. In questo caso è necessario impostare ''fake_migrate=True'' in modo che i metadati vengano ricostruiti senza tentare di aggiungere nuovamente la colonna. Inoltre, per lo stesso motivo, SQLite non è a conoscenza di alcuna modifica del tipo di colonna. Se si inserisce un numero in un campo stringa, questo verrà memorizzato come stringa. Se in seguito si modifica il modello e si sostituisce il tipo "string" con il tipo "integer", SQLite continuerà a mantenere il numero come stringa e questo potrebbe causare problemi quando si tenta di estrarre i dati.

source: SQLite doesn’t have a boolean type. py4web internally maps booleans to a 1 character string, with ‘T’ and ‘F’ representing True and False. The DAL handles this completely; the abstraction of a true boolean value works well. But if you are updating the SQLite table with SQL directly, be aware of the py4web implementation, and avoid using 0 and 1 values.
it: SQLite non ha un tipo booleano. py4web mappa internamente i valori booleani a una stringa di 1 carattere, con 'T' e 'F' che rappresentano True e False. Il DAL gestisce completamente questo aspetto; L'astrazione di un vero valore booleano funziona bene. Ma se stai aggiornando la tabella SQLite direttamente con SQL, tieni presente l'implementazione py4web ed evita di usare i valori 0 e 1.

source: MySQL does not support multiple ALTER TABLE within a single transaction. This means that any migration process is broken into multiple commits. If something happens that causes a failure it is possible to break a migration (the py4web metadata are no longer in sync with the actual table structure in the database). This is unfortunate but it can be prevented (migrate one table at the time) or it can be fixed in the aftermath (revert the py4web model to what corresponds to the table structure in database, set ``fake_migrate=True`` and after the metadata has been rebuilt, set ``fake_migrate=False`` and migrate the table again).
it: MySQL non supporta più ALTER TABLE all'interno di una singola transazione. Ciò significa che qualsiasi processo di migrazione viene suddiviso in più commit. Se si verifica un errore che causa un errore, è possibile interrompere una migrazione (i metadati py4web non sono più sincronizzati con la struttura effettiva della tabella nel database). Questo è un peccato, ma può essere evitato (migrare una tabella alla volta) o può essere risolto in seguito (ripristinare il modello py4web a ciò che corrisponde alla struttura della tabella nel database, impostare ''fake_migrate=True'' e dopo che i metadati sono stati ricostruiti, impostare ''fake_migrate=False'' e migrare di nuovo la tabella).

source: Google SQL has the same problems as MySQL and more. In particular table metadata itself must be stored in the database in a table that is not migrated by py4web. This is because Google App Engine has a read-only file system. PY4WEB migrations in Google SQL combined with the MySQL issue described above can result in metadata corruption. Again, this can be prevented (by migrating the table at once and then setting migrate=False so that the metadata table is not accessed any more) or it can fixed in the aftermath (by accessing the database using the Google dashboard and deleting any corrupted entry from the table called ``py4web_filesystem``.
it: Google SQL ha gli stessi problemi di MySQL e altro ancora. In particolare, i metadati della tabella stessa devono essere memorizzati nel database in una tabella che non viene migrata da py4web. Questo perché Google App Engine ha un file system di sola lettura. Le migrazioni PY4WEB in Google SQL combinate con il problema MySQL descritto sopra possono causare il danneggiamento dei metadati. Anche in questo caso, questo può essere evitato (migrando la tabella in una sola volta e quindi impostando migrate=False in modo che la tabella dei metadati non sia più accessibile) o può essere risolto in seguito (accedendo al database utilizzando la dashboard di Google ed eliminando qualsiasi voce danneggiata dalla tabella chiamata ''py4web_filesystem''.

source: MSSQL < 2012 does not support the SQL OFFSET keyword. Therefore the database cannot do pagination. When doing a ``limitby=(a, b)`` py4web will fetch the first ``a + b`` rows and discard the first ``a``. This may result in a considerable overhead when compared with other database engines. If you’re using MSSQL >= 2005, the recommended prefix to use is ``mssql3://`` which provides a method to avoid the issue of fetching the entire non-paginated resultset. If you’re on MSSQL >= 2012, use ``mssql4://`` that uses the ``OFFSET ... ROWS ... FETCH NEXT ... ROWS ONLY`` construct to support natively pagination without performance hits like other backends. The ``mssql://`` uri also enforces (for historical reasons) the use of ``text`` columns, that are superseeded in more recent versions (from 2005 onwards) by ``varchar(max)``. ``mssql3://`` and ``mssql4://`` should be used if you don’t want to face some limitations of the - officially deprecated - ``text`` columns.
it: MSSQL < 2012 non supporta la parola chiave SQL OFFSET. Pertanto il database non può eseguire l'impaginazione. Quando si esegue un ''limitby=(a, b)'' py4web recupererà le prime righe ''a + b'' e scarterà la prima ''a''. Ciò può comportare un sovraccarico considerevole rispetto ad altri motori di database. Se si utilizza MSSQL >= 2005, il prefisso consigliato da usare è ''mssql3://'' che fornisce un metodo per evitare il problema di recuperare l'intero set di risultati non impaginato. Se sei su MSSQL >= 2012, usa ''mssql4://'' che usa ''OFFSET ... RIGHE... RECUPERA PROSSIMO ... ROWS ONLY'' per supportare l'impaginazione in modo nativo senza picchi di prestazioni come altri backend. L'uri ''mssql://'' impone anche (per ragioni storiche) l'uso di colonne ''text'', che sono sovrapposte nelle versioni più recenti (dal 2005 in poi) da ''varchar(max)''. ''mssql3://'' e ''mssql4://'' dovrebbero essere usati se non si vuole affrontare alcune limitazioni delle colonne ''text'' ufficialmente deprecate.

source: MSSQL has problems with circular references in tables that have ONDELETE CASCADE. This is an MSSQL bug and you work around it by setting the ondelete attribute for all reference fields to “NO ACTION”. You can also do it once and for all before you define tables:
it: MSSQL presenta problemi con i riferimenti circolari nelle tabelle con ONDELETE CASCADE. Si tratta di un bug di MSSQL e si aggira impostando l'attributo ondelete per tutti i campi di riferimento su "NO ACTION". È anche possibile farlo una volta per tutte prima di definire le tabelle:

source: MSSQL also has problems with arguments passed to the DISTINCT keyword and therefore while this works,
it: MSSQL ha anche problemi con gli argomenti passati alla parola chiave DISTINCT e quindi mentre questo funziona,

source: this does not
it: Ciò non

source: Oracle also does not support pagination. It does not support neither the OFFSET nor the LIMIT keywords. PY4WEB achieves pagination by translating a ``db(...).select(limitby=(a, b))`` into a complex three-way nested select (as suggested by official Oracle documentation). This works for simple select but may break for complex selects involving aliased fields and or joins.
it: Inoltre, Oracle non supporta l'impaginazione. Non supporta né le parole chiave OFFSET né quelle LIMIT. PY4WEB ottiene l'impaginazione traducendo un ''db(...). select(limitby=(a, b))'' in una complessa selezione nidificata a tre vie (come suggerito dalla documentazione ufficiale di Oracle). Questo funziona per la selezione semplice, ma può interrompersi per le selezioni complesse che coinvolgono campi e/o join con alias.

source: Google NoSQL (Datastore)
it: Google NoSQL (archivio dati)

source: Google NoSQL (Datastore) does not allow joins, left joins, aggregates, expression, OR involving more than one table, the ‘like’ operator searches in “text” fields.
it: Google NoSQL (Datastore) non consente join, left join, aggregazioni, espressioni, OR che coinvolgono più di una tabella, l'operatore 'like' cerca nei campi "text".

source: Transactions are limited and not provided automatically by py4web (you need to use the Google API ``run_in_transaction`` which you can look up in the Google App Engine documentation online).
it: Le transazioni sono limitate e non fornite automaticamente da py4web (è necessario utilizzare l'API di Google ''run_in_transaction'' che è possibile consultare nella documentazione di Google App Engine online).

source: Google also limits the number of records you can retrieve in each one query (1000 at the time of writing). On the Google datastore record IDs are integer but they are not sequential. While on SQL the “list:string” type is mapped into a “text” type, on the Google Datastore it is mapped into a ``ListStringProperty``. Similarly “list:integer” and “list:reference” are mapped into ``ListProperty``. This makes searches for content inside these fields types more efficient on Google NoSQL than on SQL databases.
it: Google limita anche il numero di record che puoi recuperare in ogni query (1000 al momento della scrittura). Nell'archivio dati di Google, gli ID dei record sono interi, ma non sequenziali. Mentre su SQL il tipo "list:string" è mappato in un tipo "text", su Google Datastore è mappato in un ''ListStringProperty''. Allo stesso modo, "list:integer" e "list:reference" sono mappati in ''ListProperty''. Ciò rende le ricerche di contenuti all'interno di questi tipi di campi più efficienti su Google NoSQL rispetto ai database SQL.
