Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-02.po
Languages: it

source: Help, resources and hints
it: Aiuto, risorse e suggerimenti

source: We've made our best to make PY4WEB simple and clean. But you know, modern web programming is a daunting task. It requires an open mind, able to jump frequently (without being lost!) from python to HTML to javascript to css and even database management. But don't be scared, in this manual we'll assist you side by side in this journey. And there are many other valuable resources that we're going to show you.
it: Abbiamo fatto del nostro meglio per rendere PY4WEB semplice e pulito. Ma si sa, la moderna programmazione web è un compito arduo. Richiede una mente aperta, in grado di saltare frequentemente (senza perdersi!) da python a HTML a javascript a css e persino alla gestione di database. Ma non spaventatevi, in questo manuale vi assisteremo fianco a fianco in questo viaggio. E ci sono molte altre risorse preziose che ti mostreremo.

source: Resources
it: Risorse

source: This manual
it: Questo manuale

source: This manual is the Reference Manual for py4web. It's available online at https://py4web.com/_documentation/static/index.html, where you'll also find the PDF and EBOOK version, in multiple languages. It written in RestructuredText and generated using Sphinx.
it: Questo manuale è il manuale di riferimento per py4web. È disponibile online su https://py4web.com/_documentation/static/index.html, dove troverai anche la versione PDF ed EBOOK, in più lingue. È scritto in RestructuredText e generato utilizzando Sphinx.

source: The Google group
it: Il gruppo Google

source: There is a dedicated mailing list hosted on Google Groups, see https://groups.google.com/g/py4web. This is the main source of discussions for developers and simple users. For any problem you should face, this is the right place to search for a hint or a solution.
it: Esiste una mailing list dedicata ospitata su Google Gruppi, vedi https://groups.google.com/g/py4web. Questa è la principale fonte di discussioni per gli sviluppatori e i semplici utenti. Per qualsiasi problema tu debba affrontare, questo è il posto giusto per cercare un suggerimento o una soluzione.

source: The Discord server
it: Il server Discord

source: For quick questions and chats you can also use the free `Discord server dedicated to py4web <https://discord.gg/xCzQ9KTk3W>`__. You could usually find many py4web developers hanging out in the channel.
it: Per domande veloci e chat puoi anche utilizzare il 'Server Discord dedicato a py4web <https://discord.gg/xCzQ9KTk3W>'__. Di solito potresti trovare molti sviluppatori py4web in giro per il canale.

source: Tutorials and video
it: Tutorial e video

source: There are many tutorials and videos available. Here are some of them:
it: Ci sono molti tutorial e video disponibili. Eccone alcune:

source: the `Learn Py4Web site <https://learn-py4web.github.io>`__ by Luca de Alfaro (with lots of excellent training videos)
it: il 'Learn Py4Web site <https://learn-py4web.github.io>'__ di Luca de Alfaro (con tanti ottimi video di formazione)

source: the free video `course 2020 by Luca de Alfaro <https://sites.google.com/a/ucsc.edu/luca/classes/cmps-183-hypermedia-and-the-web/cse-183-spring-2020>`__ at UC Santa Cruz
it: il video gratuito 'corso 2020 di Luca de Alfaro <https://sites.google.com/a/ucsc.edu/luca/classes/cmps-183-hypermedia-and-the-web/cse-183-spring-2020>'__ presso UC Santa Cruz

source: the `py4web blog app <https://github.com/agavgavi/py4web-blog-app.git>`__ by Andrew Gavgavian, which uses py4web to replicate the famous Corey Schafer's tutorial series on creating a blog app in Django
it: l'app per blog 'py4web <https://github.com/agavgavi/py4web-blog-app.git>'__ di Andrew Gavgavian, che utilizza py4web per replicare la famosa serie di tutorial di Corey Schafer sulla creazione di un'app per blog in Django

source: the `South Breeze Enterprises demo app <https://github.com/jpsteil/southbreeze>`__ by `Jim Steil <https://github.com/jpsteil>`__. It is built around the structure of the Microsoft Northwind database, but converted to SQLite. You can view the final result online `here <https://southbreeze.pythonbench.com>`__
it: l'app demo 'South Breeze Enterprises <https://github.com/jpsteil/southbreeze>'__ di 'Jim Steil <https://github.com/jpsteil>'__. È costruito intorno alla struttura del database Microsoft Northwind, ma convertito in SQLite. È possibile visualizzare il risultato finale online 'qui <https://southbreeze.pythonbench.com>'__

source: The sources on GitHub
it: I sorgenti su GitHub

source: Last but not least, py4web is Open Source, with a BSD v3 license, hosted on GitHub at https://github.com/web2py/py4web. This means that you can read, study and experiment with all of its internal details by yourself.
it: Ultimo ma non meno importante, py4web è Open Source, con licenza BSD v3, ospitato su GitHub all'indirizzo https://github.com/web2py/py4web. Ciò significa che puoi leggere, studiare e sperimentare da solo tutti i suoi dettagli interni.

source: Hints and tips
it: Suggerimenti e suggerimenti

source: This paragraph is dedicated to preliminary hints, suggestions and tips that could be helpful to know before starting to learn py4web.
it: Questo paragrafo è dedicato a suggerimenti preliminari, suggerimenti e suggerimenti che potrebbe essere utile conoscere prima di iniziare a imparare py4web.

source: Prerequisites
it: Prerequisiti

source: In order to understand py4web you need at least a basic python knowledge. There are many books, courses and tutorials available on the web - choose what's best for you. The python's decorators, in particular, are a milestone of any python web framework and you have to fully understand it.
it: Per capire py4web è necessaria almeno una conoscenza di base di python. Ci sono molti libri, corsi e tutorial disponibili sul web: scegli quello che è meglio per te. I decoratori di python, in particolare, sono una pietra miliare di qualsiasi framework web python e devi comprenderlo appieno.

source: A modern python workplace
it: Un moderno ambiente di lavoro python

source: In the following chapters you will start coding on your computer. We suggest you to setup a modern python workplace if you plan to do it efficiently and safely. Even for running simple examples and experimenting a little, we strongly suggest to use an **Integrated Development Environment** (IDE). This will make your programming experience much better, allowing syntax checking, linting and visual debugging. Nowadays there are two free and multi-platform main choices: Microsoft Visual Studio Code aka `VScode <https://code.visualstudio.com/>`__ and JetBrains `PyCharm <https://www.jetbrains.com/pycharm/>`__.
it: Nei capitoli seguenti inizierai a scrivere codice sul tuo computer. Ti consigliamo di configurare un moderno ambiente di lavoro python se prevedi di farlo in modo efficiente e sicuro. Anche per eseguire semplici esempi e sperimentare un po', si consiglia vivamente di utilizzare un **ambiente di sviluppo integrato** (IDE). Ciò renderà la tua esperienza di programmazione molto migliore, consentendo il controllo della sintassi, il linting e il debug visivo. Al giorno d'oggi ci sono due scelte principali gratuite e multipiattaforma: Microsoft Visual Studio Code aka 'VScode <https://code.visualstudio.com/>'__ e JetBrains 'PyCharm <https://www.jetbrains.com/pycharm/>'__.

source: When you'll start to deal with more complex programs and need reliability, we also suggest to:
it: Quando inizierai ad avere a che fare con programmi più complessi e avrai bisogno di affidabilità, ti suggeriamo anche di:

source: use virtual environments (also called **virtualenv**\, see `here <https://docs.python.org/3.7/tutorial/venv.html>`__ for an introduction). In a complex workplace this will avoid to be messed up with other python programs and modules
it: Usa ambienti virtuali (chiamati anche **virtualenv**\, vedi 'qui <https://docs.python.org/3.7/tutorial/venv.html>'__ per un'introduzione). In un ambiente di lavoro complesso questo eviterà di essere incasinato con altri programmi e moduli python

source: use **git** to keep track of your program's changes and save your changes in a safe place online (GitHub, GitLat, or Bitbucket).
it: usa **git** per tenere traccia delle modifiche del tuo programma e salvarle in un luogo sicuro online (GitHub, GitLat o Bitbucket).

source: use an editor with Syntax Highlighting. We highly recommend Visual Studio Code (VScode) or PyCharm.
it: utilizzare un editor con evidenziazione della sintassi. È consigliabile Visual Studio Code (VScode) o PyCharm.

source: Debugging py4web with VScode
it: Debug di py4web con VScode

source: It's quite simple to run and debug py4web within VScode.
it: È abbastanza semplice eseguire ed eseguire il debug di py4web all'interno di VScode.

source: If you have **installed py4web from source**, you just need to open the main py4web folder (not the apps folder!) with VScode and add:
it: Se hai **installato py4web dai sorgenti**, devi solo aprire la cartella principale py4web (non la cartella apps!) con VScode e aggiungere:

source: to the vscode ``launch.json`` configuration file. Note that if you're using Windows the "your_full_path_to_py4web.py" parameter must be written using forward slash only, like "C:/Users/your_name/py4web/py4web.py".
it: al file di configurazione ''launch.json'' VSConde. Si noti che se si utilizza Windows il parametro "your_full_path_to_py4web.py" deve essere scritto utilizzando solo la barra, ad esempio "C:/Users/your_name/py4web/py4web.py".

source: If you have instead **installed py4web from pip,** you need to:
it: Se invece hai **installato py4web da pip,** devi:

source: open the ``apps`` folder with VScode
it: apri la cartella ''apps'' con VScode

source: copy the standard `py4web.py launcher <https://github.com/web2py/py4web/blob/master/py4web.py>`__ inside it, but rename it to ``py4web-start.py`` in order to avoid import errors later:
it: Copiare il <https://github.com/web2py/py4web/blob/master/py4web.py> di avvio standard py4web.py'__ al suo interno, ma rinominarlo in ''py4web-start.py'' per evitare errori di importazione in seguito:

source: create / change the vscode ``launch.json`` configuration file:
it: Creare/modificare il file di configurazione ''launch.json'' VSConde:

source: In both cases, if you should get gevent errors you have to also add ``"gevent": true`` on the ``launch.json`` configuration file.
it: In entrambi i casi, se si dovessero ottenere errori gevent, è necessario aggiungere anche ''"gevent": true'' nel file di configurazione ''launch.json''.

source: Debugging py4web with PyCharm
it: Debug di py4web con PyCharm

source: In PyCharm, if you should get gevent errors you need to enable Settings | Build, Execution, Deployment | Python Debugger | Gevent compatible.
it: In PyCharm, se si dovessero ottenere errori gevent, è necessario abilitare Impostazioni | Compilazione, esecuzione, distribuzione | Debugger Python | Compatibile con Gevent.

source: How to contribute
it: Come contribuire

source: We need help from everyone: support our efforts! You can just participate in the Google group trying to answer other's questions, submit bugs using or create pull requests on the GitHub repository.
it: Abbiamo bisogno dell'aiuto di tutti: sostieni i nostri sforzi! Puoi semplicemente partecipare al gruppo di Google cercando di rispondere alle domande degli altri, inviare bug utilizzando o creare richieste pull sul repository GitHub.

source: If you wish to correct and expand this manual, or even translate it in a new foreign language, you can read all the needed information directly on the `specific README <https://github.com/web2py/py4web/blob/master/docs/README.md>`__ on GitHub.
it: Se desideri correggere ed espandere questo manuale, o anche tradurlo in una nuova lingua straniera, puoi leggere tutte le informazioni necessarie direttamente sul '<https://github.com/web2py/py4web/blob/master/docs/README.md> README specifico'__ su GitHub.

source: It's really simple! Just change the .RST files in the /doc folder and create a Pull Request on the GitHub repository at https://github.com/web2py/py4web - you can even do it within your browser. Once the PR is accepted, your changes will be written on the master branch, and will be reflected on the web pages / pdf / epub at the next output generation on the branch.
it: È davvero semplice! È sufficiente modificare il file . RST nella cartella /doc e creare una Pull Request sul repository GitHub a https://github.com/web2py/py4web - puoi anche farlo all'interno del tuo browser. Una volta accettata la richiesta pull, le modifiche verranno scritte nel ramo master e si rifletteranno nelle pagine Web / pdf / epub alla successiva generazione di output nel ramo.
