Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-06.po
Languages: it

source: The ``_scaffold`` application, in ``common.py`` defines two special convenience decorators:
it: L'applicazione ''_scaffold'', in ''common.py'' definisce due decoratori speciali:

source: and
it: e

source: They apply all of the decorators below (db, session, T, flash, auth), use a template with the same name as the function (.html), and also register a route with the name of action followed by the number of arguments of the action separated by a slash (/).
it: Applicano tutti i decoratori seguenti (db, session, T, flash, auth), usano un modello con lo stesso nome della funzione (.html) e registrano anche una route con il nome dell'azione seguito dal numero di argomenti dell'azione separati da una barra (/).

source: @unauthenticated does not require the user to be logged in.
it: @unauthenticated non richiede che l'utente abbia effettuato l'accesso.

source: @authenticated required the user to be logged in.
it: @authenticated richiedeva che l'utente effettuasse l'accesso.

source: They can be combined with (and precede) other ``@action.uses(...)`` but they should not be combined with ``@action(...)`` because they perform that function automatically.
it: Possono essere combinati con (e precedere) altri ''@action.usi(...) '' ma non devono essere combinati con ''@action(...) '' perché svolgono questa funzione automaticamente.
