Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-14.po
Languages: it

source: Grid
it: Griglia

source: py4web comes with a Grid object providing grid and CRUD (create, update and delete) capabilities. This allows you to quickly and safely provide an interface to your data. Since it's also highly customizable, it's the corner stone of most py4web's applications.
it: py4web viene fornito con un oggetto Grid che fornisce funzionalità grid e CRUD (create, update and delete). Ciò consente di fornire un'interfaccia ai dati in modo rapido e sicuro. Poiché è anche altamente personalizzabile, è la pietra angolare della maggior parte delle applicazioni di py4web.

source: Key features
it: Principali caratteristiche

source: Full CRUD with Delete Confirmation
it: CRUD completo con conferma dell'eliminazione

source: Click column heads for sorting - click again for DESC
it: Fare clic sulle intestazioni di colonna per l'ordinamento - fare nuovamente clic per DESC

source: Pagination control
it: Controllo dell'impaginazione

source: Built in Search (can use search_queries OR search_form)
it: Ricerca integrata (può utilizzare search_queries O search_form)

source: Action Buttons - with or without text
it: Pulsanti di azione - con o senza testo

source: Pre and Post Action (add your own buttons to each row)
it: Azione pre e post (aggiungi i tuoi pulsanti a ogni riga)

source: Grid dates in local format
it: Date della griglia in formato locale

source: Default formatting by type plus user overrides
it: Formattazione predefinita in base al tipo e alle sostituzioni dell'utente

source: There is an excellent grid tutorial made by Jim Steil on https://github.com/jpsteil/grid_tutorial. You're strongly advised to check it for any doubt and for finding many precious examples, hints & tips.
it: C'è un eccellente tutorial sulla griglia realizzato da Jim Steil su https://github.com/jpsteil/grid_tutorial. Si consiglia vivamente di controllarlo per qualsiasi dubbio e per trovare molti preziosi esempi, suggerimenti e suggerimenti.

source: Basic grid example
it: Esempio di griglia di base

source: In this simple example we will make a grid over the superhero table.
it: In questo semplice esempio creeremo una griglia sopra il tavolo dei supereroi.

source: Create a new minimal app called ``grid``. Change it with the following content.
it: Crea una nuova app minimale chiamata ''grid''. Modificalo con il seguente contenuto.

source: Add a new file templates/grid.html with this basic content:
it: Aggiungi un nuovo file templates/grid.html con questo contenuto di base:

source: Then restart py4web. If you browse to http://127.0.0.1:8000/grid/index you'll get this result:
it: Quindi riavvia py4web. Se si passa a http://127.0.0.1:8000/grid/index si otterrà questo risultato:

source: Its layout is quite minimal, but it's perfectly usable.
it: Il suo layout è piuttosto minimale, ma è perfettamente utilizzabile.

source: The main problem is that by default the **no.css** stylesheet is used, see `here <https://github.com/mdipierro/no.css/>`__. But we've not loaded it! Change the file templates/grid.html with this content:
it: Il problema principale è che di default viene usato il foglio di stile **no.css**, vedi 'qui <https://github.com/mdipierro/no.css/>'__. Ma non l'abbiamo caricato! Modificare il templates/grid.html del file con questo contenuto:

source: Then refresh the page.
it: Quindi aggiorna la pagina.

source: This is better now, with proper icons for Details, Edit and Delete actions.
it: Questo è meglio ora, con le icone appropriate per le azioni Dettagli, Modifica ed Elimina.

source: We can also think about using the **bulma.css**, see `here <https://bulma.io/>`__. In this case you need to change the grid object on __init__.py to:
it: Possiamo anche pensare di usare il **bulma.css**, vedi 'qui <https://bulma.io/>'__. In questo caso è necessario modificare l'oggetto griglia su __init__.py in:

source: Notice that in this case you need to import the corresponding python modules in advance (we've already done it on line 4 and 5 above). Instead if you use the default no.css style you don't need to manually import its style modules (and you even don't need the formstyle and grid_class_style parameters).
it: Si noti che in questo caso è necessario importare in anticipo i moduli python corrispondenti (lo abbiamo già fatto nelle righe 4 e 5 sopra). Invece, se si utilizza lo stile no.css predefinito, non è necessario importare manualmente i relativi moduli di stile (e non sono nemmeno necessari i parametri formstyle e grid_class_style).

source: You also have to change the file templates/grid.html with this content:
it: È inoltre necessario modificare il templates/grid.html del file con questo contenuto:

source: This is much better, isn't it?
it: Questo è molto meglio, non è vero?

source: These are just minimal examples for showing how ``grid`` works internally. Normally you should start from a copy of the standard ``_scaffold`` app, with all the Session and Authentication stuff already defined. Also, you should follow the standard rules for code, like placing the db definition inside models.py and so on. Using standards will make your code simpler, safer and more maintainable.
it: Questi sono solo esempi minimi per mostrare come funziona la ''griglia'' internamente. Normalmente si dovrebbe partire da una copia dell'app standard ''_scaffold'', con tutte le cose di Sessione e Autenticazione già definite. Inoltre, è necessario seguire le regole standard per il codice, come l'inserimento della definizione db all'interno models.py e così via. L'uso degli standard renderà il codice più semplice, sicuro e gestibile.

source: Also, do not use grid objects directly on the root action of an app, because it does not add the 'index' route. So, in this example if you browse to http://127.0.0.1:8000/grid the main page is displayed fine but any contained action will lead to a non existent page.
it: Inoltre, non usare gli oggetti griglia direttamente nell'azione radice di un'app, perché non aggiunge la route 'index'. Quindi, in questo esempio, se si passa a http://127.0.0.1:8000/grid la pagina principale viene visualizzata correttamente, ma qualsiasi azione contenuta porterà a una pagina inesistente.

source: In the :ref:`Advanced topics and examples` chapter you can find more examples, including a master/detail grid example written with **htmx**. And don't forget Jim Steil's detailed tutorial on https://github.com/jpsteil/grid_tutorial.
it: Nel capitolo :ref:'Argomenti ed esempi avanzati' puoi trovare altri esempi, incluso un esempio di griglia master/dettaglio scritto con **htmx**. E non dimenticate il tutorial dettagliato di Jim Steil su https://github.com/jpsteil/grid_tutorial.

source: The Grid object
it: L'oggetto Grid

source: path: the route of this request
it: path: il percorso di questa richiesta

source: query: pydal query to be processed
it: query: query pydal da elaborare

source: search_form: py4web FORM to be included as the search form. If search_form is passed in then the developer is responsible for applying the filter to the query passed in. This differs from search_queries
it: search_form: MODULO py4web da inserire come modulo di ricerca. Se search_form viene passato, lo sviluppatore è responsabile dell'applicazione del filtro alla query passata. Questo differisce da search_queries

source: search_queries: list of query lists to use to build the search form. Ignored if search_form is used
it: search_queries: elenco di elenchi di query da utilizzare per creare il modulo di ricerca. Ignorato se viene utilizzato search_form

source: columns: list of fields or columns to display on the list page, see the :ref:`Custom columns` paragraph later. If blank, the table will use all readable fields of the searched table
it: colonne: elenco di campi o colonne da visualizzare nella pagina dell'elenco, vedere il paragrafo :ref:'Colonne personalizzate' più avanti. Se vuoto, la tabella utilizzerà tutti i campi leggibili della tabella cercata

source: show_id: show the record id field on list page - default = False
it: show_id: mostra il campo dell'ID del record nella pagina dell'elenco - default = False

source: orderby: pydal orderby field or list of fields
it: orderby: campo Pydal orderby o elenco di campi

source: left: if joining other tables, specify the pydal left expression here
it: left: se si uniscono altre tabelle, specificare qui l'espressione pydal left

source: headings: list of headings to be used for list page - if not provided use the field label
it: Intestazioni: elenco delle intestazioni da utilizzare per la pagina elenco - se non fornita utilizzare l'etichetta del campo

source: create: URL to redirect to for creating records - set to True to automatically generate the URL - set to False to not display the button
it: create: URL a cui reindirizzare per la creazione di record - impostato su True per generare automaticamente l'URL - impostato su False per non visualizzare il pulsante

source: details: URL to redirect to for displaying records - set to True to automatically generate the URL - set to False to not display the button (*)
it: dettagli: URL a cui reindirizzare per la visualizzazione dei record - impostato su True per generare automaticamente l'URL - impostato su False per non visualizzare il pulsante (*)

source: editable: URL to redirect to for editing records - set to True to automatically generate the URL - set to False to not display the button (*)
it: editable: URL a cui reindirizzare per la modifica dei record - impostato su True per generare automaticamente l'URL - impostato su False per non visualizzare il pulsante (*)

source: deletable: URL to redirect to for deleting records - set to True to automatically generate the URL - set to False to not display the button (*)
it: deletable: URL a cui reindirizzare per l'eliminazione dei record - impostato su True per generare automaticamente l'URL - impostato su False per non visualizzare il pulsante (*)

source: validation: optional validation function to pass to create and edit forms
it: Validazione: funzione di convalida opzionale da passare per creare e modificare i moduli

source: pre_action_buttons: list of action_button instances to include before the standard action buttons
it: pre_action_buttons: elenco delle istanze di action_button da includere prima dei pulsanti di azione standard

source: post_action_buttons: list of action_button instances to include after the standard action buttons
it: post_action_buttons: elenco delle istanze di action_button da includere dopo i pulsanti di azione standard

source: auto_process: Boolean - whether or not the grid should be processed immediately. If False, developer must call grid.process() once all params are setup
it: auto_process: Booleano - indica se la griglia deve essere elaborata immediatamente. Se False, lo sviluppatore deve chiamare grid.process() una volta che tutti i parametri sono stati impostati

source: rows_per_page: number of rows to display per page. Default 15
it: rows_per_page: numero di righe da visualizzare per pagina. Predefinito 15

source: include_action_button_text: boolean telling the grid whether or not you want text on action buttons within your grid
it: include_action_button_text: booleano che indica alla griglia se si desidera o meno il testo sui pulsanti di azione all'interno della griglia

source: search_button_text: text to appear on the submit button on your search form
it: search_button_text: testo da visualizzare sul pulsante di invio del modulo di ricerca

source: formstyle: py4web Form formstyle used to style your form when automatically building CRUD forms
it: formstyle: py4web formstyle utilizzato per definire lo stile del modulo durante la creazione automatica di moduli CRUD

source: grid_class_style: GridClassStyle object used to override defaults for styling your rendered grid. Allows you to specify classes or styles to apply at certain points in the grid
it: grid_class_style: oggetto GridClassStyle utilizzato per eseguire l'override delle impostazioni predefinite per lo stile della griglia di cui è stato eseguito il rendering. Consente di specificare le classi o gli stili da applicare in determinati punti della griglia

source: T: optional pluralize object
it: T: oggetto pluralizzare facoltativo

source: (*) The parameters ``details``, ``editable`` and ``deletable`` can also take a **callable** that will be passed the current row of the grid. This is useful because you can then turn a button on or off depending on the values in the row. In other words, instead of providing a simple Boolean value you can use an expression like:
it: (*) I parametri ''details'', ''editable'' e ''deletable'' possono anche prendere un **callable** che verrà passato alla riga corrente della griglia. Ciò è utile perché è possibile attivare o disattivare un pulsante a seconda dei valori nella riga. In altre parole, invece di fornire un semplice valore booleano è possibile utilizzare un'espressione come:

source: See also :ref:`Using callable parameters` later on.
it: Vedere anche :ref:'Utilizzo di parametri richiamabili' più avanti.

source: Searching and filtering
it: Ricerca e filtraggio

source: There are two ways to build a search form:
it: Esistono due modi per creare un modulo di ricerca:

source: Provide a search_queries list
it: Fornisci un elenco di search_queries

source: Build your own custom search form
it: Crea il tuo modulo di ricerca personalizzato

source: If you provide a search_queries list to grid, it will:
it: Se si fornisce un elenco di search_queries alla griglia, si verificherà quanto segue:

source: build a search form. If more than one search query in the list, it will also generate a dropdown to select which search field to search against
it: Crea un modulo di ricerca. Se nell'elenco sono presenti più query di ricerca, verrà generato anche un menu a discesa per selezionare il campo di ricerca in base al quale eseguire la ricerca

source: gather filter values and filter the grid
it: Raccogliere i valori dei filtri e filtrare la griglia

source: However, if this doesn’t give you enough flexibility you can provide your own search form and handle all the filtering (building the queries) by yourself.
it: Tuttavia, se questo non ti dà abbastanza flessibilità, puoi fornire il tuo modulo di ricerca e gestire tutto il filtraggio (creazione delle query) da solo.

source: CRUD settings
it: Impostazioni CRUD

source: The grid provides CRUD (create, read, update and delete) capabilities utilizing py4web Form. You can turn off CRUD features by setting create/details/editable/deletable during grid instantiation.
it: La griglia fornisce funzionalità CRUD (creazione, lettura, aggiornamento ed eliminazione) utilizzando py4web Form. È possibile disattivare le funzionalità CRUD impostando create/details/editable/deletable durante la creazione di un'istanza della griglia.

source: Additionally, you can provide a separate URL to the create/details/editable/deletable parameters to bypass the auto-generated CRUD pages and handle the detail pages yourself.
it: Inoltre, è possibile fornire un URL separato ai parametri create/details/editable/deletable per ignorare le pagine CRUD generate automaticamente e gestire autonomamente le pagine di dettaglio.

source: Custom columns
it: Colonne personalizzate

source: If the grid does not involve a join but displays results from a single table you can specify a list of columns. Columns are highly customizable.
it: Se la griglia non prevede un join ma visualizza i risultati di una singola tabella, è possibile specificare un elenco di colonne. Le colonne sono altamente personalizzabili.

source: Notice in this example the first columns are regular fields, The fifth column has a header "Web Site" and consists of URL strings generated from the rows. The last column has a header "Go To" and generates actual clickable links using the ``A`` helper. This is the result:
it: Si noti che in questo esempio le prime colonne sono campi normali, mentre la quinta colonna ha un'intestazione "Sito Web" ed è costituita da stringhe URL generate dalle righe. L'ultima colonna ha un'intestazione "Vai a" e genera collegamenti effettivamente cliccabili utilizzando l'helper ''A''. Questo è il risultato:

source: Notice that we've also used the ``deletable`` parameter in order to disable and hide it for Batman only, as explained before.
it: Notate che abbiamo anche usato il parametro ''deletable'' per disabilitarlo e nasconderlo solo per Batman, come spiegato prima.

source: Do not define columns outside of the controller methods that use them, otherwise the structure of the table will change every time the user press the refresh button of the browser!
it: Non definire colonne al di fuori dei metodi del controller che le utilizzano, altrimenti la struttura della tabella cambierà ogni volta che l'utente preme il pulsante di aggiornamento del browser!

source: The reason is that each time the grid displays, it modifies the 'columns' variable (in the grid) by adding the action buttons to it. So, if columns are defined outside of the controller method, it just keeps adding the actions column.
it: Il motivo è che ogni volta che la griglia viene visualizzata, modifica la variabile 'colonne' (nella griglia) aggiungendo i pulsanti di azione ad essa. Pertanto, se le colonne sono definite all'esterno del metodo controller, continua ad aggiungere la colonna actions.

source: Using templates
it: Uso dei modelli

source: Use the following to render your grid or CRUD forms in your templates.
it: Utilizza quanto segue per eseguire il rendering della griglia o dei moduli CRUD nei modelli.

source: Display the grid or a CRUD Form
it: Visualizzare la griglia o un modulo CRUD

source: You can customize the CRUD form layout like a normal form (see :ref:`Custom forms`). So you can use the following structure:
it: È possibile personalizzare il layout del modulo CRUD come un normale modulo (vedere :ref:'Moduli personalizzati'). È quindi possibile utilizzare la seguente struttura:

source: But notice that when handling custom form layouts you need to know if you are displaying the grid or a form. Use the following to decide:
it: Tuttavia, quando si gestiscono layout di moduli personalizzati, è necessario sapere se si sta visualizzando la griglia o un modulo. Per decidere, utilizzare quanto segue:

source: Customizing style
it: Personalizzazione dello stile

source: You can provide your own formstyle or grid classes and style to grid.
it: È possibile fornire classi formstyle o grid personalizzate e applicare uno stile alla griglia.

source: formstyle is the same as a Form formstyle, used to style the CRUD forms.
it: formstyle è lo stesso di un formstyle Form, utilizzato per definire lo stile dei form CRUD.

source: grid_class_style is a class that provides the classes and/or styles used for certain portions of the grid.
it: grid_class_style è una classe che fornisce le classi e/o gli stili utilizzati per determinate parti della griglia.

source: The default ``GridClassStyle`` - based on **no.css**, primarily uses styles to modify the layout of the grid. We've already seen that it's possible to use other class_style, in particular ``GridClassStyleBulma``.
it: L'impostazione predefinita ''GridClassStyle'' - basata su **no.css**, utilizza principalmente gli stili per modificare il layout della griglia. Abbiamo già visto che è possibile usare altri class_style, in particolare ''GridClassStyleBulma''.

source: You can even build your own class_style to be used with the css framework of your choice. Unfortunately, one based on **bootstrap** is still missing.
it: Puoi anche creare il tuo class_style da utilizzare con il framework css di tua scelta. Sfortunatamente, ne manca ancora uno basato su **bootstrap**.

source: Custom Action Buttons
it: Pulsanti di azione personalizzati

source: As with web2py, you can add additional buttons to each row in your grid. You do this by providing ``pre_action_buttons`` or ``post_action_buttons`` to the Grid **init** method.
it: Come con web2py, è possibile aggiungere ulteriori pulsanti ad ogni riga della griglia. A tale scopo, è necessario fornire ''pre_action_buttons'' o ''post_action_buttons'' al metodo Grid **init**.

source: ``pre_action_buttons`` - list of action_button instances to include before the standard action buttons
it: ''pre_action_buttons'' - elenco delle istanze di action_button da includere prima dei pulsanti di azione standard

source: ``post_action_buttons`` - list of action_button instances to include after the standard action buttons
it: ''post_action_buttons'' - elenco di action_button istanze da includere dopo i pulsanti di azione standard

source: You can build your own Action Button class to pass to pre/post action buttons based on the template below (this is not provided with py4web).
it: È possibile creare la propria classe Action Button da passare ai pulsanti di azione pre/post in base al modello seguente (questo non è fornito con py4web).

source: Sample Action Button Class
it: Classe Action Button di esempio

source: url: the page to navigate to when the button is clicked
it: URL: la pagina a cui accedere quando si fa clic sul pulsante

source: text: text to display on the button
it: Testo: testo da visualizzare sul pulsante

source: icon: the font-awesome icon to display before the text, for example "fa-calendar"
it: icona: l'icona font-awesome da visualizzare prima del testo, ad esempio "fa-calendar"

source: additional_classes: a space-separated list of classes to include on the button element
it: additional_classes: un elenco separato da spazi di classi da includere nell'elemento button

source: additional_styles: a string containing additional styles to add to the button
it: additional_styles: una stringa contenente stili aggiuntivi da aggiungere al pulsante

source: override_classes: a space-separated list of classes to place on the control that will replace the default classes
it: override_classes: un elenco separato da spazi di classi da inserire nel controllo che sostituirà le classi predefinite

source: override_styles: a string containing the styles to be applied to the control
it: override_styles: stringa contenente gli stili da applicare al controllo

source: message: confirmation message to display if ‘confirmation’ class is added to additional classes
it: message: messaggio di conferma da visualizzare se la classe 'confirmation' viene aggiunta ad altre classi

source: append_id: if True, add id_field_name=id_value to the url querystring for the button
it: append_id: se True, aggiungi id_field_name=id_value alla stringa di query dell'url per il pulsante

source: name: the name to apply to the control
it: name: il nome da applicare al controllo

source: ignore_attribute_plugin: boolean - respect the attribute plugin specified on the grid or ignore it
it: ignore_attribute_plugin: booleano: rispetta il plug-in dell'attributo specificato nella griglia o ignoralo

source: attrs: additional attributes to apply to the control
it: attrs: attributi aggiuntivi da applicare al controllo

source: After defining the custom GridActionButton class, you need to define your Action buttons:
it: Dopo aver definito la classe GridActionButton personalizzata, è necessario definire i pulsanti Azione:

source: Finally, you need to reference them in the Grid definition:
it: Infine, è necessario fare riferimento a loro nella definizione della griglia:

source: Using callable parameters
it: Utilizzo di parametri richiamabili
