Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-14.po
Languages: it

source: A recent improvement to py4web allows you to pass a **callable** instead of a GridActionButton. This allow you to more easily change the behaviour of standard and custom Actions.
it: Un recente miglioramento di py4web consente di passare un **callable** invece di un GridActionButton. Ciò consente di modificare più facilmente il comportamento delle azioni standard e personalizzate.

source: Callable can be used with:
it: Callable può essere utilizzato con:

source: details
it: dettagli

source: editable
it: modificabile

source: deletable
it: eliminabile

source: Example usage:
it: Esempio di utilizzo:

source: Reference Fields
it: Campi di riferimento

source: When displaying fields in a PyDAL table, you sometimes want to display a more descriptive field than a foreign key value. There are a couple of ways to handle that with the py4web grid.
it: Quando si visualizzano i campi in una tabella PyDAL, a volte si desidera visualizzare un campo più descrittivo rispetto a un valore di chiave esterna. Ci sono un paio di modi per gestirlo con la griglia py4web.

source: ``filter_out`` on PyDAL field definition - here is an example of a foreign key field
it: ''filter_out'' sulla definizione del campo PyDAL - ecco un esempio di campo di chiave esterna

source: This will display the company name in the grid instead of the company ID
it: Verrà visualizzato il nome dell'azienda nella griglia invece dell'ID dell'azienda

source: The downfall of using this method is that sorting and filtering are based on the company field in the employee table and not the name of the company
it: Lo svantaggio dell'utilizzo di questo metodo è che l'ordinamento e il filtro si basano sul campo della società nella tabella dei dipendenti e non sul nome della società

source: ``left join`` and specify fields from joined table - specified on the left parameter of Grid instantiation
it: ''left join'' e specificare i campi dalla tabella unita - specificato nel parametro left dell'istanza Grid

source: You can specify a standard PyDAL left join, including a list of joins to consider. Now the company name field can be included in your fields list can be clicked on and sorted.
it: È possibile specificare un left join PyDAL standard, incluso un elenco di join da considerare. Ora il campo del nome dell'azienda può essere incluso nell'elenco dei campi, può essere cliccato e ordinato.

source: Also you can specify a query such as:
it: Inoltre, è possibile specificare una query come:

source: This method allows you to sort and filter, but doesn’t allow you to combine fields to be displayed together as the filter_out method would
it: Questo metodo consente di ordinare e filtrare, ma non consente di combinare i campi da visualizzare insieme come farebbe il metodo filter_out

source: You need to determine which method is best for your use case understanding the different grids in the same application may need to behave differently.
it: È necessario determinare quale metodo è il migliore per il proprio caso d'uso, per comprendere le diverse griglie nella stessa applicazione potrebbe essere necessario comportarsi in modo diverso.
