Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-06.po
Languages: it

source: Fixtures
it: Calendario

source: A fixture is defined as “a piece of equipment or furniture which is fixed in position in a building or vehicle”. In our case a fixture is something attached to the action that processes an HTTP request in order to produce a response.
it: Un apparecchio è definito come "un'apparecchiatura o un mobile fissato in posizione in un edificio o in un veicolo". Nel nostro caso, un fixture è qualcosa collegato all'azione che elabora una richiesta HTTP per produrre una risposta.

source: When processing any HTTP requests there are some optional operations we may want to perform. For example parse the cookie to look for session information, commit a database transaction, determine the preferred language from the HTTP header and lookup proper internationalization, etc. These operations are optional. Some actions need them and some actions do not. They may also depend on each other. For example, if sessions are stored in the database and our action needs it, we may need to parse the session cookie from the HTTP header, pick up a connection from the database connection pool, and - after the action has been executed - save the session back in the database if data has changed.
it: Durante l'elaborazione di qualsiasi richiesta HTTP, è possibile eseguire alcune operazioni facoltative. Ad esempio, analizzare il cookie per cercare informazioni sulla sessione, eseguire il commit di una transazione di database, determinare la lingua preferita dall'intestazione HTTP e cercare l'internazionalizzazione corretta, ecc. Queste operazioni sono facoltative. Alcune azioni ne hanno bisogno e altre no. Possono anche dipendere l'uno dall'altro. Ad esempio, se le sessioni sono archiviate nel database e l'azione lo richiede, potrebbe essere necessario analizzare il cookie di sessione dall'intestazione HTTP, prelevare una connessione dal pool di connessioni del database e, dopo l'esecuzione dell'azione, salvare nuovamente la sessione nel database se i dati sono stati modificati.

source: PY4WEB fixtures provide a mechanism to specify what an action needs so that py4web can accomplish the required tasks (and skip non required ones) in the most efficient manner. Fixtures make the code efficient and reduce the need for boilerplate code.
it: I dispositivi PY4WEB forniscono un meccanismo per specificare ciò di cui un'azione ha bisogno in modo che py4web possa eseguire le attività richieste (e saltare quelle non richieste) nel modo più efficiente. I dispositivi rendono il codice efficiente e riducono la necessità di codice boilerplate.

source: PY4WEB fixtures are similar to WSGI middleware and BottlePy plugin except that they apply to individual actions, not to all of them, and can depend on each other.
it: I dispositivi PY4WEB sono simili al middleware WSGI e al plug-in BottlePy, tranne per il fatto che si applicano alle singole azioni, non a tutte, e possono dipendere l'una dall'altra.

source: PY4WEB comes with some pre-defined fixtures: sessions, url signing and flash messages will be fully explained in this chapter. Database connections, internationalization, authentication, and templates will instead be just outlined here since they have dedicated chapters.
it: PY4WEB viene fornito con alcuni fixture predefinite: sessioni, firme url e messaggi flash saranno spiegati dettagliatamente in questo capitolo. Le connessioni ai database, l'internazionalizzazione, l'autenticazione e i modelli saranno invece solo delineati qui poiché hanno capitoli dedicati.

source: The developer is also free to add fixtures, for example, to handle a third party template language or third party session logic; this is explained later in the :ref:`Custom fixtures` paragraph.
it: Lo sviluppatore è anche libero di aggiungere fixture, ad esempio, per gestire un linguaggio di modelli di terze parti o una logica di sessione di terze parti; questo è spiegato più avanti nel paragrafo :ref:'Fixtures personalizzati'.

source: Using Fixtures
it: Utilizzo degli impianti

source: As we've seen in the previous chapter, fixtures are the arguments of the decorator ``@action.uses(...)``. You can specify multiple fixtures in one decorator or you can have multiple decorators.
it: Come abbiamo visto nel capitolo precedente, gli infissi sono gli argomenti del decoratore ''@action.uses(...) ``. È possibile specificare più staffaggi in un elemento Decorator oppure è possibile disporre di più elementi Decorator.

source: Also, fixtures can be applied in groups. For example:
it: Inoltre, gli impianti possono essere applicati in gruppi. Per esempio:

source: Then you can apply all of them at once with:
it: Quindi puoi applicarli tutti in una volta con:

source: Usually, it's not important the order you use to specify the fixtures, because py4web knows well how to manage them if they have explicit dependencies. For example auth depends explicitly on db and session and flash, so you do not even needs to list them.
it: Di solito, non è importante l'ordine che usi per specificare le fixture, perché py4web sa bene come gestirle se hanno dipendenze esplicite. Ad esempio, l'autenticazione dipende in modo esplicito da db e session e flash, quindi non è nemmeno necessario elencarli.

source: But there is an important exception: the Template fixture must always be the **first one**. Otherwise, it will not have access to various things it should need from the other fixtures, especially Inject() and Flash() that we'll see later.
it: Ma c'è un'importante eccezione: l'apparecchio Template deve essere sempre il **primo**. In caso contrario, non avrà accesso a varie cose di cui dovrebbe aver bisogno dagli altri dispositivi, in particolare Inject() e Flash() che vedremo più avanti.

source: The Template fixture
it: Il dispositivo Template

source: PY4WEB by default uses the YATL template language and provides a fixture for it.
it: PY4WEB per impostazione predefinita utilizza il linguaggio dei modelli YATL e fornisce un fixture per esso.

source: Note: this example assumes that you created the application from the scaffolding app, so that the template index.html is already created for you.
it: Nota: questo esempio presuppone che l'applicazione sia stata creata dall'app di scaffolding in modo che il modello index.html sia già stato creato automaticamente.

source: The Template object is a Fixture. It transforms the ``dict()`` returned by the action into a string by using the ``index.html`` template file. In a later chapter we will provide an example of how to define a custom fixture to use a different template language, for example Jinja2.
it: L'oggetto Template è un Fixture. Trasforma il ''dict()'' restituito dall'azione in una stringa usando il file modello ''index.html''. In un capitolo successivo forniremo un esempio di come definire un dispositivo personalizzato per utilizzare un linguaggio di template diverso, ad esempio Jinja2.

source: Notice that since the use of templates is very common and since, most likely, every action uses a different template, we provide some syntactic sugar, and the two following lines are equivalent:
it: Si noti che, poiché l'uso dei template è molto comune e poiché, molto probabilmente, ogni azione utilizza un template diverso, forniamo un po' di zucchero sintattico, e le due righe seguenti sono equivalenti:

source: Also notice that py4web template files are cached in RAM. The py4web caching object is described later on :ref:`Caching and Memoize`.
it: Si noti inoltre che i file modello py4web sono memorizzati nella cache della RAM. L'oggetto di caching py4web è descritto più avanti in :ref:'Caching and Memoize'.

source: If you use multiple fixtures, always place the template as the **first one**.
it: Se si utilizzano più dispositivi, posizionare sempre la dima come **prima**.

source: For example:
it: Ad esempio:

source: Be careful if you read old documentations that this need was **exactly the opposite** in early py4web experimental versions (until February 2022)!
it: Fate attenzione se leggete vecchie documentazioni che questa necessità era **esattamente l'opposto** nelle prime versioni sperimentali di py4web (fino a febbraio 2022)!

source: As we've already seen in the last paragraph, you can combine many fixtures in one decorator. But you can even extend this decorator by passing different templates as needed. For example:
it: Come abbiamo già visto nell'ultimo paragrafo, è possibile combinare molti apparecchi in un unico decoratore. Ma puoi anche estendere questo decoratore passando diversi modelli in base alle esigenze. Per esempio:

source: And then:
it: E poi:

source: This syntax has no performance implications: it's just for avoiding to replicate a decorator logic in multiple places. In this way you'll have cleaner code and if needed you'll be able to change it later in one place only.
it: Questa sintassi non ha implicazioni sulle prestazioni: serve solo per evitare di replicare una logica Decorator in più posizioni. In questo modo avrai un codice più pulito e, se necessario, sarai in grado di modificarlo in seguito in un solo posto.

source: The Inject fixture
it: Il dispositivo Inject

source: The Inject fixture is used for passing variables (and even python functions) to templates. Here is a simple example:
it: Il dispositivo Inject viene utilizzato per passare variabili (e persino funzioni python) ai modelli. Ecco un semplice esempio:

source: It will be explained later on :ref:`Using Inject` in the YATL chapter.
it: Verrà spiegato più avanti :ref:'Using Inject' nel capitolo YATL.

source: The Translator fixture
it: L'apparecchio Translator

source: Here is an example of usage:
it: Di seguito è riportato un esempio di utilizzo:

source: The string `hello world` will be translated based on the internationalization file in the specified “translations” folder that best matches the HTTP ``accept-language`` header.
it: La stringa 'hello world' verrà tradotta in base al file di internazionalizzazione nella cartella "translations" specificata che meglio corrisponde all'intestazione HTTP ''accept-language''.

source: Here ``Translator`` is a py4web class that extends ``pluralize.Translator`` and also implements the ``Fixture`` interface.
it: Qui ''Translator'' è una classe py4web che estende ''pluralize. Traduttore'' e implementa anche l'interfaccia ''Fixture''.

source: We can easily combine multiple fixtures. Here, as example, we make action with a counter that counts “visits”.
it: Possiamo facilmente combinare più apparecchi. Qui, ad esempio, facciamo un'azione con un contatore che conta le "visite".

source: Now create the following translation file ``translations/en.json``:
it: Ora crea il seguente file di traduzione ''translations/en.json'':

source: When visiting this site with the browser language preference set to English and reloading multiple times you will get the following messages:
it: Quando si visita questo sito con la lingua preferita del browser impostata su Inglese e si ricaricano più volte, si riceveranno i seguenti messaggi:

source: Now try create a file called ``translations/it.json`` which contains:
it: Ora prova a creare un file chiamato ''translations/it.json'' che contiene:

source: Set your browser preference to Italian: now the messages will be automatically translated to Italian.
it: Imposta le preferenze del tuo browser su italiano: ora i messaggi verranno automaticamente tradotti in italiano.

source: The Flash fixture
it: L'apparecchio Flash

source: It is common to want to display “alerts” to the users. Here we refer to them as **flash messages**. There is a little more to it than just displaying a message to the view, because flash messages:
it: È comune voler visualizzare "avvisi" agli utenti. Qui ci riferiamo a loro come **messaggi flash**. C'è qualcosa di più della semplice visualizzazione di un messaggio nella vista, perché i messaggi flash:

source: can have state that must be preserved after redirection
it: può avere uno stato che deve essere mantenuto dopo il reindirizzamento

source: can be generated both server side and client side
it: può essere generato sia lato server che lato client

source: may have a type
it: può avere un tipo

source: should be dismissible
it: dovrebbe essere respinto

source: The Flash helper handles the server side of them. Here is an example:
it: L'helper Flash gestisce il lato server. Ecco un esempio:

source: and in the template:
it: e nel modello:

source: By setting the value of the message in the flash helper, a flash variable is returned by the action and this triggers the JS in the template to inject the message in the ``py4web-flash`` DIV which you can position at your convenience. Also the optional class is applied to the injected HTML.
it: Impostando il valore del messaggio nell'helper flash, una variabile flash viene restituita dall'azione e questo attiva il JS nel modello per iniettare il messaggio nel DIV ''py4web-flash'' che puoi posizionare a tuo piacimento. Anche la classe opzionale viene applicata all'HTML inserito.

source: If a page is redirected after a flash is set, the flash is remembered. This is achieved by asking the browser to keep the message temporarily in a one-time cookie. After redirection the message is sent back by the browser to the server and the server sets it again automatically before returning the content, unless it is overwritten by another set.
it: Se una pagina viene reindirizzata dopo l'impostazione di un flash, il flash viene memorizzato. Ciò si ottiene chiedendo al browser di conservare temporaneamente il messaggio in un cookie monouso. Dopo il reindirizzamento, il messaggio viene inviato dal browser al server e il server lo reimposta automaticamente prima di restituire il contenuto, a meno che non venga sovrascritto da un altro set.

source: The client can also set/add flash messages by calling:
it: Il client può anche impostare/aggiungere messaggi flash chiamando:

source: py4web defaults to an alert class called ``info`` and most CSS frameworks define classes for alerts called ``success``, ``error``, ``warning``, ``default``, and ``info``. Yet, there is nothing in py4web that hardcodes those names. You can use your own class names.
it: py4web ha come impostazione predefinita una classe di avvisi chiamata ''info'' e la maggior parte dei framework CSS definisce classi per gli avvisi chiamati ''success'', ''error'', ''warning'', ''default'' e ''info''. Tuttavia, non c'è nulla in py4web che codifica quei nomi. È possibile utilizzare i nomi delle classi.

source: You can see the basic usage of flash messages in the **examples** app.
it: Puoi vedere l'utilizzo di base dei messaggi flash nell'app **examples**.

source: The Session fixture
it: L'appuntamento di Session

source: Simply speaking, a session can be defined as a way to preserve information that is desired to persist throughout the user's interaction with the web site or web application. In other words, sessions render the stateless HTTP connection a stateful one.
it: In parole povere, una sessione può essere definita come un modo per conservare le informazioni che si desidera mantenere durante l'interazione dell'utente con il sito Web o l'applicazione Web. In altre parole, le sessioni rendono la connessione HTTP senza stato una connessione con stato.

source: In py4web, the session object is also a fixture. Here is a simple example of its usage to implement a counter.
it: In py4web, anche l'oggetto sessione è un fixture. Di seguito è riportato un semplice esempio del suo utilizzo per implementare un contatore.

source: The counter will start from 0; its value will be remembered and increased every time you reload the page.
it: Il contatore partirà da 0; Il suo valore verrà ricordato e aumentato ogni volta che ricaricherai la pagina.

source: Opening the page in a new browser tab will give you the updated counter value. Closing and reopening the browser, or opening a new *private window*, will instead restart the counter from 0.
it: L'apertura della pagina in una nuova scheda del browser fornirà il valore del contatore aggiornato. Chiudendo e riaprendo il browser, o aprendo una nuova *finestra privata*, il contatore verrà invece riavviato da 0.

source: Usually the information is saved in the session object are related to the user - like its username, preferences, last pages visited, shopping cart and so on. The session object has the same interface as a Python dictionary but in py4web sessions are always stored using JSON (**JWT** specifically, i.e. `JSON Web Token <https://jwt.io/introduction>`__), therefore you should only store objects that are JSON serializable. If the object is not JSON serializable, it will be serialized using the ``__str__`` operator and some information may be lost.
it: Di solito le informazioni salvate nell'oggetto sessione sono relative all'utente - come il suo nome utente, le preferenze, le ultime pagine visitate, il carrello e così via. L'oggetto sessione ha la stessa interfaccia di un dizionario Python, ma in py4web le sessioni vengono sempre memorizzate utilizzando JSON (**JWT** in particolare, ovvero 'JSON Web Token <https://jwt.io/introduction>'__), pertanto è necessario archiviare solo gli oggetti serializzabili JSON. Se l'oggetto non è serializzabile JSON, verrà serializzato utilizzando l'operatore ''__str__'' e alcune informazioni potrebbero andare perse.

source: The information composing the session object can be saved:
it: Le informazioni che compongono l'oggetto sessione possono essere salvate:

source: client-side, by only using cookies (default)
it: lato client, utilizzando solo i cookie (default)

source: server-side, but you'll still need minimal cookies for identifying the clients
it: lato server, ma avrai comunque bisogno di cookie minimi per identificare i client

source: By default py4web sessions never expire (unless they contain login information, but that is another story) even if an expiration can be set. Other parameters can be specified as well:
it: Per impostazione predefinita le sessioni py4web non scadono mai (a meno che non contengano informazioni di accesso, ma questa è un'altra storia) anche se è possibile impostare una scadenza. È possibile specificare anche altri parametri:

source: Here:
it: Qui:

source: ``secret`` is the passphrase used to sign the information
it: ''segreto'' è la passphrase usata per firmare le informazioni

source: ``expiration`` is the maximum lifetime of the session, in seconds (default = None, i.e. no timeout)
it: ''expiration'' è la durata massima della sessione, in secondi (default = None, cioè nessun timeout)

source: ``algorithm`` is the algorithm to be used for the JWT token signature ('HS256' by default)
it: ''algorithm'' è l'algoritmo da utilizzare per la firma del token JWT ('HS256' per impostazione predefinita)

source: ``storage`` is a parameter that allows to specify an alternate session storage method (for example Redis, or database). If not specified, the default cookie method will be used
it: ''storage'' è un parametro che permette di specificare un metodo alternativo di archiviazione della sessione (ad esempio Redis o database). Se non specificato, verrà utilizzato il metodo predefinito per i cookie

source: ``same_site`` is an option that prevents CSRF attacks (Cross-Site Request Forgery) and is enabled by default with the 'Lax' option. You can read more about it `here <https://owasp.org/www-community/SameSite>`__
it: ''same_site'' è un'opzione che previene gli attacchi CSRF (Cross-Site Request Forgery) ed è abilitata per impostazione predefinita con l'opzione 'Lax'. Puoi leggere di più su di esso 'qui <https://owasp.org/www-community/SameSite>'__

source: ``name`` is the format to use for the session cookie name.
it: ''name'' è il formato da utilizzare per il nome del cookie di sessione.

source: If storage is not provided, session is stored in client-side jwt cookie. Otherwise, we have server-side session: the jwt is stored in storage and only its UUID key is stored in the cookie. This is the reason why the secret is not required with server-side sessions.
it: Se l'archiviazione non viene fornita, la sessione viene memorizzata nel cookie jwt lato client. In caso contrario, abbiamo una sessione lato server: il jwt viene memorizzato in memoria e solo la sua chiave UUID viene memorizzata nel cookie. Questo è il motivo per cui il segreto non è necessario con le sessioni lato server.

source: Client-side session in cookies
it: Sessione lato client nei cookie

source: By default the session object is stored inside a cookie called ``appname_session``. It's a JWT, hence encoded in a URL-friendly string format and signed using the provided secret for preventing tampering. Notice that it's not encrypted (in fact it's quite trivial to read its content from http communications or from disk), so do not place any sensitive information inside, and use a complex secret. If the secret changes existing sessions are invalidated. If the user switches from HTTP to HTTPS or vice versa, the user session is also invalidated. Session in cookies have a small size limit (4 kbytes after being serialized and encoded) so do not put too much into them.
it: Per impostazione predefinita, l'oggetto sessione è memorizzato all'interno di un cookie chiamato ''appname_session''. Si tratta di un token JWT, quindi codificato in un formato stringa compatibile con l'URL e firmato utilizzando il segreto fornito per evitare manomissioni. Si noti che non è crittografato (in realtà è abbastanza banale leggerne il contenuto da comunicazioni http o da disco), quindi non inserire informazioni sensibili all'interno e utilizzare un segreto complesso. Se il segreto viene modificato, le sessioni esistenti vengono invalidate. Se l'utente passa da HTTP a HTTPS o viceversa, anche la sessione utente viene invalidata. I cookie di sessione hanno un limite di dimensioni ridotte (4 kbyte dopo essere stati serializzati e codificati), quindi non inserirli troppo.

source: Server-side session in memcache
it: Sessione lato server in memcache

source: Requires memcache installed and configured.
it: Richiede l'installazione e la configurazione di memcache.

source: Server-side session in Redis
it: Sessione lato server in Redis

source: Requires `Redis <https://redis.io/>`__ installed and configured.
it: Richiede l'installazione e la configurazione di 'Redis <https://redis.io/>'__.

source: Notice: a storage object must have ``get`` and ``set`` methods and the ``set`` method must allow to specify an expiration. The redis connection object has a ``ttl`` method to specify the expiration, hence we monkey patch the ``set`` method to have the expected signature and functionality.
it: Avviso: un oggetto di archiviazione deve avere i metodi ''get'' e ''set'' e il metodo ''set'' deve consentire di specificare una scadenza. L'oggetto connessione redis ha un metodo ''ttl'' per specificare la scadenza, quindi si applica una patch al metodo ''set'' per avere la firma e la funzionalità previste.

source: Server-side session in database
it: Sessione lato server nel database

source: the ``'sqlite:memory'`` database used in this example **cannot be used in multiprocess environment**; the quirk is that your application will still work but in non-deterministic and unsafe mode, since each process/worker will have its own independent in-memory database.
it: Il database '''sqlite:memory''' usato in questo esempio **non può essere usato in ambiente multiprocesso**; La stranezza è che l'applicazione continuerà a funzionare, ma in modalità non deterministica e non sicura, poiché ogni processo/worker avrà il proprio database in memoria indipendente.
