Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-01.po
Languages: it

source: What is py4web?
it: Che cos'è py4web?

source: PY4WEB is a web framework for rapid development of efficient database driven web applications. It is an evolution of the popular web2py framework, but much faster and slicker. Its internal design has been much simplified compared to web2py.
it: PY4WEB è un framework web per lo sviluppo rapido di applicazioni web efficienti basate su database. È un'evoluzione del popolare framework web2py, ma è molto più veloce e più snello. Il suo design interno è stato molto semplificato rispetto a web2py.

source: PY4WEB can be seen as a competitor of other frameworks like Django or Flask, and it can indeed serve the same purpose. Yet PY4WEB aims to provide a larger feature set out of the box and to reduce the development time of new apps.
it: PY4WEB può essere visto come un concorrente di altri framework come Django o Flask, e può effettivamente servire allo stesso scopo. Tuttavia, PY4WEB mira a fornire un set di funzionalità più ampio e a ridurre i tempi di sviluppo di nuove applicazioni.

source: From a historical perspective, our story starts in 2007 when web2py was first released. web2py was designed to provide an all-inclusive solution for web development: one zip file containing the Python interpreter, the framework, a web based IDE, and a collection of battle-tested packages that work well together. In many ways web2py has been immensely successful. Web2py succeeded in providing a low barrier of entry for new developers, a very secure development platform, and remains backwards compatible until today.
it: Da un punto di vista storico, la nostra storia inizia nel 2007, quando web2py è stato rilasciato per la prima volta. web2py è stato progettato per fornire una soluzione all-inclusive per lo sviluppo web: un file zip contenente l'interprete Python, il framework, un IDE basato sul web e una collezione di pacchetti collaudati che lavorano bene insieme. Per molti aspetti web2py ha avuto un enorme successo. Web2py è riuscito a fornire una bassa barriera di ingresso per i nuovi sviluppatori, una piattaforma di sviluppo molto sicura e rimane compatibile con le versioni precedenti fino ad oggi.

source: Web2py always suffered from one problem: its monolithic design. The most experienced Python developers did not understand how to use its components outside of the framework and how to use third party components within the framework. We thought of web2py as a perfect tool that did not have to be broken into pieces because that would compromise its security. It turned out that we were wrong, and playing well with others is important. Hence, since 2015 we worked on three fronts:
it: Web2py ha sempre sofferto di un problema: la sua struttura monolitica. Gli sviluppatori Python più esperti non capivano come utilizzare i suoi componenti al di fuori del framework e come utilizzare componenti di terze parti all'interno del framework. Pensavamo a web2py come a uno strumento perfetto che non doveva essere spezzettato perché ciò avrebbe compromesso la sua sicurezza. Abbiamo scoperto che ci sbagliavamo e che giocare bene con gli altri è importante. Per questo motivo, dal 2015 abbiamo lavorato su tre fronti:

source: We ported web2py to Python 3.
it: Abbiamo portato web2py a Python 3.

source: We broke web2py into modules that can be used independently.
it: Abbiamo suddiviso web2py in moduli che possono essere utilizzati in modo indipendente.

source: We reassembled some of those modules into a new more modular framework … PY4WEB.
it: Abbiamo riassemblato alcuni di questi moduli in un nuovo framework più modulare... PY4WEB.

source: PY4WEB is more than a repackaging. It is a complete redesign. It uses some of the web2py modules, but not all of them. In some cases, it uses other and better modules. Some functionality was removed and some was added. We tried to preserve most of the syntax and features that experienced web2py users loved.
it: PY4WEB è più di un repackaging. È una riprogettazione completa. Utilizza alcuni dei moduli di web2py, ma non tutti. In alcuni casi, utilizza altri e migliori moduli. Alcune funzionalità sono state rimosse e altre sono state aggiunte. Abbiamo cercato di mantenere la maggior parte della sintassi e delle funzionalità che gli utenti esperti di web2py hanno apprezzato.

source: Here is a more explicit list (see :ref:`From web2py to py4web` for more details if you come from web2py):
it: Ecco un elenco più esplicito (vedi :ref:`From web2py to py4web` per maggiori dettagli se provieni da web2py):

source: PY4WEB, unlike web2py, requires Python 3.
it: PY4WEB, a differenza di web2py, richiede Python 3.

source: PY4WEB, unlike web2py, can be installed using pip, and its dependencies are managed using requirements.txt.
it: Le app PY4WEB sono moduli Python regolari. Questo è molto diverso da web2py. In particolare, abbiamo abbandonato l’importatore personalizzato e ora ci affidiamo esclusivamente al meccanismo di importazione regolare di Python.

source: PY4WEB apps are regular Python modules. This is very different from web2py. In particular, we ditched the custom importer, and we rely now exclusively on the regular Python import mechanism.
it: Le applicazioni PY4WEB sono normali moduli Python. Questo è molto diverso da web2py. In particolare, abbiamo abbandonato l'importatore personalizzato e ci affidiamo esclusivamente al normale meccanismo di importazione di Python.

source: PY4WEB, like web2py, can serve multiple applications concurrently, as long as the apps are submodules of the apps module.
it: PY4WEB, come web2py, può servire più applicazioni contemporaneamente, a patto che le app siano sottomoduli del modulo apps.

source: PY4WEB, unlike web2py, is based on ombott (a reduced and faster spin-off of Bottle) and in particular uses a Bottle-compatible request object and routing mechanism.
it: PY4WEB, a differenza di web2py, è basato su ombott (uno spin-off ridotto e più veloce di Bottle) e in particolare utilizza un oggetto di richiesta e un meccanismo di routing compatibili con Bottle.

source: PY4WEB, unlike web2py, does not create a new environment at every request. It introduces the concept of fixtures to explicitly declare which objects need to be (re)initialized when a new http request arrives or needs cleanup when completed. This makes it much faster than web2py.
it: PY4WEB, a differenza di web2py, non crea un nuovo ambiente ad ogni richiesta. Introduce il concetto di fixture per dichiarare in modo esplicito quali oggetti devono essere (re)inizializzati quando arriva una nuova richiesta http o necessita di pulizia una volta completata. Questo lo rende molto più veloce di web2py.

source: PY4WEB, has a new session object which, like web2py’s, provides strong security and encryption of the session data, but sessions are no longer stored in the file system - which created performance issues. It provides sessions in cookies, in redis, in memcache, or optionally in database. We also limited session data to objects that are json serializable.
it: PY4WEB, ha un nuovo oggetto sessione che, come quello di web2py, fornisce una forte sicurezza e crittografia dei dati della sessione, ma le sessioni non sono più memorizzate nel file system - il che creava problemi di prestazioni. Fornisce sessioni in cookie, in redis, in memcache o, facoltativamente, in database. I dati della sessione sono stati inoltre limitati agli oggetti serializzabili in formato json.

source: PY4WEB, like web2py, has a built-in ticketing system but, unlike web2py, this system is global and not per app. Tickets are no longer stored in the filesystem with the individual apps. They are stored in a single database.
it: PY4WEB, come web2py, ha un sistema di ticketing integrato ma, a differenza di web2py, questo sistema è globale e non per app. I ticket non vengono più memorizzati nel file system con le singole app. Sono memorizzati in un unico database.

source: PY4WEB, like web2py, is based on pydal but leverages some new features of pydal (RESTAPI).
it: PY4WEB, come web2py, è basato su pydal ma sfrutta alcune nuove funzionalità di pydal (RESTAPI).

source: PY4WEB, like web2py, uses the yatl template language but defaults to square brackets delimiters to avoid conflicts with model JS frameworks, such as Vue.js and angular.js. Yatl includes a subset of the web2py helpers.
it: PY4WEB, come web2py, usa il linguaggio template yatl ma utilizza i delimitatori tra parentesi quadre per evitare conflitti con i framework JS del modello, come Vue.js e angular.js. Yatl include un sottoinsieme degli helper di web2py.

source: PY4WEB, unlike web2py, uses the pluralization library for internationalization. In practice, this exposes an object T very similar to web2py’s T but it provides better caching and more flexible pluralization capabilities.
it: PY4WEB, a differenza di web2py, utilizza la libreria di pluralizzazione per l'internazionalizzazione. In pratica, questo espone un oggetto T molto simile a T di web2py, ma fornisce un migliore caching e capacità di pluralizzazione più flessibili.

source: PY4WEB comes with a Dashboard APP that replaces web2py’s admin. This is a web IDE for uploading/managing/editing apps.
it: PY4WEB viene fornito con una Dashboard APP che sostituisce l'admin di web2py. Si tratta di un IDE web per il caricamento/gestione/modifica di app.

source: PY4WEB’s Dashboard includes a web based database interface. This replaces the appadmin functionality of web2py.
it: La Dashboard di PY4WEB include un'interfaccia di database basata sul web. Sostituisce la funzionalità appadmin di web2py.

source: PY4WEB comes with Form and Grid objects that are similar to web2py’s SQLFORM and SQLFORM.grid.
it: PY4WEB viene fornito con oggetti Form e Grid che sono simili a SQLFORM e SQLFORM.grid di web2py.

source: PY4WEB comes with an Auth object that replaces the web2py one. It is more modular and easier to extend. Out of the box, it provides the basic functionality of register, login, logout, change password, request change password, edit profile as well as integration with PAM, SAML2, LDAP, OAUTH2 (google, facebook, and twitter).
it: PY4WEB viene fornito con un oggetto Auth che sostituisce quello di web2py. È più modulare e più facile da estendere. Pronto all'uso, fornisce le funzionalità di base di registrazione, accesso, disconnessione, modifica password, richiesta di modifica password, modifica profilo e integrazione con PAM, SAML2, LDAP, OAUTH2 (google, facebook e twitter).

source: PY4WEB leverages PyDAL's new tags functionality to tag users with groups, search users by groups, and apply permissions based on membership.
it: PY4WEB sfrutta la nuova funzionalità dei tag di PyDAL per taggare gli utenti con gruppi, cercare gli utenti per gruppi e applicare autorizzazioni in base all'appartenenza.

source: PY4WEB comes with with some custom Vue.js components designed to interact with the PyDAL RESTAPI, and with PY4WEB in general. These APIs are designed to allow the server to set policies about which operations a client is allowed to perform, but give the client flexibility within those constraints. The two main components are mtable (which provides a web based interface to the database similar to web2py’s grid) and auth (a customizable interface to the Auth API).
it: PY4WEB viene fornito con alcuni componenti Vue.js personalizzati progettati per interagire con PyDAL RESTAPI, e con PY4WEB in generale. Queste API sono progettate per consentire al server di impostare criteri sulle operazioni che un client è autorizzato a eseguire, ma offrono al client flessibilità all'interno di tali vincoli. I due componenti principali sono mtable (che fornisce un'interfaccia web based al database simile alla griglia di web2py) e auth (un'interfaccia personalizzabile per l'API di autenticazione).

source: The goal of PY4WEB is and remains the same as web2py’s: to make web development easy and accessible, while producing applications that are fast and secure.
it: L'obiettivo di PY4WEB è e rimane lo stesso di web2py: rendere lo sviluppo web facile e accessibile, producendo applicazioni veloci e sicure.

source: Acknowledgments
it: Riconoscimenti

source: Many thanks to everyone who has contributed to the project, and especially:
it: Grazie di cuore a tutti coloro che hanno contribuito al progetto, e in particolare:

source: Sam de Alfaro sam@dealfaro.com (logo design)
it: Sam de Alfaro sam@dealfaro.com (design del logo)

source: Special thanks to Sam de Alfaro, who designed the official logo of py4web. We friendly call the logo "Axel the axolotl": it magically represents the sense of kindness and inclusion. We believe it's the cornerstone of our growing community.
it: Un ringraziamento speciale a Sam de Alfaro, che ha disegnato il logo ufficiale di py4web. Chiamiamo amichevolmente il logo "Axel l'axolotl": rappresenta magicamente il senso di gentilezza e inclusione. Crediamo che sia la pietra angolare della nostra comunità in crescita.
