Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-08.po
Languages: it

source: The RestAPI
it: L'API Rest

source: Since version 19.5.10 pyDAL includes a restful API [CIT0801]_ called RestAPI. It is inspired by GraphQL [CIT0802]_ and while it’s not quite the same due to it being less powerful, it is in the spirit of py4web since it's more practical and easier to use.
it: Dalla versione 19.5.10 pyDAL include un'API restful [CIT0801]_ chiamata RestAPI. Si ispira a GraphQL [CIT0802]_ e anche se non è proprio la stessa cosa a causa del fatto che è meno potente, è nello spirito di py4web poiché è più pratico e più facile da usare.

source: Like GraphQL RestAPI allows a client to query for information using the GET method and allows to specify some details about the format of the response (which references to follow, and how to denormalize the data). Unlike GraphQL it allows the server to specify a policy and restrict which queries are allowed and which ones are not. They can be evaluated dynamically per request based on the user and the state of the server.
it: Come GraphQL, RestAPI consente a un client di eseguire query per ottenere informazioni utilizzando il metodo GET e consente di specificare alcuni dettagli sul formato della risposta (quali riferimenti seguire e come denormalizzare i dati). A differenza di GraphQL, consente al server di specificare una policy e limitare quali query sono consentite e quali no. Possono essere valutati dinamicamente per ogni richiesta in base all'utente e allo stato del server.

source: As the name implies RestAPI allows all standard methods: GET, POST, PUT, and DELETE. Each of them can be enabled or disabled based on the policy, for individual tables and individual fields.
it: Come suggerisce il nome, RestAPI consente tutti i metodi standard: GET, POST, PUT e DELETE. Ognuno di essi può essere abilitato o disabilitato in base al criterio, per singole tabelle e singoli campi.

source: Specifications might be subject to changes since this is a new feature.
it: Le specifiche potrebbero essere soggette a modifiche poiché si tratta di una nuova funzionalità.

source: In the examples below we assume a simple app called “superheroes”:
it: Negli esempi seguenti assumiamo una semplice app chiamata "supereroi":

source: RestAPI policies and actions
it: Criteri e azioni RestAPI

source: The policy is per table (or * for all tables) and per method. ``authorize`` can be True (allow), False (deny) or a function with the signature (method, tablename, record_id, get_vars, post_vars) which returns True/False. For the GET policy one can specify a list of allowed query patterns (* for all). A query pattern will be matched against the keys in the query string.
it: Il criterio è per tabella (o * per tutte le tabelle) e per metodo. ''authorize'' può essere True (allow), False (deny) o una funzione con la firma (method, tablename, record_id, get_vars, post_vars) che restituisce True/False. Per il criterio GET è possibile specificare un elenco di modelli di query consentiti (* per tutti). Un modello di query verrà confrontato con le chiavi nella stringa di query.

source: The above action is exposed as:
it: L'azione di cui sopra è esposta come:

source: The result can be seen directly with a browser, rendered as JSON. Let's look for example at the ``person`` table:
it: Il risultato può essere visualizzato direttamente con un browser, renderizzato come JSON. Diamo un'occhiata ad esempio alla tabella ''persona'':

source: The diagram of the superhero's database should help you interpreting the code:
it: Il diagramma del database del supereroe dovrebbe aiutarti a interpretare il codice:

source: Keep in mind that **request.POST** only contains the form data that is posted using a **regular HTML-form** or **JavaScript FormData** object.
it: Tieni presente che **richiesta. POST** contiene solo i dati del modulo che vengono inviati utilizzando un **normale modulo HTML** o un oggetto FormData **JavaScript**.

source: The general query has the form ``{something}.eq=value`` where ``eq=`` stands for “equal”, ``gt=`` stands for “greater than”, etc. The expression can be prepended by ``not.``.
it: La query generale ha la forma ''{something}.eq=value'' dove ''eq='' sta per "uguale", ''gt='' sta per "maggiore di", ecc. L'espressione può essere preceduta da ''non.''.

source: ``{something}`` can be:
it: ''{something}'' può essere:

source: the name of a field in the table being queried as in:
it: Nome di un campo nella tabella su cui viene eseguita la query, come in:

source: **All superheroes called “Superman”**
it: **Tutti i supereroi chiamati "Superman"**

source: the name of a field of a table referred by the table being queried as in:
it: Il nome di un campo di una tabella a cui fa riferimento la tabella interrogata come in:

source: **All superheroes with real identity “Clark Kent”**
it: **Tutti i supereroi con la vera identità "Clark Kent"**

source: the name of a field of a table that refers to the table being queried as in:
it: Nome di un campo di una tabella che fa riferimento alla tabella su cui viene eseguita la query, come in:

source: **All superheroes with any tag superpower with strength > 90**
it: **Tutti i supereroi con qualsiasi superpotere tag con forza > 90**

source: (here ``tag`` is the name of the link table, the preceding ``superhero`` is the name of the field that refers to the selected table and ``strength`` is the name of the field used to filter)
it: (qui ''tag'' è il nome della tabella dei collegamenti, il precedente ''superhero'' è il nome del campo che si riferisce alla tabella selezionata e ''strength'' è il nome del campo usato per filtrare)

source: a field of the table referenced by a many-to-many linked table as in:
it: Un campo della tabella a cui fa riferimento una tabella collegata molti-a-molti, come in:

source: **All superheroes with the flight power**
it: **Tutti i supereroi con il potere di volo**

source: The key to understand the syntax above is to read it as:
it: La chiave per comprendere la sintassi di cui sopra è leggerla come:

source: << select records of table **superhero** referred by field **superhero** of table **tag**, when the **superpower** field of said table points to a record with **description** equal to “Flight” >>
it: << selezionare i record della tabella **supereroe** riferiti dal campo **supereroe** della tabella **tag**, quando il campo **superpotenza** di detta tabella punta a un record con **descrizione** uguale a "Volo" >>

source: The query allows additional modifiers for example:
it: La query consente modificatori aggiuntivi, ad esempio:

source: The first 3 are obvious. ``@model`` returns a JSON description of database model. ``@lookup`` denormalizes the linked field.
it: I primi 3 sono ovvi. ''@model'' restituisce una descrizione JSON del modello di database. ''@lookup'' denormalizza il campo collegato.

source: RestAPI practical examples
it: Esempi pratici di RestAPI

source: Here are some practical examples:
it: Ecco alcuni esempi pratici:

source: OUTPUT:
it: PRODOTTO:

source: (denormalize the real_identity and rename it identity)
it: (denormalizzare il real_identity e rinominarne l'identità)

source: (denormalize the real_identity [but only fields name and job], collapse the with the identity prefix)
it: (denormalizzare il real_identity [ma solo i campi nome e lavoro], comprimere il con il prefisso identità)

source: URL (it's a single line, split for readability):
it: URL (è una singola riga, divisa per la leggibilità):

source: The RestAPI response
it: La risposta di RestAPI

source: All RestAPI response have the fields:
it: Tutte le risposte RestAPI hanno i campi:

source: RestAPI version.
it: Versione RestAPI.

source: Datetime in ISO 8601 format.
it: Data/ora in formato ISO 8601.

source: status
it: stato

source: RestAPI status (i.e. "success" or "error").
it: Stato di RestAPI (ad esempio "successo" o "errore").

source: code
it: codice

source: HTTP status.
it: Stato HTTP.

source: Other optional fields are:
it: Altri campi facoltativi sono:

source: count
it: conteggio

source: Total matching (not total returned), for GET.
it: Corrispondenza totale (non totale restituito), per GET.

source: items
it: oggetti

source: In response to a GET.
it: In risposta a un GET.

source: errors
it: errori

source: Usually a validation error.
it: Di solito si tratta di un errore di convalida.

source: models
it: modelli

source: Usually if status != "success".
it: Di solito se status != "success".

source: message
it: messaggio

source: For error details.
it: Per i dettagli sull'errore.
