Repository: shanayamalik/py4web
Catalog: docs/locales/*/LC_MESSAGES/chapter-12.po
Languages: it

source: As with all other validators this requirement is enforced at the form processing level, not at the database level. This means that there is a small probability that, if two visitors try to concurrently insert records with the same person.name, this results in a race condition and both records are accepted. It is therefore safer to also inform the database that this field should have a unique value:
it: Come per tutti gli altri validatori, questo requisito viene applicato a livello di elaborazione del modulo, non a livello di database. Ciò significa che esiste una piccola probabilità che, se due visitatori tentano di inserire contemporaneamente record con lo stesso person.name, ciò si traduce in una race condition ed entrambi i record vengono accettati. È quindi più sicuro informare anche il database che questo campo deve avere un valore univoco:

source: Now if a race condition occurs, the database raises an OperationalError and one of the two inserts is rejected.
it: A questo punto, se si verifica una race condition, il database genera un errore operativo e uno dei due inserimenti viene rifiutato.

source: The first argument of ``IS_NOT_IN_DB`` can be a database connection or a Set. In the latter case, you would be checking only the set defined by the Set.
it: Il primo argomento di ''IS_NOT_IN_DB'' può essere una connessione al database o un Set. In quest'ultimo caso, si controllerà solo l'insieme definito dall'insieme.

source: A complete argument list for ``IS_NOT_IN_DB()`` is as follows:
it: Un elenco completo di argomenti per ''IS_NOT_IN_DB()'' è il seguente:

source: The following code, for example, does not allow registration of two persons with the same name within 10 days of each other:
it: Il seguente codice, ad esempio, non consente la registrazione di due persone con lo stesso nome entro 10 giorni l'una dall'altra:

source: Synopsis: ``IS_IN_DB(db|set, 'table.value_field', '%(representing_field)s', zero='choose one')`` where the third and fourth arguments are optional.
it: Sinossi: ''IS_IN_DB(db|set, 'table.value_field', '%(representing_field)s', zero='scegline uno')'' dove il terzo e il quarto argomento sono facoltativi.

source: ``multiple=`` is also possible if the field type is a list. The default is False. It can be set to True or to a tuple (min, max) to restrict the number of values selected. So ``multiple=(1, 10)`` enforces at least one and at most ten selections.
it: ''multiple='' è possibile anche se il tipo di campo è una lista. Il valore predefinito è False. Può essere impostato su True o su una tupla (min, max) per limitare il numero di valori selezionati. Quindi ''multiple=(1, 10)'' impone almeno una e al massimo dieci selezioni.

source: Other optional arguments are discussed below.
it: Altri argomenti facoltativi sono discussi di seguito.

source: Example Consider the following tables and requirement:
it: Esempio Si considerino le tabelle e i requisiti seguenti:

source: the IS_IN_DB requirement could also be written to use a Set instead of db
it: il requisito IS_IN_DB potrebbe anche essere scritto per usare un Set invece di db

source: It is enforced at the level of dog INSERT/UPDATE/DELETE forms. This example requires that a ``dog.owner`` be a valid id in the field ``person.id`` in the database ``db``. Because of this validator, the ``dog.owner`` field is represented as a drop-down list. The third argument of the validator is a string that describes the elements in the drop-down list, this is passed to the ``label`` argument of the validator. In the example you want to see the person ``%(name)s`` instead of the person ``%(id)s``. ``%(...)s`` is replaced by the value of the field in brackets for each record. Other accepted values for the ``label`` are a Field instance (e.g. you could use db.person.name instead of '%(name)s') or even a callable that takes a row and returns the description for the option.
it: Viene applicato a livello di moduli INSERISCI/AGGIORNA/ELIMINA del cane. Questo esempio richiede che ''dog.owner'' sia un id valido nel campo ''person.id'' nel database ''db''. A causa di questo validatore, il campo ''dog.owner'' è rappresentato come un elenco a discesa. Il terzo argomento del validatore è una stringa che descrive gli elementi nell'elenco a discesa, questo viene passato all'argomento ''label'' del validatore. Nell'esempio si vuole vedere la persona ''%(name)s'' invece della persona ''%(id)s''. ``%(...) s'' è sostituito dal valore del campo tra parentesi quadre per ogni record. Altri valori accettati per ''label'' sono un'istanza Field (ad esempio si potrebbe usare db.person.name invece di '%(name)s') o anche un callable che prende una riga e restituisce la descrizione per l'opzione.

source: The ``zero`` option works very much like for the ``IS_IN_SET`` validator.
it: L'opzione ''zero'' funziona in modo molto simile al validatore ''IS_IN_SET''.

source: Other optional arguments accepted by ``IS_IN_DB`` are: ``orderby``, ``groupby``, ``distinct``, ``cache``, and ``left``; these are passed to the db select (see :ref:`their description <orderby, groupby, limitby>` on the DAL chapter).
it: Altri argomenti facoltativi accettati da ''IS_IN_DB'' sono: ''orderby'', ''groupby'', ''distinct'', ''cache'' e ''left''; questi vengono passati al db select (vedere :ref:'their description <orderby, groupby, limitby>' nel capitolo DAL).

source: **Notice** that ``groupby``, ``distinct``, and ``left`` do not apply to Google App Engine.
it: **Si noti** che ''groupby'', ''distinct'' e ''left'' non si applicano a Google App Engine.

source: To alphabetically sort the options listed in the drop-down list you can set the ``sort`` argument to ``True`` (sorting is case-insensitive), this may be usefull when no ``orderby`` is feasible or practical.
it: Per ordinare alfabeticamente le opzioni elencate nell'elenco a discesa è possibile impostare l'argomento ''sort'' a ''True'' (l'ordinamento non fa distinzione tra maiuscole e minuscole), questo può essere utile quando non è fattibile o pratico ''orderby''.

source: The first argument of the validator can be a database connection or a DAL Set, as in ``IS_NOT_IN_DB``. This can be useful for example when wishing to limit the records in the drop-down list. In this example, we use ``IS_IN_DB`` in a controller to limit the records dynamically each time the controller is called:
it: Il primo argomento del validatore può essere una connessione al database o un set DAL, come in ''IS_NOT_IN_DB''. Ciò può essere utile, ad esempio, quando si desidera limitare i record nell'elenco a discesa. In questo esempio, usiamo ''IS_IN_DB'' in un controller per limitare i record dinamicamente ogni volta che il controller viene chiamato:

source: If you want the field validated, but you do not want a drop-down, you must put the validator in a list.
it: Se si desidera convalidare il campo, ma non si desidera un elenco a discesa, è necessario inserire il validatore in un elenco.

source: Occasionally you want the drop-down (so you do not want to use the list syntax above) yet you want to use additional validators. For this purpose the ``IS_IN_DB`` validator takes an extra argument ``_and`` that can point to a list of other validators applied if the validated value passes the ``IS_IN_DB`` validation. For example to validate all dog owners in db that are not in a subset:
it: Occasionalmente si desidera il menu a discesa (quindi non si desidera utilizzare la sintassi dell'elenco precedente) ma si desidera utilizzare validatori aggiuntivi. A questo scopo il validatore ''IS_IN_DB'' accetta un argomento aggiuntivo ''_and'' che può puntare a una lista di altri validatori applicati se il valore convalidato supera la convalida ''IS_IN_DB''. Ad esempio, per convalidare tutti i proprietari di cani in db che non sono in un sottoinsieme:

source: ``IS_IN_DB`` and Tagging
it: ''IS_IN_DB'' e Tagging

source: The ``IS_IN_DB`` validator has an optional attribute ``multiple=False``. If set to ``True`` multiple values can be stored in one field. This field should be of type ``list:reference`` as discussed in :ref:`list_type and contains`. An explicit example of tagging is discussed there. Multiple references are handled automatically in create and update forms, but they are transparent to the DAL. We strongly suggest using the jQuery multiselect plugin to render multiple fields.
it: Il validatore ''IS_IN_DB'' ha un attributo opzionale ''multiple=False''. Se impostato su ''True'' è possibile memorizzare più valori in un campo. Questo campo dovrebbe essere di tipo ''list:reference'' come discusso in :ref:'list_type and contains'. Un esempio esplicito di tagging viene discusso qui. I riferimenti multipli vengono gestiti automaticamente nei moduli di creazione e aggiornamento, ma sono trasparenti per il DAL. Si consiglia vivamente di utilizzare il plug-in jQuery multiselect per eseguire il rendering di più campi.

source: Validation functions
it: Funzioni di convalida

source: In order to explicitly define a validation function, we pass to the ``validation`` parameter a function that takes the form and returns a dictionary, mapping field names to errors. If the dictionary is non-empty, the errors will be displayed to the user, and no database I/O will take place.
it: Per definire in modo esplicito una funzione di validazione, passiamo al parametro ''validation'' una funzione che prende la forma e restituisce un dizionario, mappando i nomi dei campi agli errori. Se il dizionario non è vuoto, gli errori verranno visualizzati all'utente e non verrà eseguito alcun I/O del database.

source: Here is an example:
it: Ecco un esempio:
